export default {
  "provinceList": [
    {
      "name": "山东省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "莱城区",
              "key": "371202"
            },
            {
              "name": "市辖区",
              "key": "371201"
            },
            {
              "name": "钢城区",
              "key": "371203"
            }
          ],
          "name": "莱芜市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "370101"
            },
            {
              "name": "历城区",
              "key": "370112"
            },
            {
              "name": "历下区",
              "key": "370102"
            },
            {
              "name": "长清区",
              "key": "370113"
            },
            {
              "name": "平阴县",
              "key": "370124"
            },
            {
              "name": "章丘市",
              "key": "370181"
            },
            {
              "name": "市中区",
              "key": "370103"
            },
            {
              "name": "济阳县",
              "key": "370125"
            },
            {
              "name": "槐荫区",
              "key": "370104"
            },
            {
              "name": "商河县",
              "key": "370126"
            },
            {
              "name": "天桥区",
              "key": "370105"
            }
          ],
          "name": "济南市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "371101"
            },
            {
              "name": "莒县",
              "key": "371122"
            },
            {
              "name": "岚山区",
              "key": "371103"
            },
            {
              "name": "东港区",
              "key": "371102"
            },
            {
              "name": "五莲县",
              "key": "371121"
            }
          ],
          "name": "日照市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "黄岛区",
              "key": "370211"
            },
            {
              "name": "市辖区",
              "key": "370201"
            },
            {
              "name": "崂山区",
              "key": "370212"
            },
            {
              "name": "即墨市",
              "key": "370282"
            },
            {
              "name": "平度市",
              "key": "370283"
            },
            {
              "name": "莱西市",
              "key": "370285"
            },
            {
              "name": "胶州市",
              "key": "370281"
            },
            {
              "name": "市南区",
              "key": "370202"
            },
            {
              "name": "李沧区",
              "key": "370213"
            },
            {
              "name": "市北区",
              "key": "370203"
            },
            {
              "name": "城阳区",
              "key": "370214"
            }
          ],
          "name": "青岛市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宁津县",
              "key": "371422"
            },
            {
              "name": "禹城市",
              "key": "371482"
            },
            {
              "name": "乐陵市",
              "key": "371481"
            },
            {
              "name": "武城县",
              "key": "371428"
            },
            {
              "name": "夏津县",
              "key": "371427"
            },
            {
              "name": "德城区",
              "key": "371402"
            },
            {
              "name": "临邑县",
              "key": "371424"
            },
            {
              "name": "市辖区",
              "key": "371401"
            },
            {
              "name": "庆云县",
              "key": "371423"
            },
            {
              "name": "平原县",
              "key": "371426"
            },
            {
              "name": "陵城区",
              "key": "371403"
            },
            {
              "name": "齐河县",
              "key": "371425"
            }
          ],
          "name": "德州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "桓台县",
              "key": "370321"
            },
            {
              "name": "高青县",
              "key": "370322"
            },
            {
              "name": "临淄区",
              "key": "370305"
            },
            {
              "name": "周村区",
              "key": "370306"
            },
            {
              "name": "市辖区",
              "key": "370301"
            },
            {
              "name": "沂源县",
              "key": "370323"
            },
            {
              "name": "淄川区",
              "key": "370302"
            },
            {
              "name": "张店区",
              "key": "370303"
            },
            {
              "name": "博山区",
              "key": "370304"
            }
          ],
          "name": "淄博市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沂南县",
              "key": "371321"
            },
            {
              "name": "市辖区",
              "key": "371301"
            },
            {
              "name": "河东区",
              "key": "371312"
            },
            {
              "name": "沂水县",
              "key": "371323"
            },
            {
              "name": "罗庄区",
              "key": "371311"
            },
            {
              "name": "郯城县",
              "key": "371322"
            },
            {
              "name": "临沭县",
              "key": "371329"
            },
            {
              "name": "蒙阴县",
              "key": "371328"
            },
            {
              "name": "费县",
              "key": "371325"
            },
            {
              "name": "兰山区",
              "key": "371302"
            },
            {
              "name": "兰陵县",
              "key": "371324"
            },
            {
              "name": "莒南县",
              "key": "371327"
            },
            {
              "name": "平邑县",
              "key": "371326"
            }
          ],
          "name": "临沂市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "环翠区",
              "key": "371002"
            },
            {
              "name": "市辖区",
              "key": "371001"
            },
            {
              "name": "文登区",
              "key": "371003"
            },
            {
              "name": "荣成市",
              "key": "371082"
            },
            {
              "name": "乳山市",
              "key": "371083"
            }
          ],
          "name": "威海市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "曲阜市",
              "key": "370881"
            },
            {
              "name": "邹城市",
              "key": "370883"
            },
            {
              "name": "微山县",
              "key": "370826"
            },
            {
              "name": "鱼台县",
              "key": "370827"
            },
            {
              "name": "金乡县",
              "key": "370828"
            },
            {
              "name": "嘉祥县",
              "key": "370829"
            },
            {
              "name": "任城区",
              "key": "370811"
            },
            {
              "name": "市辖区",
              "key": "370801"
            },
            {
              "name": "兖州区",
              "key": "370812"
            },
            {
              "name": "汶上县",
              "key": "370830"
            },
            {
              "name": "泗水县",
              "key": "370831"
            },
            {
              "name": "梁山县",
              "key": "370832"
            }
          ],
          "name": "济宁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新泰市",
              "key": "370982"
            },
            {
              "name": "宁阳县",
              "key": "370921"
            },
            {
              "name": "岱岳区",
              "key": "370911"
            },
            {
              "name": "市辖区",
              "key": "370901"
            },
            {
              "name": "东平县",
              "key": "370923"
            },
            {
              "name": "泰山区",
              "key": "370902"
            },
            {
              "name": "肥城市",
              "key": "370983"
            }
          ],
          "name": "泰安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "滕州市",
              "key": "370481"
            },
            {
              "name": "峄城区",
              "key": "370404"
            },
            {
              "name": "台儿庄区",
              "key": "370405"
            },
            {
              "name": "山亭区",
              "key": "370406"
            },
            {
              "name": "市辖区",
              "key": "370401"
            },
            {
              "name": "市中区",
              "key": "370402"
            },
            {
              "name": "薛城区",
              "key": "370403"
            }
          ],
          "name": "枣庄市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "邹平县",
              "key": "371626"
            },
            {
              "name": "沾化区",
              "key": "371603"
            },
            {
              "name": "博兴县",
              "key": "371625"
            },
            {
              "name": "阳信县",
              "key": "371622"
            },
            {
              "name": "惠民县",
              "key": "371621"
            },
            {
              "name": "滨城区",
              "key": "371602"
            },
            {
              "name": "市辖区",
              "key": "371601"
            },
            {
              "name": "无棣县",
              "key": "371623"
            }
          ],
          "name": "滨州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "河口区",
              "key": "370503"
            },
            {
              "name": "垦利区",
              "key": "370505"
            },
            {
              "name": "利津县",
              "key": "370522"
            },
            {
              "name": "市辖区",
              "key": "370501"
            },
            {
              "name": "广饶县",
              "key": "370523"
            },
            {
              "name": "东营区",
              "key": "370502"
            }
          ],
          "name": "东营市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "阳谷县",
              "key": "371521"
            },
            {
              "name": "临清市",
              "key": "371581"
            },
            {
              "name": "高唐县",
              "key": "371526"
            },
            {
              "name": "市辖区",
              "key": "371501"
            },
            {
              "name": "茌平县",
              "key": "371523"
            },
            {
              "name": "莘县",
              "key": "371522"
            },
            {
              "name": "冠县",
              "key": "371525"
            },
            {
              "name": "东昌府区",
              "key": "371502"
            },
            {
              "name": "东阿县",
              "key": "371524"
            }
          ],
          "name": "聊城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "莱阳市",
              "key": "370682"
            },
            {
              "name": "莱州市",
              "key": "370683"
            },
            {
              "name": "蓬莱市",
              "key": "370684"
            },
            {
              "name": "招远市",
              "key": "370685"
            },
            {
              "name": "龙口市",
              "key": "370681"
            },
            {
              "name": "芝罘区",
              "key": "370602"
            },
            {
              "name": "莱山区",
              "key": "370613"
            },
            {
              "name": "栖霞市",
              "key": "370686"
            },
            {
              "name": "海阳市",
              "key": "370687"
            },
            {
              "name": "福山区",
              "key": "370611"
            },
            {
              "name": "市辖区",
              "key": "370601"
            },
            {
              "name": "牟平区",
              "key": "370612"
            },
            {
              "name": "长岛县",
              "key": "370634"
            }
          ],
          "name": "烟台市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "青州市",
              "key": "370781"
            },
            {
              "name": "诸城市",
              "key": "370782"
            },
            {
              "name": "寿光市",
              "key": "370783"
            },
            {
              "name": "安丘市",
              "key": "370784"
            },
            {
              "name": "市辖区",
              "key": "370701"
            },
            {
              "name": "潍城区",
              "key": "370702"
            },
            {
              "name": "临朐县",
              "key": "370724"
            },
            {
              "name": "寒亭区",
              "key": "370703"
            },
            {
              "name": "昌乐县",
              "key": "370725"
            },
            {
              "name": "坊子区",
              "key": "370704"
            },
            {
              "name": "高密市",
              "key": "370785"
            },
            {
              "name": "昌邑市",
              "key": "370786"
            },
            {
              "name": "奎文区",
              "key": "370705"
            }
          ],
          "name": "潍坊市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "东明县",
              "key": "371728"
            },
            {
              "name": "定陶区",
              "key": "371703"
            },
            {
              "name": "郓城县",
              "key": "371725"
            },
            {
              "name": "牡丹区",
              "key": "371702"
            },
            {
              "name": "巨野县",
              "key": "371724"
            },
            {
              "name": "鄄城县",
              "key": "371726"
            },
            {
              "name": "曹县",
              "key": "371721"
            },
            {
              "name": "市辖区",
              "key": "371701"
            },
            {
              "name": "成武县",
              "key": "371723"
            },
            {
              "name": "单县",
              "key": "371722"
            }
          ],
          "name": "菏泽市",
          "key": "name"
        }
      ]
    },
    {
      "name": "甘肃省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "文县",
              "key": "621222"
            },
            {
              "name": "成县",
              "key": "621221"
            },
            {
              "name": "武都区",
              "key": "621202"
            },
            {
              "name": "康县",
              "key": "621224"
            },
            {
              "name": "市辖区",
              "key": "621201"
            },
            {
              "name": "宕昌县",
              "key": "621223"
            },
            {
              "name": "礼县",
              "key": "621226"
            },
            {
              "name": "西和县",
              "key": "621225"
            },
            {
              "name": "两当县",
              "key": "621228"
            },
            {
              "name": "徽县",
              "key": "621227"
            }
          ],
          "name": "陇南市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "永登县",
              "key": "620121"
            },
            {
              "name": "红古区",
              "key": "620111"
            },
            {
              "name": "皋兰县",
              "key": "620122"
            },
            {
              "name": "市辖区",
              "key": "620101"
            },
            {
              "name": "榆中县",
              "key": "620123"
            },
            {
              "name": "城关区",
              "key": "620102"
            },
            {
              "name": "七里河区",
              "key": "620103"
            },
            {
              "name": "西固区",
              "key": "620104"
            },
            {
              "name": "安宁区",
              "key": "620105"
            }
          ],
          "name": "兰州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "621101"
            },
            {
              "name": "渭源县",
              "key": "621123"
            },
            {
              "name": "陇西县",
              "key": "621122"
            },
            {
              "name": "漳县",
              "key": "621125"
            },
            {
              "name": "安定区",
              "key": "621102"
            },
            {
              "name": "临洮县",
              "key": "621124"
            },
            {
              "name": "通渭县",
              "key": "621121"
            },
            {
              "name": "岷县",
              "key": "621126"
            }
          ],
          "name": "定西市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "620201"
            }
          ],
          "name": "嘉峪关市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "永昌县",
              "key": "620321"
            },
            {
              "name": "市辖区",
              "key": "620301"
            },
            {
              "name": "金川区",
              "key": "620302"
            }
          ],
          "name": "金昌市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "西峰区",
              "key": "621002"
            },
            {
              "name": "合水县",
              "key": "621024"
            },
            {
              "name": "市辖区",
              "key": "621001"
            },
            {
              "name": "华池县",
              "key": "621023"
            },
            {
              "name": "宁县",
              "key": "621026"
            },
            {
              "name": "正宁县",
              "key": "621025"
            },
            {
              "name": "环县",
              "key": "621022"
            },
            {
              "name": "庆城县",
              "key": "621021"
            },
            {
              "name": "镇原县",
              "key": "621027"
            }
          ],
          "name": "庆阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "夏河县",
              "key": "623027"
            },
            {
              "name": "玛曲县",
              "key": "623025"
            },
            {
              "name": "碌曲县",
              "key": "623026"
            },
            {
              "name": "合作市",
              "key": "623001"
            },
            {
              "name": "舟曲县",
              "key": "623023"
            },
            {
              "name": "迭部县",
              "key": "623024"
            },
            {
              "name": "临潭县",
              "key": "623021"
            },
            {
              "name": "卓尼县",
              "key": "623022"
            }
          ],
          "name": "甘南藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "静宁县",
              "key": "620826"
            },
            {
              "name": "灵台县",
              "key": "620822"
            },
            {
              "name": "市辖区",
              "key": "620801"
            },
            {
              "name": "崇信县",
              "key": "620823"
            },
            {
              "name": "崆峒区",
              "key": "620802"
            },
            {
              "name": "华亭县",
              "key": "620824"
            },
            {
              "name": "庄浪县",
              "key": "620825"
            },
            {
              "name": "泾川县",
              "key": "620821"
            }
          ],
          "name": "平凉市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "玉门市",
              "key": "620981"
            },
            {
              "name": "敦煌市",
              "key": "620982"
            },
            {
              "name": "金塔县",
              "key": "620921"
            },
            {
              "name": "瓜州县",
              "key": "620922"
            },
            {
              "name": "市辖区",
              "key": "620901"
            },
            {
              "name": "肃北蒙古族自治县",
              "key": "620923"
            },
            {
              "name": "肃州区",
              "key": "620902"
            },
            {
              "name": "阿克塞哈萨克族自治县",
              "key": "620924"
            }
          ],
          "name": "酒泉市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "靖远县",
              "key": "620421"
            },
            {
              "name": "会宁县",
              "key": "620422"
            },
            {
              "name": "市辖区",
              "key": "620401"
            },
            {
              "name": "景泰县",
              "key": "620423"
            },
            {
              "name": "白银区",
              "key": "620402"
            },
            {
              "name": "平川区",
              "key": "620403"
            }
          ],
          "name": "白银市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "麦积区",
              "key": "620503"
            },
            {
              "name": "张家川回族自治县",
              "key": "620525"
            },
            {
              "name": "清水县",
              "key": "620521"
            },
            {
              "name": "秦安县",
              "key": "620522"
            },
            {
              "name": "市辖区",
              "key": "620501"
            },
            {
              "name": "甘谷县",
              "key": "620523"
            },
            {
              "name": "秦州区",
              "key": "620502"
            },
            {
              "name": "武山县",
              "key": "620524"
            }
          ],
          "name": "天水市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "凉州区",
              "key": "620602"
            },
            {
              "name": "民勤县",
              "key": "620621"
            },
            {
              "name": "古浪县",
              "key": "620622"
            },
            {
              "name": "市辖区",
              "key": "620601"
            },
            {
              "name": "天祝藏族自治县",
              "key": "620623"
            }
          ],
          "name": "武威市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "积石山保安族东乡族撒拉族自治县",
              "key": "622927"
            },
            {
              "name": "广河县",
              "key": "622924"
            },
            {
              "name": "临夏市",
              "key": "622901"
            },
            {
              "name": "永靖县",
              "key": "622923"
            },
            {
              "name": "东乡族自治县",
              "key": "622926"
            },
            {
              "name": "和政县",
              "key": "622925"
            },
            {
              "name": "康乐县",
              "key": "622922"
            },
            {
              "name": "临夏县",
              "key": "622921"
            }
          ],
          "name": "临夏回族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "620701"
            },
            {
              "name": "临泽县",
              "key": "620723"
            },
            {
              "name": "甘州区",
              "key": "620702"
            },
            {
              "name": "高台县",
              "key": "620724"
            },
            {
              "name": "山丹县",
              "key": "620725"
            },
            {
              "name": "肃南裕固族自治县",
              "key": "620721"
            },
            {
              "name": "民乐县",
              "key": "620722"
            }
          ],
          "name": "张掖市",
          "key": "name"
        }
      ]
    },
    {
      "name": "江苏省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "市辖区",
              "key": "321001"
            },
            {
              "name": "江都区",
              "key": "321012"
            },
            {
              "name": "宝应县",
              "key": "321023"
            },
            {
              "name": "高邮市",
              "key": "321084"
            },
            {
              "name": "仪征市",
              "key": "321081"
            },
            {
              "name": "广陵区",
              "key": "321002"
            },
            {
              "name": "邗江区",
              "key": "321003"
            }
          ],
          "name": "扬州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "润州区",
              "key": "321111"
            },
            {
              "name": "句容市",
              "key": "321183"
            },
            {
              "name": "丹阳市",
              "key": "321181"
            },
            {
              "name": "扬中市",
              "key": "321182"
            },
            {
              "name": "市辖区",
              "key": "321101"
            },
            {
              "name": "丹徒区",
              "key": "321112"
            },
            {
              "name": "京口区",
              "key": "321102"
            }
          ],
          "name": "镇江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "大丰区",
              "key": "320904"
            },
            {
              "name": "亭湖区",
              "key": "320902"
            },
            {
              "name": "射阳县",
              "key": "320924"
            },
            {
              "name": "盐都区",
              "key": "320903"
            },
            {
              "name": "建湖县",
              "key": "320925"
            },
            {
              "name": "滨海县",
              "key": "320922"
            },
            {
              "name": "市辖区",
              "key": "320901"
            },
            {
              "name": "阜宁县",
              "key": "320923"
            },
            {
              "name": "响水县",
              "key": "320921"
            },
            {
              "name": "东台市",
              "key": "320981"
            }
          ],
          "name": "盐城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海州区",
              "key": "320706"
            },
            {
              "name": "赣榆区",
              "key": "320707"
            },
            {
              "name": "灌南县",
              "key": "320724"
            },
            {
              "name": "连云区",
              "key": "320703"
            },
            {
              "name": "东海县",
              "key": "320722"
            },
            {
              "name": "市辖区",
              "key": "320701"
            },
            {
              "name": "灌云县",
              "key": "320723"
            }
          ],
          "name": "连云港市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "淮安区",
              "key": "320803"
            },
            {
              "name": "淮阴区",
              "key": "320804"
            },
            {
              "name": "涟水县",
              "key": "320826"
            },
            {
              "name": "市辖区",
              "key": "320801"
            },
            {
              "name": "清江浦区",
              "key": "320812"
            },
            {
              "name": "洪泽区",
              "key": "320813"
            },
            {
              "name": "盱眙县",
              "key": "320830"
            },
            {
              "name": "金湖县",
              "key": "320831"
            }
          ],
          "name": "淮安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "张家港市",
              "key": "320582"
            },
            {
              "name": "昆山市",
              "key": "320583"
            },
            {
              "name": "姑苏区",
              "key": "320508"
            },
            {
              "name": "吴江区",
              "key": "320509"
            },
            {
              "name": "常熟市",
              "key": "320581"
            },
            {
              "name": "吴中区",
              "key": "320506"
            },
            {
              "name": "相城区",
              "key": "320507"
            },
            {
              "name": "虎丘区",
              "key": "320505"
            },
            {
              "name": "市辖区",
              "key": "320501"
            },
            {
              "name": "太仓市",
              "key": "320585"
            }
          ],
          "name": "苏州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "启东市",
              "key": "320681"
            },
            {
              "name": "如皋市",
              "key": "320682"
            },
            {
              "name": "市辖区",
              "key": "320601"
            },
            {
              "name": "通州区",
              "key": "320612"
            },
            {
              "name": "如东县",
              "key": "320623"
            },
            {
              "name": "崇川区",
              "key": "320602"
            },
            {
              "name": "海安县",
              "key": "320621"
            },
            {
              "name": "港闸区",
              "key": "320611"
            },
            {
              "name": "海门市",
              "key": "320684"
            }
          ],
          "name": "南通市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "邳州市",
              "key": "320382"
            },
            {
              "name": "新沂市",
              "key": "320381"
            },
            {
              "name": "贾汪区",
              "key": "320305"
            },
            {
              "name": "鼓楼区",
              "key": "320302"
            },
            {
              "name": "睢宁县",
              "key": "320324"
            },
            {
              "name": "云龙区",
              "key": "320303"
            },
            {
              "name": "泉山区",
              "key": "320311"
            },
            {
              "name": "沛县",
              "key": "320322"
            },
            {
              "name": "市辖区",
              "key": "320301"
            },
            {
              "name": "铜山区",
              "key": "320312"
            },
            {
              "name": "丰县",
              "key": "320321"
            }
          ],
          "name": "徐州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "溧阳市",
              "key": "320481"
            },
            {
              "name": "钟楼区",
              "key": "320404"
            },
            {
              "name": "市辖区",
              "key": "320401"
            },
            {
              "name": "武进区",
              "key": "320412"
            },
            {
              "name": "天宁区",
              "key": "320402"
            },
            {
              "name": "金坛区",
              "key": "320413"
            },
            {
              "name": "新北区",
              "key": "320411"
            }
          ],
          "name": "常州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "鼓楼区",
              "key": "320106"
            },
            {
              "name": "溧水区",
              "key": "320117"
            },
            {
              "name": "高淳区",
              "key": "320118"
            },
            {
              "name": "秦淮区",
              "key": "320104"
            },
            {
              "name": "江宁区",
              "key": "320115"
            },
            {
              "name": "建邺区",
              "key": "320105"
            },
            {
              "name": "六合区",
              "key": "320116"
            },
            {
              "name": "玄武区",
              "key": "320102"
            },
            {
              "name": "栖霞区",
              "key": "320113"
            },
            {
              "name": "雨花台区",
              "key": "320114"
            },
            {
              "name": "浦口区",
              "key": "320111"
            },
            {
              "name": "市辖区",
              "key": "320101"
            }
          ],
          "name": "南京市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "靖江市",
              "key": "321282"
            },
            {
              "name": "泰兴市",
              "key": "321283"
            },
            {
              "name": "兴化市",
              "key": "321281"
            },
            {
              "name": "姜堰区",
              "key": "321204"
            },
            {
              "name": "海陵区",
              "key": "321202"
            },
            {
              "name": "高港区",
              "key": "321203"
            },
            {
              "name": "市辖区",
              "key": "321201"
            }
          ],
          "name": "泰州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "江阴市",
              "key": "320281"
            },
            {
              "name": "宜兴市",
              "key": "320282"
            },
            {
              "name": "锡山区",
              "key": "320205"
            },
            {
              "name": "惠山区",
              "key": "320206"
            },
            {
              "name": "新吴区",
              "key": "320214"
            },
            {
              "name": "市辖区",
              "key": "320201"
            },
            {
              "name": "梁溪区",
              "key": "320213"
            },
            {
              "name": "滨湖区",
              "key": "320211"
            }
          ],
          "name": "无锡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "321301"
            },
            {
              "name": "泗阳县",
              "key": "321323"
            },
            {
              "name": "宿城区",
              "key": "321302"
            },
            {
              "name": "泗洪县",
              "key": "321324"
            },
            {
              "name": "宿豫区",
              "key": "321311"
            },
            {
              "name": "沭阳县",
              "key": "321322"
            }
          ],
          "name": "宿迁市",
          "key": "name"
        }
      ]
    },
    {
      "name": "北京市",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "朝阳区",
              "key": "110105"
            },
            {
              "name": "怀柔区",
              "key": "110116"
            },
            {
              "name": "丰台区",
              "key": "110106"
            },
            {
              "name": "平谷区",
              "key": "110117"
            },
            {
              "name": "昌平区",
              "key": "110114"
            },
            {
              "name": "大兴区",
              "key": "110115"
            },
            {
              "name": "东城区",
              "key": "110101"
            },
            {
              "name": "通州区",
              "key": "110112"
            },
            {
              "name": "西城区",
              "key": "110102"
            },
            {
              "name": "顺义区",
              "key": "110113"
            },
            {
              "name": "房山区",
              "key": "110111"
            },
            {
              "name": "门头沟区",
              "key": "110109"
            },
            {
              "name": "石景山区",
              "key": "110107"
            },
            {
              "name": "密云区",
              "key": "110118"
            },
            {
              "name": "海淀区",
              "key": "110108"
            },
            {
              "name": "延庆区",
              "key": "110119"
            }
          ],
          "name": "市辖区",
          "key": "name"
        }
      ]
    },
    {
      "name": "云南省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "武定县",
              "key": "532329"
            },
            {
              "name": "元谋县",
              "key": "532328"
            },
            {
              "name": "永仁县",
              "key": "532327"
            },
            {
              "name": "大姚县",
              "key": "532326"
            },
            {
              "name": "姚安县",
              "key": "532325"
            },
            {
              "name": "南华县",
              "key": "532324"
            },
            {
              "name": "楚雄市",
              "key": "532301"
            },
            {
              "name": "牟定县",
              "key": "532323"
            },
            {
              "name": "双柏县",
              "key": "532322"
            },
            {
              "name": "禄丰县",
              "key": "532331"
            }
          ],
          "name": "楚雄彝族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "香格里拉市",
              "key": "533401"
            },
            {
              "name": "维西傈僳族自治县",
              "key": "533423"
            },
            {
              "name": "德钦县",
              "key": "533422"
            }
          ],
          "name": "迪庆藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "官渡区",
              "key": "530111"
            },
            {
              "name": "晋宁县",
              "key": "530122"
            },
            {
              "name": "安宁市",
              "key": "530181"
            },
            {
              "name": "寻甸回族彝族自治县",
              "key": "530129"
            },
            {
              "name": "嵩明县",
              "key": "530127"
            },
            {
              "name": "禄劝彝族苗族自治县",
              "key": "530128"
            },
            {
              "name": "盘龙区",
              "key": "530103"
            },
            {
              "name": "呈贡区",
              "key": "530114"
            },
            {
              "name": "宜良县",
              "key": "530125"
            },
            {
              "name": "石林彝族自治县",
              "key": "530126"
            },
            {
              "name": "市辖区",
              "key": "530101"
            },
            {
              "name": "西山区",
              "key": "530112"
            },
            {
              "name": "五华区",
              "key": "530102"
            },
            {
              "name": "东川区",
              "key": "530113"
            },
            {
              "name": "富民县",
              "key": "530124"
            }
          ],
          "name": "昆明市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "兰坪白族普米族自治县",
              "key": "533325"
            },
            {
              "name": "贡山独龙族怒族自治县",
              "key": "533324"
            },
            {
              "name": "泸水市",
              "key": "533301"
            },
            {
              "name": "福贡县",
              "key": "533323"
            }
          ],
          "name": "怒江傈僳族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "芒市",
              "key": "533103"
            },
            {
              "name": "瑞丽市",
              "key": "533102"
            },
            {
              "name": "陇川县",
              "key": "533124"
            },
            {
              "name": "盈江县",
              "key": "533123"
            },
            {
              "name": "梁河县",
              "key": "533122"
            }
          ],
          "name": "德宏傣族景颇族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "墨江哈尼族自治县",
              "key": "530822"
            },
            {
              "name": "市辖区",
              "key": "530801"
            },
            {
              "name": "景东彝族自治县",
              "key": "530823"
            },
            {
              "name": "宁洱哈尼族彝族自治县",
              "key": "530821"
            },
            {
              "name": "澜沧拉祜族自治县",
              "key": "530828"
            },
            {
              "name": "西盟佤族自治县",
              "key": "530829"
            },
            {
              "name": "江城哈尼族彝族自治县",
              "key": "530826"
            },
            {
              "name": "孟连傣族拉祜族佤族自治县",
              "key": "530827"
            },
            {
              "name": "思茅区",
              "key": "530802"
            },
            {
              "name": "景谷傣族彝族自治县",
              "key": "530824"
            },
            {
              "name": "镇沅彝族哈尼族拉祜族自治县",
              "key": "530825"
            }
          ],
          "name": "普洱市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "凤庆县",
              "key": "530921"
            },
            {
              "name": "云县",
              "key": "530922"
            },
            {
              "name": "沧源佤族自治县",
              "key": "530927"
            },
            {
              "name": "双江拉祜族佤族布朗族傣族自治县",
              "key": "530925"
            },
            {
              "name": "耿马傣族佤族自治县",
              "key": "530926"
            },
            {
              "name": "市辖区",
              "key": "530901"
            },
            {
              "name": "永德县",
              "key": "530923"
            },
            {
              "name": "临翔区",
              "key": "530902"
            },
            {
              "name": "镇康县",
              "key": "530924"
            }
          ],
          "name": "临沧市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "昭阳区",
              "key": "530602"
            },
            {
              "name": "大关县",
              "key": "530624"
            },
            {
              "name": "永善县",
              "key": "530625"
            },
            {
              "name": "巧家县",
              "key": "530622"
            },
            {
              "name": "市辖区",
              "key": "530601"
            },
            {
              "name": "盐津县",
              "key": "530623"
            },
            {
              "name": "鲁甸县",
              "key": "530621"
            },
            {
              "name": "水富县",
              "key": "530630"
            },
            {
              "name": "彝良县",
              "key": "530628"
            },
            {
              "name": "威信县",
              "key": "530629"
            },
            {
              "name": "绥江县",
              "key": "530626"
            },
            {
              "name": "镇雄县",
              "key": "530627"
            }
          ],
          "name": "昭通市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宾川县",
              "key": "532924"
            },
            {
              "name": "大理市",
              "key": "532901"
            },
            {
              "name": "祥云县",
              "key": "532923"
            },
            {
              "name": "漾濞彝族自治县",
              "key": "532922"
            },
            {
              "name": "鹤庆县",
              "key": "532932"
            },
            {
              "name": "剑川县",
              "key": "532931"
            },
            {
              "name": "洱源县",
              "key": "532930"
            },
            {
              "name": "云龙县",
              "key": "532929"
            },
            {
              "name": "永平县",
              "key": "532928"
            },
            {
              "name": "巍山彝族回族自治县",
              "key": "532927"
            },
            {
              "name": "南涧彝族自治县",
              "key": "532926"
            },
            {
              "name": "弥渡县",
              "key": "532925"
            }
          ],
          "name": "大理白族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "530701"
            },
            {
              "name": "华坪县",
              "key": "530723"
            },
            {
              "name": "古城区",
              "key": "530702"
            },
            {
              "name": "宁蒗彝族自治县",
              "key": "530724"
            },
            {
              "name": "玉龙纳西族自治县",
              "key": "530721"
            },
            {
              "name": "永胜县",
              "key": "530722"
            }
          ],
          "name": "丽江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "景洪市",
              "key": "532801"
            },
            {
              "name": "勐腊县",
              "key": "532823"
            },
            {
              "name": "勐海县",
              "key": "532822"
            }
          ],
          "name": "西双版纳傣族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "峨山彝族自治县",
              "key": "530426"
            },
            {
              "name": "新平彝族傣族自治县",
              "key": "530427"
            },
            {
              "name": "红塔区",
              "key": "530402"
            },
            {
              "name": "华宁县",
              "key": "530424"
            },
            {
              "name": "江川区",
              "key": "530403"
            },
            {
              "name": "易门县",
              "key": "530425"
            },
            {
              "name": "澄江县",
              "key": "530422"
            },
            {
              "name": "市辖区",
              "key": "530401"
            },
            {
              "name": "通海县",
              "key": "530423"
            },
            {
              "name": "元江哈尼族彝族傣族自治县",
              "key": "530428"
            }
          ],
          "name": "玉溪市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "530501"
            },
            {
              "name": "龙陵县",
              "key": "530523"
            },
            {
              "name": "隆阳区",
              "key": "530502"
            },
            {
              "name": "昌宁县",
              "key": "530524"
            },
            {
              "name": "施甸县",
              "key": "530521"
            },
            {
              "name": "腾冲市",
              "key": "530581"
            }
          ],
          "name": "保山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "广南县",
              "key": "532627"
            },
            {
              "name": "丘北县",
              "key": "532626"
            },
            {
              "name": "马关县",
              "key": "532625"
            },
            {
              "name": "麻栗坡县",
              "key": "532624"
            },
            {
              "name": "文山市",
              "key": "532601"
            },
            {
              "name": "西畴县",
              "key": "532623"
            },
            {
              "name": "砚山县",
              "key": "532622"
            },
            {
              "name": "富宁县",
              "key": "532628"
            }
          ],
          "name": "文山壮族苗族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "绿春县",
              "key": "532531"
            },
            {
              "name": "金平苗族瑶族傣族自治县",
              "key": "532530"
            },
            {
              "name": "元阳县",
              "key": "532528"
            },
            {
              "name": "泸西县",
              "key": "532527"
            },
            {
              "name": "弥勒市",
              "key": "532504"
            },
            {
              "name": "蒙自市",
              "key": "532503"
            },
            {
              "name": "石屏县",
              "key": "532525"
            },
            {
              "name": "开远市",
              "key": "532502"
            },
            {
              "name": "建水县",
              "key": "532524"
            },
            {
              "name": "个旧市",
              "key": "532501"
            },
            {
              "name": "屏边苗族自治县",
              "key": "532523"
            },
            {
              "name": "河口瑶族自治县",
              "key": "532532"
            },
            {
              "name": "红河县",
              "key": "532529"
            }
          ],
          "name": "红河哈尼族彝族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沾益区",
              "key": "530303"
            },
            {
              "name": "富源县",
              "key": "530325"
            },
            {
              "name": "会泽县",
              "key": "530326"
            },
            {
              "name": "市辖区",
              "key": "530301"
            },
            {
              "name": "师宗县",
              "key": "530323"
            },
            {
              "name": "麒麟区",
              "key": "530302"
            },
            {
              "name": "罗平县",
              "key": "530324"
            },
            {
              "name": "马龙县",
              "key": "530321"
            },
            {
              "name": "陆良县",
              "key": "530322"
            },
            {
              "name": "宣威市",
              "key": "530381"
            }
          ],
          "name": "曲靖市",
          "key": "name"
        }
      ]
    },
    {
      "name": "海南省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "东方市",
              "key": "469007"
            },
            {
              "name": "保亭黎族苗族自治县",
              "key": "469029"
            },
            {
              "name": "万宁市",
              "key": "469006"
            },
            {
              "name": "陵水黎族自治县",
              "key": "469028"
            },
            {
              "name": "文昌市",
              "key": "469005"
            },
            {
              "name": "乐东黎族自治县",
              "key": "469027"
            },
            {
              "name": "昌江黎族自治县",
              "key": "469026"
            },
            {
              "name": "白沙黎族自治县",
              "key": "469025"
            },
            {
              "name": "琼海市",
              "key": "469002"
            },
            {
              "name": "临高县",
              "key": "469024"
            },
            {
              "name": "五指山市",
              "key": "469001"
            },
            {
              "name": "澄迈县",
              "key": "469023"
            },
            {
              "name": "屯昌县",
              "key": "469022"
            },
            {
              "name": "定安县",
              "key": "469021"
            },
            {
              "name": "琼中黎族苗族自治县",
              "key": "469030"
            }
          ],
          "name": "省直辖县级行政区划",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "美兰区",
              "key": "460108"
            },
            {
              "name": "琼山区",
              "key": "460107"
            },
            {
              "name": "龙华区",
              "key": "460106"
            },
            {
              "name": "秀英区",
              "key": "460105"
            },
            {
              "name": "市辖区",
              "key": "460101"
            }
          ],
          "name": "海口市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "崖州区",
              "key": "460205"
            },
            {
              "name": "天涯区",
              "key": "460204"
            },
            {
              "name": "吉阳区",
              "key": "460203"
            },
            {
              "name": "海棠区",
              "key": "460202"
            },
            {
              "name": "市辖区",
              "key": "460201"
            }
          ],
          "name": "三亚市",
          "key": "name"
        }
      ]
    },
    {
      "name": "浙江省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "玉环县",
              "key": "331021"
            },
            {
              "name": "三门县",
              "key": "331022"
            },
            {
              "name": "温岭市",
              "key": "331081"
            },
            {
              "name": "临海市",
              "key": "331082"
            },
            {
              "name": "市辖区",
              "key": "331001"
            },
            {
              "name": "天台县",
              "key": "331023"
            },
            {
              "name": "椒江区",
              "key": "331002"
            },
            {
              "name": "仙居县",
              "key": "331024"
            },
            {
              "name": "黄岩区",
              "key": "331003"
            },
            {
              "name": "路桥区",
              "key": "331004"
            }
          ],
          "name": "台州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "常山县",
              "key": "330822"
            },
            {
              "name": "市辖区",
              "key": "330801"
            },
            {
              "name": "柯城区",
              "key": "330802"
            },
            {
              "name": "开化县",
              "key": "330824"
            },
            {
              "name": "衢江区",
              "key": "330803"
            },
            {
              "name": "龙游县",
              "key": "330825"
            },
            {
              "name": "江山市",
              "key": "330881"
            }
          ],
          "name": "衢州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "普陀区",
              "key": "330903"
            },
            {
              "name": "岱山县",
              "key": "330921"
            },
            {
              "name": "嵊泗县",
              "key": "330922"
            },
            {
              "name": "市辖区",
              "key": "330901"
            },
            {
              "name": "定海区",
              "key": "330902"
            }
          ],
          "name": "舟山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海宁市",
              "key": "330481"
            },
            {
              "name": "平湖市",
              "key": "330482"
            },
            {
              "name": "桐乡市",
              "key": "330483"
            },
            {
              "name": "秀洲区",
              "key": "330411"
            },
            {
              "name": "市辖区",
              "key": "330401"
            },
            {
              "name": "南湖区",
              "key": "330402"
            },
            {
              "name": "海盐县",
              "key": "330424"
            },
            {
              "name": "嘉善县",
              "key": "330421"
            }
          ],
          "name": "嘉兴市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "南浔区",
              "key": "330503"
            },
            {
              "name": "德清县",
              "key": "330521"
            },
            {
              "name": "长兴县",
              "key": "330522"
            },
            {
              "name": "市辖区",
              "key": "330501"
            },
            {
              "name": "安吉县",
              "key": "330523"
            },
            {
              "name": "吴兴区",
              "key": "330502"
            }
          ],
          "name": "湖州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "诸暨市",
              "key": "330681"
            },
            {
              "name": "越城区",
              "key": "330602"
            },
            {
              "name": "新昌县",
              "key": "330624"
            },
            {
              "name": "柯桥区",
              "key": "330603"
            },
            {
              "name": "上虞区",
              "key": "330604"
            },
            {
              "name": "市辖区",
              "key": "330601"
            },
            {
              "name": "嵊州市",
              "key": "330683"
            }
          ],
          "name": "绍兴市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "磐安县",
              "key": "330727"
            },
            {
              "name": "市辖区",
              "key": "330701"
            },
            {
              "name": "武义县",
              "key": "330723"
            },
            {
              "name": "婺城区",
              "key": "330702"
            },
            {
              "name": "金东区",
              "key": "330703"
            },
            {
              "name": "浦江县",
              "key": "330726"
            },
            {
              "name": "兰溪市",
              "key": "330781"
            },
            {
              "name": "义乌市",
              "key": "330782"
            },
            {
              "name": "东阳市",
              "key": "330783"
            },
            {
              "name": "永康市",
              "key": "330784"
            }
          ],
          "name": "金华市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "青田县",
              "key": "331121"
            },
            {
              "name": "龙泉市",
              "key": "331181"
            },
            {
              "name": "庆元县",
              "key": "331126"
            },
            {
              "name": "景宁畲族自治县",
              "key": "331127"
            },
            {
              "name": "缙云县",
              "key": "331122"
            },
            {
              "name": "市辖区",
              "key": "331101"
            },
            {
              "name": "遂昌县",
              "key": "331123"
            },
            {
              "name": "莲都区",
              "key": "331102"
            },
            {
              "name": "松阳县",
              "key": "331124"
            },
            {
              "name": "云和县",
              "key": "331125"
            }
          ],
          "name": "丽水市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "滨江区",
              "key": "330108"
            },
            {
              "name": "萧山区",
              "key": "330109"
            },
            {
              "name": "下城区",
              "key": "330103"
            },
            {
              "name": "江干区",
              "key": "330104"
            },
            {
              "name": "拱墅区",
              "key": "330105"
            },
            {
              "name": "淳安县",
              "key": "330127"
            },
            {
              "name": "西湖区",
              "key": "330106"
            },
            {
              "name": "余杭区",
              "key": "330110"
            },
            {
              "name": "富阳区",
              "key": "330111"
            },
            {
              "name": "桐庐县",
              "key": "330122"
            },
            {
              "name": "市辖区",
              "key": "330101"
            },
            {
              "name": "上城区",
              "key": "330102"
            },
            {
              "name": "临安市",
              "key": "330185"
            },
            {
              "name": "建德市",
              "key": "330182"
            }
          ],
          "name": "杭州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "慈溪市",
              "key": "330282"
            },
            {
              "name": "奉化市",
              "key": "330283"
            },
            {
              "name": "北仑区",
              "key": "330206"
            },
            {
              "name": "余姚市",
              "key": "330281"
            },
            {
              "name": "海曙区",
              "key": "330203"
            },
            {
              "name": "象山县",
              "key": "330225"
            },
            {
              "name": "江东区",
              "key": "330204"
            },
            {
              "name": "宁海县",
              "key": "330226"
            },
            {
              "name": "江北区",
              "key": "330205"
            },
            {
              "name": "镇海区",
              "key": "330211"
            },
            {
              "name": "市辖区",
              "key": "330201"
            },
            {
              "name": "鄞州区",
              "key": "330212"
            }
          ],
          "name": "宁波市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "瑞安市",
              "key": "330381"
            },
            {
              "name": "乐清市",
              "key": "330382"
            },
            {
              "name": "洞头区",
              "key": "330305"
            },
            {
              "name": "苍南县",
              "key": "330327"
            },
            {
              "name": "文成县",
              "key": "330328"
            },
            {
              "name": "泰顺县",
              "key": "330329"
            },
            {
              "name": "市辖区",
              "key": "330301"
            },
            {
              "name": "鹿城区",
              "key": "330302"
            },
            {
              "name": "永嘉县",
              "key": "330324"
            },
            {
              "name": "龙湾区",
              "key": "330303"
            },
            {
              "name": "瓯海区",
              "key": "330304"
            },
            {
              "name": "平阳县",
              "key": "330326"
            }
          ],
          "name": "温州市",
          "key": "name"
        }
      ]
    },
    {
      "name": "上海市",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "崇明区",
              "key": "310151"
            },
            {
              "name": "奉贤区",
              "key": "310120"
            },
            {
              "name": "杨浦区",
              "key": "310110"
            },
            {
              "name": "黄浦区",
              "key": "310101"
            },
            {
              "name": "闵行区",
              "key": "310112"
            },
            {
              "name": "宝山区",
              "key": "310113"
            },
            {
              "name": "嘉定区",
              "key": "310114"
            },
            {
              "name": "徐汇区",
              "key": "310104"
            },
            {
              "name": "浦东新区",
              "key": "310115"
            },
            {
              "name": "长宁区",
              "key": "310105"
            },
            {
              "name": "金山区",
              "key": "310116"
            },
            {
              "name": "静安区",
              "key": "310106"
            },
            {
              "name": "松江区",
              "key": "310117"
            },
            {
              "name": "普陀区",
              "key": "310107"
            },
            {
              "name": "青浦区",
              "key": "310118"
            },
            {
              "name": "虹口区",
              "key": "310109"
            }
          ],
          "name": "市辖区",
          "key": "name"
        }
      ]
    },
    {
      "name": "天津市",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "河东区",
              "key": "120102"
            },
            {
              "name": "北辰区",
              "key": "120113"
            },
            {
              "name": "河西区",
              "key": "120103"
            },
            {
              "name": "武清区",
              "key": "120114"
            },
            {
              "name": "南开区",
              "key": "120104"
            },
            {
              "name": "宝坻区",
              "key": "120115"
            },
            {
              "name": "河北区",
              "key": "120105"
            },
            {
              "name": "滨海新区",
              "key": "120116"
            },
            {
              "name": "东丽区",
              "key": "120110"
            },
            {
              "name": "西青区",
              "key": "120111"
            },
            {
              "name": "和平区",
              "key": "120101"
            },
            {
              "name": "津南区",
              "key": "120112"
            },
            {
              "name": "红桥区",
              "key": "120106"
            },
            {
              "name": "宁河区",
              "key": "120117"
            },
            {
              "name": "静海区",
              "key": "120118"
            },
            {
              "name": "蓟州区",
              "key": "120119"
            }
          ],
          "name": "市辖区",
          "key": "name"
        }
      ]
    },
    {
      "name": "陕西省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "千阳县",
              "key": "610328"
            },
            {
              "name": "麟游县",
              "key": "610329"
            },
            {
              "name": "陈仓区",
              "key": "610304"
            },
            {
              "name": "眉县",
              "key": "610326"
            },
            {
              "name": "陇县",
              "key": "610327"
            },
            {
              "name": "渭滨区",
              "key": "610302"
            },
            {
              "name": "扶风县",
              "key": "610324"
            },
            {
              "name": "金台区",
              "key": "610303"
            },
            {
              "name": "凤翔县",
              "key": "610322"
            },
            {
              "name": "市辖区",
              "key": "610301"
            },
            {
              "name": "岐山县",
              "key": "610323"
            },
            {
              "name": "太白县",
              "key": "610331"
            },
            {
              "name": "凤县",
              "key": "610330"
            }
          ],
          "name": "宝鸡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "旬邑县",
              "key": "610429"
            },
            {
              "name": "彬县",
              "key": "610427"
            },
            {
              "name": "长武县",
              "key": "610428"
            },
            {
              "name": "杨陵区",
              "key": "610403"
            },
            {
              "name": "礼泉县",
              "key": "610425"
            },
            {
              "name": "渭城区",
              "key": "610404"
            },
            {
              "name": "永寿县",
              "key": "610426"
            },
            {
              "name": "市辖区",
              "key": "610401"
            },
            {
              "name": "泾阳县",
              "key": "610423"
            },
            {
              "name": "秦都区",
              "key": "610402"
            },
            {
              "name": "乾县",
              "key": "610424"
            },
            {
              "name": "三原县",
              "key": "610422"
            },
            {
              "name": "淳化县",
              "key": "610430"
            },
            {
              "name": "武功县",
              "key": "610431"
            },
            {
              "name": "兴平市",
              "key": "610481"
            }
          ],
          "name": "咸阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "高陵区",
              "key": "610117"
            },
            {
              "name": "莲湖区",
              "key": "610104"
            },
            {
              "name": "临潼区",
              "key": "610115"
            },
            {
              "name": "长安区",
              "key": "610116"
            },
            {
              "name": "新城区",
              "key": "610102"
            },
            {
              "name": "雁塔区",
              "key": "610113"
            },
            {
              "name": "周至县",
              "key": "610124"
            },
            {
              "name": "碑林区",
              "key": "610103"
            },
            {
              "name": "阎良区",
              "key": "610114"
            },
            {
              "name": "户县",
              "key": "610125"
            },
            {
              "name": "灞桥区",
              "key": "610111"
            },
            {
              "name": "蓝田县",
              "key": "610122"
            },
            {
              "name": "市辖区",
              "key": "610101"
            },
            {
              "name": "未央区",
              "key": "610112"
            }
          ],
          "name": "西安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "610201"
            },
            {
              "name": "王益区",
              "key": "610202"
            },
            {
              "name": "宜君县",
              "key": "610222"
            },
            {
              "name": "印台区",
              "key": "610203"
            },
            {
              "name": "耀州区",
              "key": "610204"
            }
          ],
          "name": "铜川市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "柞水县",
              "key": "611026"
            },
            {
              "name": "镇安县",
              "key": "611025"
            },
            {
              "name": "商州区",
              "key": "611002"
            },
            {
              "name": "山阳县",
              "key": "611024"
            },
            {
              "name": "市辖区",
              "key": "611001"
            },
            {
              "name": "商南县",
              "key": "611023"
            },
            {
              "name": "丹凤县",
              "key": "611022"
            },
            {
              "name": "洛南县",
              "key": "611021"
            }
          ],
          "name": "商洛市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "旬阳县",
              "key": "610928"
            },
            {
              "name": "白河县",
              "key": "610929"
            },
            {
              "name": "平利县",
              "key": "610926"
            },
            {
              "name": "镇坪县",
              "key": "610927"
            },
            {
              "name": "汉滨区",
              "key": "610902"
            },
            {
              "name": "紫阳县",
              "key": "610924"
            },
            {
              "name": "岚皋县",
              "key": "610925"
            },
            {
              "name": "石泉县",
              "key": "610922"
            },
            {
              "name": "市辖区",
              "key": "610901"
            },
            {
              "name": "宁陕县",
              "key": "610923"
            },
            {
              "name": "汉阴县",
              "key": "610921"
            }
          ],
          "name": "安康市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "佛坪县",
              "key": "610730"
            },
            {
              "name": "镇巴县",
              "key": "610728"
            },
            {
              "name": "留坝县",
              "key": "610729"
            },
            {
              "name": "宁强县",
              "key": "610726"
            },
            {
              "name": "略阳县",
              "key": "610727"
            },
            {
              "name": "汉台区",
              "key": "610702"
            },
            {
              "name": "西乡县",
              "key": "610724"
            },
            {
              "name": "勉县",
              "key": "610725"
            },
            {
              "name": "城固县",
              "key": "610722"
            },
            {
              "name": "市辖区",
              "key": "610701"
            },
            {
              "name": "洋县",
              "key": "610723"
            },
            {
              "name": "南郑县",
              "key": "610721"
            }
          ],
          "name": "汉中市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "吴堡县",
              "key": "610829"
            },
            {
              "name": "米脂县",
              "key": "610827"
            },
            {
              "name": "佳县",
              "key": "610828"
            },
            {
              "name": "横山区",
              "key": "610803"
            },
            {
              "name": "定边县",
              "key": "610825"
            },
            {
              "name": "绥德县",
              "key": "610826"
            },
            {
              "name": "市辖区",
              "key": "610801"
            },
            {
              "name": "榆阳区",
              "key": "610802"
            },
            {
              "name": "靖边县",
              "key": "610824"
            },
            {
              "name": "神木县",
              "key": "610821"
            },
            {
              "name": "府谷县",
              "key": "610822"
            },
            {
              "name": "清涧县",
              "key": "610830"
            },
            {
              "name": "子洲县",
              "key": "610831"
            }
          ],
          "name": "榆林市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "华阴市",
              "key": "610582"
            },
            {
              "name": "韩城市",
              "key": "610581"
            },
            {
              "name": "富平县",
              "key": "610528"
            },
            {
              "name": "蒲城县",
              "key": "610526"
            },
            {
              "name": "白水县",
              "key": "610527"
            },
            {
              "name": "临渭区",
              "key": "610502"
            },
            {
              "name": "合阳县",
              "key": "610524"
            },
            {
              "name": "华州区",
              "key": "610503"
            },
            {
              "name": "澄城县",
              "key": "610525"
            },
            {
              "name": "潼关县",
              "key": "610522"
            },
            {
              "name": "市辖区",
              "key": "610501"
            },
            {
              "name": "大荔县",
              "key": "610523"
            }
          ],
          "name": "渭南市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "洛川县",
              "key": "610629"
            },
            {
              "name": "甘泉县",
              "key": "610627"
            },
            {
              "name": "富县",
              "key": "610628"
            },
            {
              "name": "安塞区",
              "key": "610603"
            },
            {
              "name": "志丹县",
              "key": "610625"
            },
            {
              "name": "吴起县",
              "key": "610626"
            },
            {
              "name": "市辖区",
              "key": "610601"
            },
            {
              "name": "子长县",
              "key": "610623"
            },
            {
              "name": "宝塔区",
              "key": "610602"
            },
            {
              "name": "延长县",
              "key": "610621"
            },
            {
              "name": "黄陵县",
              "key": "610632"
            },
            {
              "name": "延川县",
              "key": "610622"
            },
            {
              "name": "宜川县",
              "key": "610630"
            },
            {
              "name": "黄龙县",
              "key": "610631"
            }
          ],
          "name": "延安市",
          "key": "name"
        }
      ]
    },
    {
      "name": "新疆维吾尔自治区",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "伊州区",
              "key": "650502"
            },
            {
              "name": "伊吾县",
              "key": "650522"
            },
            {
              "name": "巴里坤哈萨克自治县",
              "key": "650521"
            }
          ],
          "name": "哈密市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "高昌区",
              "key": "650402"
            },
            {
              "name": "托克逊县",
              "key": "650422"
            },
            {
              "name": "鄯善县",
              "key": "650421"
            }
          ],
          "name": "吐鲁番市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "乌尔禾区",
              "key": "650205"
            },
            {
              "name": "白碱滩区",
              "key": "650204"
            },
            {
              "name": "克拉玛依区",
              "key": "650203"
            },
            {
              "name": "独山子区",
              "key": "650202"
            },
            {
              "name": "市辖区",
              "key": "650201"
            }
          ],
          "name": "克拉玛依市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "达坂城区",
              "key": "650107"
            },
            {
              "name": "头屯河区",
              "key": "650106"
            },
            {
              "name": "水磨沟区",
              "key": "650105"
            },
            {
              "name": "新市区",
              "key": "650104"
            },
            {
              "name": "沙依巴克区",
              "key": "650103"
            },
            {
              "name": "天山区",
              "key": "650102"
            },
            {
              "name": "市辖区",
              "key": "650101"
            },
            {
              "name": "乌鲁木齐县",
              "key": "650121"
            },
            {
              "name": "米东区",
              "key": "650109"
            }
          ],
          "name": "乌鲁木齐市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "昌吉市",
              "key": "652301"
            },
            {
              "name": "呼图壁县",
              "key": "652323"
            },
            {
              "name": "阜康市",
              "key": "652302"
            },
            {
              "name": "玛纳斯县",
              "key": "652324"
            },
            {
              "name": "奇台县",
              "key": "652325"
            },
            {
              "name": "吉木萨尔县",
              "key": "652327"
            },
            {
              "name": "木垒哈萨克自治县",
              "key": "652328"
            }
          ],
          "name": "昌吉回族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "精河县",
              "key": "652722"
            },
            {
              "name": "博乐市",
              "key": "652701"
            },
            {
              "name": "温泉县",
              "key": "652723"
            },
            {
              "name": "阿拉山口市",
              "key": "652702"
            }
          ],
          "name": "博尔塔拉蒙古自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "且末县",
              "key": "652825"
            },
            {
              "name": "焉耆回族自治县",
              "key": "652826"
            },
            {
              "name": "和静县",
              "key": "652827"
            },
            {
              "name": "和硕县",
              "key": "652828"
            },
            {
              "name": "博湖县",
              "key": "652829"
            },
            {
              "name": "轮台县",
              "key": "652822"
            },
            {
              "name": "库尔勒市",
              "key": "652801"
            },
            {
              "name": "尉犁县",
              "key": "652823"
            },
            {
              "name": "若羌县",
              "key": "652824"
            }
          ],
          "name": "巴音郭楞蒙古自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沙雅县",
              "key": "652924"
            },
            {
              "name": "新和县",
              "key": "652925"
            },
            {
              "name": "拜城县",
              "key": "652926"
            },
            {
              "name": "乌什县",
              "key": "652927"
            },
            {
              "name": "阿瓦提县",
              "key": "652928"
            },
            {
              "name": "柯坪县",
              "key": "652929"
            },
            {
              "name": "温宿县",
              "key": "652922"
            },
            {
              "name": "阿克苏市",
              "key": "652901"
            },
            {
              "name": "库车县",
              "key": "652923"
            }
          ],
          "name": "阿克苏地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "伊宁县",
              "key": "654021"
            },
            {
              "name": "察布查尔锡伯自治县",
              "key": "654022"
            },
            {
              "name": "霍城县",
              "key": "654023"
            },
            {
              "name": "伊宁市",
              "key": "654002"
            },
            {
              "name": "巩留县",
              "key": "654024"
            },
            {
              "name": "奎屯市",
              "key": "654003"
            },
            {
              "name": "新源县",
              "key": "654025"
            },
            {
              "name": "霍尔果斯市",
              "key": "654004"
            },
            {
              "name": "昭苏县",
              "key": "654026"
            },
            {
              "name": "特克斯县",
              "key": "654027"
            },
            {
              "name": "尼勒克县",
              "key": "654028"
            }
          ],
          "name": "伊犁哈萨克自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "阿克陶县",
              "key": "653022"
            },
            {
              "name": "阿图什市",
              "key": "653001"
            },
            {
              "name": "阿合奇县",
              "key": "653023"
            },
            {
              "name": "乌恰县",
              "key": "653024"
            }
          ],
          "name": "克孜勒苏柯尔克孜自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "巴楚县",
              "key": "653130"
            },
            {
              "name": "塔什库尔干塔吉克自治县",
              "key": "653131"
            },
            {
              "name": "疏附县",
              "key": "653121"
            },
            {
              "name": "疏勒县",
              "key": "653122"
            },
            {
              "name": "喀什市",
              "key": "653101"
            },
            {
              "name": "英吉沙县",
              "key": "653123"
            },
            {
              "name": "泽普县",
              "key": "653124"
            },
            {
              "name": "莎车县",
              "key": "653125"
            },
            {
              "name": "叶城县",
              "key": "653126"
            },
            {
              "name": "麦盖提县",
              "key": "653127"
            },
            {
              "name": "岳普湖县",
              "key": "653128"
            },
            {
              "name": "伽师县",
              "key": "653129"
            }
          ],
          "name": "喀什地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "额敏县",
              "key": "654221"
            },
            {
              "name": "塔城市",
              "key": "654201"
            },
            {
              "name": "沙湾县",
              "key": "654223"
            },
            {
              "name": "乌苏市",
              "key": "654202"
            },
            {
              "name": "托里县",
              "key": "654224"
            },
            {
              "name": "裕民县",
              "key": "654225"
            },
            {
              "name": "和布克赛尔蒙古自治县",
              "key": "654226"
            }
          ],
          "name": "塔城地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "和田县",
              "key": "653221"
            },
            {
              "name": "墨玉县",
              "key": "653222"
            },
            {
              "name": "和田市",
              "key": "653201"
            },
            {
              "name": "皮山县",
              "key": "653223"
            },
            {
              "name": "洛浦县",
              "key": "653224"
            },
            {
              "name": "策勒县",
              "key": "653225"
            },
            {
              "name": "于田县",
              "key": "653226"
            },
            {
              "name": "民丰县",
              "key": "653227"
            }
          ],
          "name": "和田地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "布尔津县",
              "key": "654321"
            },
            {
              "name": "富蕴县",
              "key": "654322"
            },
            {
              "name": "阿勒泰市",
              "key": "654301"
            },
            {
              "name": "福海县",
              "key": "654323"
            },
            {
              "name": "哈巴河县",
              "key": "654324"
            },
            {
              "name": "青河县",
              "key": "654325"
            },
            {
              "name": "吉木乃县",
              "key": "654326"
            }
          ],
          "name": "阿勒泰地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "五家渠市",
              "key": "659004"
            },
            {
              "name": "图木舒克市",
              "key": "659003"
            },
            {
              "name": "阿拉尔市",
              "key": "659002"
            },
            {
              "name": "铁门关市",
              "key": "659006"
            },
            {
              "name": "石河子市",
              "key": "659001"
            }
          ],
          "name": "自治区直辖县级行政区划",
          "key": "name"
        }
      ]
    },
    {
      "name": "贵州省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "兴仁县",
              "key": "522322"
            },
            {
              "name": "兴义市",
              "key": "522301"
            },
            {
              "name": "普安县",
              "key": "522323"
            },
            {
              "name": "晴隆县",
              "key": "522324"
            },
            {
              "name": "贞丰县",
              "key": "522325"
            },
            {
              "name": "望谟县",
              "key": "522326"
            },
            {
              "name": "册亨县",
              "key": "522327"
            },
            {
              "name": "安龙县",
              "key": "522328"
            }
          ],
          "name": "黔西南布依族苗族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "水城县",
              "key": "520221"
            },
            {
              "name": "盘县",
              "key": "520222"
            },
            {
              "name": "钟山区",
              "key": "520201"
            },
            {
              "name": "六枝特区",
              "key": "520203"
            }
          ],
          "name": "六盘水市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "桐梓县",
              "key": "520322"
            },
            {
              "name": "市辖区",
              "key": "520301"
            },
            {
              "name": "绥阳县",
              "key": "520323"
            },
            {
              "name": "红花岗区",
              "key": "520302"
            },
            {
              "name": "正安县",
              "key": "520324"
            },
            {
              "name": "汇川区",
              "key": "520303"
            },
            {
              "name": "道真仡佬族苗族自治县",
              "key": "520325"
            },
            {
              "name": "播州区",
              "key": "520304"
            },
            {
              "name": "务川仡佬族苗族自治县",
              "key": "520326"
            },
            {
              "name": "凤冈县",
              "key": "520327"
            },
            {
              "name": "湄潭县",
              "key": "520328"
            },
            {
              "name": "余庆县",
              "key": "520329"
            },
            {
              "name": "赤水市",
              "key": "520381"
            },
            {
              "name": "仁怀市",
              "key": "520382"
            },
            {
              "name": "习水县",
              "key": "520330"
            }
          ],
          "name": "遵义市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "开阳县",
              "key": "520121"
            },
            {
              "name": "云岩区",
              "key": "520103"
            },
            {
              "name": "息烽县",
              "key": "520122"
            },
            {
              "name": "南明区",
              "key": "520102"
            },
            {
              "name": "修文县",
              "key": "520123"
            },
            {
              "name": "市辖区",
              "key": "520101"
            },
            {
              "name": "乌当区",
              "key": "520112"
            },
            {
              "name": "白云区",
              "key": "520113"
            },
            {
              "name": "花溪区",
              "key": "520111"
            },
            {
              "name": "观山湖区",
              "key": "520115"
            },
            {
              "name": "清镇市",
              "key": "520181"
            }
          ],
          "name": "贵阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "普定县",
              "key": "520422"
            },
            {
              "name": "市辖区",
              "key": "520401"
            },
            {
              "name": "镇宁布依族苗族自治县",
              "key": "520423"
            },
            {
              "name": "西秀区",
              "key": "520402"
            },
            {
              "name": "关岭布依族苗族自治县",
              "key": "520424"
            },
            {
              "name": "平坝区",
              "key": "520403"
            },
            {
              "name": "紫云苗族布依族自治县",
              "key": "520425"
            }
          ],
          "name": "安顺市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "剑河县",
              "key": "522629"
            },
            {
              "name": "榕江县",
              "key": "522632"
            },
            {
              "name": "黄平县",
              "key": "522622"
            },
            {
              "name": "从江县",
              "key": "522633"
            },
            {
              "name": "凯里市",
              "key": "522601"
            },
            {
              "name": "施秉县",
              "key": "522623"
            },
            {
              "name": "雷山县",
              "key": "522634"
            },
            {
              "name": "三穗县",
              "key": "522624"
            },
            {
              "name": "麻江县",
              "key": "522635"
            },
            {
              "name": "镇远县",
              "key": "522625"
            },
            {
              "name": "丹寨县",
              "key": "522636"
            },
            {
              "name": "岑巩县",
              "key": "522626"
            },
            {
              "name": "天柱县",
              "key": "522627"
            },
            {
              "name": "锦屏县",
              "key": "522628"
            },
            {
              "name": "台江县",
              "key": "522630"
            },
            {
              "name": "黎平县",
              "key": "522631"
            }
          ],
          "name": "黔东南苗族侗族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "大方县",
              "key": "520521"
            },
            {
              "name": "黔西县",
              "key": "520522"
            },
            {
              "name": "市辖区",
              "key": "520501"
            },
            {
              "name": "金沙县",
              "key": "520523"
            },
            {
              "name": "七星关区",
              "key": "520502"
            },
            {
              "name": "织金县",
              "key": "520524"
            },
            {
              "name": "纳雍县",
              "key": "520525"
            },
            {
              "name": "威宁彝族回族苗族自治县",
              "key": "520526"
            },
            {
              "name": "赫章县",
              "key": "520527"
            }
          ],
          "name": "毕节市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "罗甸县",
              "key": "522728"
            },
            {
              "name": "长顺县",
              "key": "522729"
            },
            {
              "name": "龙里县",
              "key": "522730"
            },
            {
              "name": "惠水县",
              "key": "522731"
            },
            {
              "name": "三都水族自治县",
              "key": "522732"
            },
            {
              "name": "荔波县",
              "key": "522722"
            },
            {
              "name": "都匀市",
              "key": "522701"
            },
            {
              "name": "贵定县",
              "key": "522723"
            },
            {
              "name": "福泉市",
              "key": "522702"
            },
            {
              "name": "瓮安县",
              "key": "522725"
            },
            {
              "name": "独山县",
              "key": "522726"
            },
            {
              "name": "平塘县",
              "key": "522727"
            }
          ],
          "name": "黔南布依族苗族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沿河土家族自治县",
              "key": "520627"
            },
            {
              "name": "松桃苗族自治县",
              "key": "520628"
            },
            {
              "name": "江口县",
              "key": "520621"
            },
            {
              "name": "玉屏侗族自治县",
              "key": "520622"
            },
            {
              "name": "市辖区",
              "key": "520601"
            },
            {
              "name": "石阡县",
              "key": "520623"
            },
            {
              "name": "碧江区",
              "key": "520602"
            },
            {
              "name": "思南县",
              "key": "520624"
            },
            {
              "name": "万山区",
              "key": "520603"
            },
            {
              "name": "印江土家族苗族自治县",
              "key": "520625"
            },
            {
              "name": "德江县",
              "key": "520626"
            }
          ],
          "name": "铜仁市",
          "key": "name"
        }
      ]
    },
    {
      "name": "安徽省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "郊区",
              "key": "340711"
            },
            {
              "name": "枞阳县",
              "key": "340722"
            },
            {
              "name": "市辖区",
              "key": "340701"
            },
            {
              "name": "义安区",
              "key": "340706"
            },
            {
              "name": "铜官区",
              "key": "340705"
            }
          ],
          "name": "铜陵市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "340801"
            },
            {
              "name": "迎江区",
              "key": "340802"
            },
            {
              "name": "潜山县",
              "key": "340824"
            },
            {
              "name": "宜秀区",
              "key": "340811"
            },
            {
              "name": "怀宁县",
              "key": "340822"
            },
            {
              "name": "望江县",
              "key": "340827"
            },
            {
              "name": "岳西县",
              "key": "340828"
            },
            {
              "name": "大观区",
              "key": "340803"
            },
            {
              "name": "太湖县",
              "key": "340825"
            },
            {
              "name": "宿松县",
              "key": "340826"
            },
            {
              "name": "桐城市",
              "key": "340881"
            }
          ],
          "name": "安庆市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "旌德县",
              "key": "341825"
            },
            {
              "name": "宣州区",
              "key": "341802"
            },
            {
              "name": "绩溪县",
              "key": "341824"
            },
            {
              "name": "市辖区",
              "key": "341801"
            },
            {
              "name": "泾县",
              "key": "341823"
            },
            {
              "name": "广德县",
              "key": "341822"
            },
            {
              "name": "宁国市",
              "key": "341881"
            },
            {
              "name": "郎溪县",
              "key": "341821"
            }
          ],
          "name": "宣城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "巢湖市",
              "key": "340181"
            },
            {
              "name": "包河区",
              "key": "340111"
            },
            {
              "name": "肥东县",
              "key": "340122"
            },
            {
              "name": "市辖区",
              "key": "340101"
            },
            {
              "name": "肥西县",
              "key": "340123"
            },
            {
              "name": "长丰县",
              "key": "340121"
            },
            {
              "name": "蜀山区",
              "key": "340104"
            },
            {
              "name": "瑶海区",
              "key": "340102"
            },
            {
              "name": "庐江县",
              "key": "340124"
            },
            {
              "name": "庐阳区",
              "key": "340103"
            }
          ],
          "name": "合肥市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "界首市",
              "key": "341282"
            },
            {
              "name": "太和县",
              "key": "341222"
            },
            {
              "name": "市辖区",
              "key": "341201"
            },
            {
              "name": "临泉县",
              "key": "341221"
            },
            {
              "name": "颍泉区",
              "key": "341204"
            },
            {
              "name": "颍上县",
              "key": "341226"
            },
            {
              "name": "颍州区",
              "key": "341202"
            },
            {
              "name": "颍东区",
              "key": "341203"
            },
            {
              "name": "阜南县",
              "key": "341225"
            }
          ],
          "name": "阜阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "鸠江区",
              "key": "340207"
            },
            {
              "name": "三山区",
              "key": "340208"
            },
            {
              "name": "芜湖县",
              "key": "340221"
            },
            {
              "name": "繁昌县",
              "key": "340222"
            },
            {
              "name": "弋江区",
              "key": "340203"
            },
            {
              "name": "无为县",
              "key": "340225"
            },
            {
              "name": "市辖区",
              "key": "340201"
            },
            {
              "name": "南陵县",
              "key": "340223"
            },
            {
              "name": "镜湖区",
              "key": "340202"
            }
          ],
          "name": "芜湖市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "砀山县",
              "key": "341321"
            },
            {
              "name": "萧县",
              "key": "341322"
            },
            {
              "name": "市辖区",
              "key": "341301"
            },
            {
              "name": "灵璧县",
              "key": "341323"
            },
            {
              "name": "埇桥区",
              "key": "341302"
            },
            {
              "name": "泗县",
              "key": "341324"
            }
          ],
          "name": "宿州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "歙县",
              "key": "341021"
            },
            {
              "name": "屯溪区",
              "key": "341002"
            },
            {
              "name": "祁门县",
              "key": "341024"
            },
            {
              "name": "黄山区",
              "key": "341003"
            },
            {
              "name": "休宁县",
              "key": "341022"
            },
            {
              "name": "市辖区",
              "key": "341001"
            },
            {
              "name": "黟县",
              "key": "341023"
            },
            {
              "name": "徽州区",
              "key": "341004"
            }
          ],
          "name": "黄山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "天长市",
              "key": "341181"
            },
            {
              "name": "明光市",
              "key": "341182"
            },
            {
              "name": "市辖区",
              "key": "341101"
            },
            {
              "name": "琅琊区",
              "key": "341102"
            },
            {
              "name": "全椒县",
              "key": "341124"
            },
            {
              "name": "来安县",
              "key": "341122"
            },
            {
              "name": "南谯区",
              "key": "341103"
            },
            {
              "name": "定远县",
              "key": "341125"
            },
            {
              "name": "凤阳县",
              "key": "341126"
            }
          ],
          "name": "滁州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "雨山区",
              "key": "340504"
            },
            {
              "name": "花山区",
              "key": "340503"
            },
            {
              "name": "博望区",
              "key": "340506"
            },
            {
              "name": "含山县",
              "key": "340522"
            },
            {
              "name": "市辖区",
              "key": "340501"
            },
            {
              "name": "和县",
              "key": "340523"
            },
            {
              "name": "当涂县",
              "key": "340521"
            }
          ],
          "name": "马鞍山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "贵池区",
              "key": "341702"
            },
            {
              "name": "市辖区",
              "key": "341701"
            },
            {
              "name": "青阳县",
              "key": "341723"
            },
            {
              "name": "石台县",
              "key": "341722"
            },
            {
              "name": "东至县",
              "key": "341721"
            }
          ],
          "name": "池州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "相山区",
              "key": "340603"
            },
            {
              "name": "烈山区",
              "key": "340604"
            },
            {
              "name": "市辖区",
              "key": "340601"
            },
            {
              "name": "杜集区",
              "key": "340602"
            },
            {
              "name": "濉溪县",
              "key": "340621"
            }
          ],
          "name": "淮北市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "谯城区",
              "key": "341602"
            },
            {
              "name": "市辖区",
              "key": "341601"
            },
            {
              "name": "利辛县",
              "key": "341623"
            },
            {
              "name": "蒙城县",
              "key": "341622"
            },
            {
              "name": "涡阳县",
              "key": "341621"
            }
          ],
          "name": "亳州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "禹会区",
              "key": "340304"
            },
            {
              "name": "怀远县",
              "key": "340321"
            },
            {
              "name": "龙子湖区",
              "key": "340302"
            },
            {
              "name": "蚌山区",
              "key": "340303"
            },
            {
              "name": "淮上区",
              "key": "340311"
            },
            {
              "name": "五河县",
              "key": "340322"
            },
            {
              "name": "市辖区",
              "key": "340301"
            },
            {
              "name": "固镇县",
              "key": "340323"
            }
          ],
          "name": "蚌埠市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "叶集区",
              "key": "341504"
            },
            {
              "name": "裕安区",
              "key": "341503"
            },
            {
              "name": "霍山县",
              "key": "341525"
            },
            {
              "name": "金安区",
              "key": "341502"
            },
            {
              "name": "金寨县",
              "key": "341524"
            },
            {
              "name": "市辖区",
              "key": "341501"
            },
            {
              "name": "舒城县",
              "key": "341523"
            },
            {
              "name": "霍邱县",
              "key": "341522"
            }
          ],
          "name": "六安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "八公山区",
              "key": "340405"
            },
            {
              "name": "潘集区",
              "key": "340406"
            },
            {
              "name": "田家庵区",
              "key": "340403"
            },
            {
              "name": "谢家集区",
              "key": "340404"
            },
            {
              "name": "市辖区",
              "key": "340401"
            },
            {
              "name": "大通区",
              "key": "340402"
            },
            {
              "name": "凤台县",
              "key": "340421"
            },
            {
              "name": "寿县",
              "key": "340422"
            }
          ],
          "name": "淮南市",
          "key": "name"
        }
      ]
    },
    {
      "name": "湖南省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "天元区",
              "key": "430211"
            },
            {
              "name": "株洲县",
              "key": "430221"
            },
            {
              "name": "荷塘区",
              "key": "430202"
            },
            {
              "name": "茶陵县",
              "key": "430224"
            },
            {
              "name": "市辖区",
              "key": "430201"
            },
            {
              "name": "攸县",
              "key": "430223"
            },
            {
              "name": "石峰区",
              "key": "430204"
            },
            {
              "name": "芦淞区",
              "key": "430203"
            },
            {
              "name": "炎陵县",
              "key": "430225"
            },
            {
              "name": "醴陵市",
              "key": "430281"
            }
          ],
          "name": "株洲市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新化县",
              "key": "431322"
            },
            {
              "name": "双峰县",
              "key": "431321"
            },
            {
              "name": "娄星区",
              "key": "431302"
            },
            {
              "name": "市辖区",
              "key": "431301"
            },
            {
              "name": "涟源市",
              "key": "431382"
            },
            {
              "name": "冷水江市",
              "key": "431381"
            }
          ],
          "name": "娄底市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "430101"
            },
            {
              "name": "望城区",
              "key": "430112"
            },
            {
              "name": "雨花区",
              "key": "430111"
            },
            {
              "name": "天心区",
              "key": "430103"
            },
            {
              "name": "芙蓉区",
              "key": "430102"
            },
            {
              "name": "宁乡县",
              "key": "430124"
            },
            {
              "name": "开福区",
              "key": "430105"
            },
            {
              "name": "岳麓区",
              "key": "430104"
            },
            {
              "name": "浏阳市",
              "key": "430181"
            },
            {
              "name": "长沙县",
              "key": "430121"
            }
          ],
          "name": "长沙市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "431201"
            },
            {
              "name": "辰溪县",
              "key": "431223"
            },
            {
              "name": "沅陵县",
              "key": "431222"
            },
            {
              "name": "会同县",
              "key": "431225"
            },
            {
              "name": "鹤城区",
              "key": "431202"
            },
            {
              "name": "溆浦县",
              "key": "431224"
            },
            {
              "name": "新晃侗族自治县",
              "key": "431227"
            },
            {
              "name": "麻阳苗族自治县",
              "key": "431226"
            },
            {
              "name": "靖州苗族侗族自治县",
              "key": "431229"
            },
            {
              "name": "芷江侗族自治县",
              "key": "431228"
            },
            {
              "name": "洪江市",
              "key": "431281"
            },
            {
              "name": "通道侗族自治县",
              "key": "431230"
            },
            {
              "name": "中方县",
              "key": "431221"
            }
          ],
          "name": "怀化市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "衡南县",
              "key": "430422"
            },
            {
              "name": "衡阳县",
              "key": "430421"
            },
            {
              "name": "衡东县",
              "key": "430424"
            },
            {
              "name": "市辖区",
              "key": "430401"
            },
            {
              "name": "南岳区",
              "key": "430412"
            },
            {
              "name": "衡山县",
              "key": "430423"
            },
            {
              "name": "祁东县",
              "key": "430426"
            },
            {
              "name": "雁峰区",
              "key": "430406"
            },
            {
              "name": "珠晖区",
              "key": "430405"
            },
            {
              "name": "蒸湘区",
              "key": "430408"
            },
            {
              "name": "石鼓区",
              "key": "430407"
            },
            {
              "name": "常宁市",
              "key": "430482"
            },
            {
              "name": "耒阳市",
              "key": "430481"
            }
          ],
          "name": "衡阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "湘潭县",
              "key": "430321"
            },
            {
              "name": "市辖区",
              "key": "430301"
            },
            {
              "name": "雨湖区",
              "key": "430302"
            },
            {
              "name": "岳塘区",
              "key": "430304"
            },
            {
              "name": "湘乡市",
              "key": "430381"
            },
            {
              "name": "韶山市",
              "key": "430382"
            }
          ],
          "name": "湘潭市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "君山区",
              "key": "430611"
            },
            {
              "name": "岳阳县",
              "key": "430621"
            },
            {
              "name": "岳阳楼区",
              "key": "430602"
            },
            {
              "name": "湘阴县",
              "key": "430624"
            },
            {
              "name": "市辖区",
              "key": "430601"
            },
            {
              "name": "华容县",
              "key": "430623"
            },
            {
              "name": "平江县",
              "key": "430626"
            },
            {
              "name": "云溪区",
              "key": "430603"
            },
            {
              "name": "临湘市",
              "key": "430682"
            },
            {
              "name": "汨罗市",
              "key": "430681"
            }
          ],
          "name": "岳阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "邵东县",
              "key": "430521"
            },
            {
              "name": "市辖区",
              "key": "430501"
            },
            {
              "name": "邵阳县",
              "key": "430523"
            },
            {
              "name": "北塔区",
              "key": "430511"
            },
            {
              "name": "新邵县",
              "key": "430522"
            },
            {
              "name": "大祥区",
              "key": "430503"
            },
            {
              "name": "洞口县",
              "key": "430525"
            },
            {
              "name": "双清区",
              "key": "430502"
            },
            {
              "name": "隆回县",
              "key": "430524"
            },
            {
              "name": "绥宁县",
              "key": "430527"
            },
            {
              "name": "城步苗族自治县",
              "key": "430529"
            },
            {
              "name": "新宁县",
              "key": "430528"
            },
            {
              "name": "武冈市",
              "key": "430581"
            }
          ],
          "name": "邵阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "武陵源区",
              "key": "430811"
            },
            {
              "name": "桑植县",
              "key": "430822"
            },
            {
              "name": "慈利县",
              "key": "430821"
            },
            {
              "name": "永定区",
              "key": "430802"
            },
            {
              "name": "市辖区",
              "key": "430801"
            }
          ],
          "name": "张家界市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安乡县",
              "key": "430721"
            },
            {
              "name": "市辖区",
              "key": "430701"
            },
            {
              "name": "澧县",
              "key": "430723"
            },
            {
              "name": "汉寿县",
              "key": "430722"
            },
            {
              "name": "鼎城区",
              "key": "430703"
            },
            {
              "name": "桃源县",
              "key": "430725"
            },
            {
              "name": "武陵区",
              "key": "430702"
            },
            {
              "name": "临澧县",
              "key": "430724"
            },
            {
              "name": "石门县",
              "key": "430726"
            },
            {
              "name": "津市市",
              "key": "430781"
            }
          ],
          "name": "常德市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沅江市",
              "key": "430981"
            },
            {
              "name": "南县",
              "key": "430921"
            },
            {
              "name": "市辖区",
              "key": "430901"
            },
            {
              "name": "安化县",
              "key": "430923"
            },
            {
              "name": "桃江县",
              "key": "430922"
            },
            {
              "name": "赫山区",
              "key": "430903"
            },
            {
              "name": "资阳区",
              "key": "430902"
            }
          ],
          "name": "益阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "零陵区",
              "key": "431102"
            },
            {
              "name": "道县",
              "key": "431124"
            },
            {
              "name": "市辖区",
              "key": "431101"
            },
            {
              "name": "双牌县",
              "key": "431123"
            },
            {
              "name": "宁远县",
              "key": "431126"
            },
            {
              "name": "冷水滩区",
              "key": "431103"
            },
            {
              "name": "江永县",
              "key": "431125"
            },
            {
              "name": "新田县",
              "key": "431128"
            },
            {
              "name": "蓝山县",
              "key": "431127"
            },
            {
              "name": "江华瑶族自治县",
              "key": "431129"
            },
            {
              "name": "东安县",
              "key": "431122"
            },
            {
              "name": "祁阳县",
              "key": "431121"
            }
          ],
          "name": "永州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "苏仙区",
              "key": "431003"
            },
            {
              "name": "临武县",
              "key": "431025"
            },
            {
              "name": "北湖区",
              "key": "431002"
            },
            {
              "name": "嘉禾县",
              "key": "431024"
            },
            {
              "name": "桂东县",
              "key": "431027"
            },
            {
              "name": "汝城县",
              "key": "431026"
            },
            {
              "name": "安仁县",
              "key": "431028"
            },
            {
              "name": "资兴市",
              "key": "431081"
            },
            {
              "name": "桂阳县",
              "key": "431021"
            },
            {
              "name": "市辖区",
              "key": "431001"
            },
            {
              "name": "永兴县",
              "key": "431023"
            },
            {
              "name": "宜章县",
              "key": "431022"
            }
          ],
          "name": "郴州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "永顺县",
              "key": "433127"
            },
            {
              "name": "保靖县",
              "key": "433125"
            },
            {
              "name": "古丈县",
              "key": "433126"
            },
            {
              "name": "龙山县",
              "key": "433130"
            },
            {
              "name": "吉首市",
              "key": "433101"
            },
            {
              "name": "凤凰县",
              "key": "433123"
            },
            {
              "name": "花垣县",
              "key": "433124"
            },
            {
              "name": "泸溪县",
              "key": "433122"
            }
          ],
          "name": "湘西土家族苗族自治州",
          "key": "name"
        }
      ]
    },
    {
      "name": "河北省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "鹿泉区",
              "key": "130110"
            },
            {
              "name": "井陉县",
              "key": "130121"
            },
            {
              "name": "元氏县",
              "key": "130132"
            },
            {
              "name": "栾城区",
              "key": "130111"
            },
            {
              "name": "赵县",
              "key": "130133"
            },
            {
              "name": "无极县",
              "key": "130130"
            },
            {
              "name": "平山县",
              "key": "130131"
            },
            {
              "name": "行唐县",
              "key": "130125"
            },
            {
              "name": "桥西区",
              "key": "130104"
            },
            {
              "name": "灵寿县",
              "key": "130126"
            },
            {
              "name": "市辖区",
              "key": "130101"
            },
            {
              "name": "正定县",
              "key": "130123"
            },
            {
              "name": "长安区",
              "key": "130102"
            },
            {
              "name": "井陉矿区",
              "key": "130107"
            },
            {
              "name": "赞皇县",
              "key": "130129"
            },
            {
              "name": "裕华区",
              "key": "130108"
            },
            {
              "name": "新华区",
              "key": "130105"
            },
            {
              "name": "高邑县",
              "key": "130127"
            },
            {
              "name": "深泽县",
              "key": "130128"
            },
            {
              "name": "藁城区",
              "key": "130109"
            },
            {
              "name": "晋州市",
              "key": "130183"
            },
            {
              "name": "新乐市",
              "key": "130184"
            }
          ],
          "name": "石家庄市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "131101"
            },
            {
              "name": "武强县",
              "key": "131123"
            },
            {
              "name": "武邑县",
              "key": "131122"
            },
            {
              "name": "枣强县",
              "key": "131121"
            },
            {
              "name": "景县",
              "key": "131127"
            },
            {
              "name": "故城县",
              "key": "131126"
            },
            {
              "name": "冀州区",
              "key": "131103"
            },
            {
              "name": "安平县",
              "key": "131125"
            },
            {
              "name": "桃城区",
              "key": "131102"
            },
            {
              "name": "饶阳县",
              "key": "131124"
            },
            {
              "name": "阜城县",
              "key": "131128"
            },
            {
              "name": "深州市",
              "key": "131182"
            }
          ],
          "name": "衡水市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安次区",
              "key": "131002"
            },
            {
              "name": "香河县",
              "key": "131024"
            },
            {
              "name": "市辖区",
              "key": "131001"
            },
            {
              "name": "永清县",
              "key": "131023"
            },
            {
              "name": "固安县",
              "key": "131022"
            },
            {
              "name": "大厂回族自治县",
              "key": "131028"
            },
            {
              "name": "文安县",
              "key": "131026"
            },
            {
              "name": "广阳区",
              "key": "131003"
            },
            {
              "name": "大城县",
              "key": "131025"
            },
            {
              "name": "三河市",
              "key": "131082"
            },
            {
              "name": "霸州市",
              "key": "131081"
            }
          ],
          "name": "廊坊市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "邱县",
              "key": "130430"
            },
            {
              "name": "馆陶县",
              "key": "130433"
            },
            {
              "name": "市辖区",
              "key": "130401"
            },
            {
              "name": "临漳县",
              "key": "130423"
            },
            {
              "name": "魏县",
              "key": "130434"
            },
            {
              "name": "鸡泽县",
              "key": "130431"
            },
            {
              "name": "邯郸县",
              "key": "130421"
            },
            {
              "name": "广平县",
              "key": "130432"
            },
            {
              "name": "复兴区",
              "key": "130404"
            },
            {
              "name": "涉县",
              "key": "130426"
            },
            {
              "name": "磁县",
              "key": "130427"
            },
            {
              "name": "邯山区",
              "key": "130402"
            },
            {
              "name": "成安县",
              "key": "130424"
            },
            {
              "name": "曲周县",
              "key": "130435"
            },
            {
              "name": "丛台区",
              "key": "130403"
            },
            {
              "name": "大名县",
              "key": "130425"
            },
            {
              "name": "峰峰矿区",
              "key": "130406"
            },
            {
              "name": "肥乡县",
              "key": "130428"
            },
            {
              "name": "永年县",
              "key": "130429"
            },
            {
              "name": "武安市",
              "key": "130481"
            }
          ],
          "name": "邯郸市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "南宫市",
              "key": "130581"
            },
            {
              "name": "沙河市",
              "key": "130582"
            },
            {
              "name": "邢台县",
              "key": "130521"
            },
            {
              "name": "平乡县",
              "key": "130532"
            },
            {
              "name": "临城县",
              "key": "130522"
            },
            {
              "name": "威县",
              "key": "130533"
            },
            {
              "name": "新河县",
              "key": "130530"
            },
            {
              "name": "广宗县",
              "key": "130531"
            },
            {
              "name": "桥西区",
              "key": "130503"
            },
            {
              "name": "隆尧县",
              "key": "130525"
            },
            {
              "name": "任县",
              "key": "130526"
            },
            {
              "name": "市辖区",
              "key": "130501"
            },
            {
              "name": "内丘县",
              "key": "130523"
            },
            {
              "name": "清河县",
              "key": "130534"
            },
            {
              "name": "桥东区",
              "key": "130502"
            },
            {
              "name": "柏乡县",
              "key": "130524"
            },
            {
              "name": "临西县",
              "key": "130535"
            },
            {
              "name": "巨鹿县",
              "key": "130529"
            },
            {
              "name": "南和县",
              "key": "130527"
            },
            {
              "name": "宁晋县",
              "key": "130528"
            }
          ],
          "name": "邢台市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "路南区",
              "key": "130202"
            },
            {
              "name": "滦南县",
              "key": "130224"
            },
            {
              "name": "路北区",
              "key": "130203"
            },
            {
              "name": "乐亭县",
              "key": "130225"
            },
            {
              "name": "市辖区",
              "key": "130201"
            },
            {
              "name": "滦县",
              "key": "130223"
            },
            {
              "name": "丰南区",
              "key": "130207"
            },
            {
              "name": "玉田县",
              "key": "130229"
            },
            {
              "name": "古冶区",
              "key": "130204"
            },
            {
              "name": "开平区",
              "key": "130205"
            },
            {
              "name": "迁西县",
              "key": "130227"
            },
            {
              "name": "丰润区",
              "key": "130208"
            },
            {
              "name": "曹妃甸区",
              "key": "130209"
            },
            {
              "name": "迁安市",
              "key": "130283"
            },
            {
              "name": "遵化市",
              "key": "130281"
            }
          ],
          "name": "唐山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "130301"
            },
            {
              "name": "海港区",
              "key": "130302"
            },
            {
              "name": "卢龙县",
              "key": "130324"
            },
            {
              "name": "青龙满族自治县",
              "key": "130321"
            },
            {
              "name": "昌黎县",
              "key": "130322"
            },
            {
              "name": "抚宁区",
              "key": "130306"
            },
            {
              "name": "山海关区",
              "key": "130303"
            },
            {
              "name": "北戴河区",
              "key": "130304"
            }
          ],
          "name": "秦皇岛市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "围场满族蒙古族自治县",
              "key": "130828"
            },
            {
              "name": "兴隆县",
              "key": "130822"
            },
            {
              "name": "市辖区",
              "key": "130801"
            },
            {
              "name": "平泉县",
              "key": "130823"
            },
            {
              "name": "承德县",
              "key": "130821"
            },
            {
              "name": "鹰手营子矿区",
              "key": "130804"
            },
            {
              "name": "丰宁满族自治县",
              "key": "130826"
            },
            {
              "name": "宽城满族自治县",
              "key": "130827"
            },
            {
              "name": "双桥区",
              "key": "130802"
            },
            {
              "name": "滦平县",
              "key": "130824"
            },
            {
              "name": "双滦区",
              "key": "130803"
            },
            {
              "name": "隆化县",
              "key": "130825"
            }
          ],
          "name": "承德市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "黄骅市",
              "key": "130983"
            },
            {
              "name": "河间市",
              "key": "130984"
            },
            {
              "name": "泊头市",
              "key": "130981"
            },
            {
              "name": "任丘市",
              "key": "130982"
            },
            {
              "name": "沧县",
              "key": "130921"
            },
            {
              "name": "青县",
              "key": "130922"
            },
            {
              "name": "孟村回族自治县",
              "key": "130930"
            },
            {
              "name": "运河区",
              "key": "130903"
            },
            {
              "name": "盐山县",
              "key": "130925"
            },
            {
              "name": "肃宁县",
              "key": "130926"
            },
            {
              "name": "市辖区",
              "key": "130901"
            },
            {
              "name": "东光县",
              "key": "130923"
            },
            {
              "name": "新华区",
              "key": "130902"
            },
            {
              "name": "海兴县",
              "key": "130924"
            },
            {
              "name": "献县",
              "key": "130929"
            },
            {
              "name": "南皮县",
              "key": "130927"
            },
            {
              "name": "吴桥县",
              "key": "130928"
            }
          ],
          "name": "沧州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安国市",
              "key": "130683"
            },
            {
              "name": "涿州市",
              "key": "130681"
            },
            {
              "name": "望都县",
              "key": "130631"
            },
            {
              "name": "安新县",
              "key": "130632"
            },
            {
              "name": "高碑店市",
              "key": "130684"
            },
            {
              "name": "涞源县",
              "key": "130630"
            },
            {
              "name": "竞秀区",
              "key": "130602"
            },
            {
              "name": "阜平县",
              "key": "130624"
            },
            {
              "name": "蠡县",
              "key": "130635"
            },
            {
              "name": "顺平县",
              "key": "130636"
            },
            {
              "name": "易县",
              "key": "130633"
            },
            {
              "name": "市辖区",
              "key": "130601"
            },
            {
              "name": "涞水县",
              "key": "130623"
            },
            {
              "name": "曲阳县",
              "key": "130634"
            },
            {
              "name": "莲池区",
              "key": "130606"
            },
            {
              "name": "高阳县",
              "key": "130628"
            },
            {
              "name": "满城区",
              "key": "130607"
            },
            {
              "name": "容城县",
              "key": "130629"
            },
            {
              "name": "定兴县",
              "key": "130626"
            },
            {
              "name": "博野县",
              "key": "130637"
            },
            {
              "name": "唐县",
              "key": "130627"
            },
            {
              "name": "雄县",
              "key": "130638"
            },
            {
              "name": "清苑区",
              "key": "130608"
            },
            {
              "name": "徐水区",
              "key": "130609"
            }
          ],
          "name": "保定市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "怀来县",
              "key": "130730"
            },
            {
              "name": "涿鹿县",
              "key": "130731"
            },
            {
              "name": "市辖区",
              "key": "130701"
            },
            {
              "name": "康保县",
              "key": "130723"
            },
            {
              "name": "桥东区",
              "key": "130702"
            },
            {
              "name": "沽源县",
              "key": "130724"
            },
            {
              "name": "赤城县",
              "key": "130732"
            },
            {
              "name": "张北县",
              "key": "130722"
            },
            {
              "name": "宣化区",
              "key": "130705"
            },
            {
              "name": "阳原县",
              "key": "130727"
            },
            {
              "name": "下花园区",
              "key": "130706"
            },
            {
              "name": "怀安县",
              "key": "130728"
            },
            {
              "name": "桥西区",
              "key": "130703"
            },
            {
              "name": "尚义县",
              "key": "130725"
            },
            {
              "name": "蔚县",
              "key": "130726"
            },
            {
              "name": "崇礼区",
              "key": "130709"
            },
            {
              "name": "万全区",
              "key": "130708"
            }
          ],
          "name": "张家口市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "定州市",
              "key": "139001"
            },
            {
              "name": "辛集市",
              "key": "139002"
            }
          ],
          "name": "省直辖县级行政区划",
          "key": "name"
        }
      ]
    },
    {
      "name": "辽宁省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "盘山县",
              "key": "211122"
            },
            {
              "name": "大洼区",
              "key": "211104"
            },
            {
              "name": "兴隆台区",
              "key": "211103"
            },
            {
              "name": "双台子区",
              "key": "211102"
            },
            {
              "name": "市辖区",
              "key": "211101"
            }
          ],
          "name": "盘锦市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "211001"
            },
            {
              "name": "太子河区",
              "key": "211011"
            },
            {
              "name": "辽阳县",
              "key": "211021"
            },
            {
              "name": "弓长岭区",
              "key": "211005"
            },
            {
              "name": "宏伟区",
              "key": "211004"
            },
            {
              "name": "文圣区",
              "key": "211003"
            },
            {
              "name": "白塔区",
              "key": "211002"
            },
            {
              "name": "灯塔市",
              "key": "211081"
            }
          ],
          "name": "辽阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新邱区",
              "key": "210903"
            },
            {
              "name": "海州区",
              "key": "210902"
            },
            {
              "name": "市辖区",
              "key": "210901"
            },
            {
              "name": "细河区",
              "key": "210911"
            },
            {
              "name": "彰武县",
              "key": "210922"
            },
            {
              "name": "清河门区",
              "key": "210905"
            },
            {
              "name": "太平区",
              "key": "210904"
            },
            {
              "name": "阜新蒙古族自治县",
              "key": "210921"
            }
          ],
          "name": "阜新市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "顺城区",
              "key": "210411"
            },
            {
              "name": "新宾满族自治县",
              "key": "210422"
            },
            {
              "name": "抚顺县",
              "key": "210421"
            },
            {
              "name": "望花区",
              "key": "210404"
            },
            {
              "name": "东洲区",
              "key": "210403"
            },
            {
              "name": "新抚区",
              "key": "210402"
            },
            {
              "name": "市辖区",
              "key": "210401"
            },
            {
              "name": "清原满族自治县",
              "key": "210423"
            }
          ],
          "name": "抚顺市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海城市",
              "key": "210381"
            },
            {
              "name": "市辖区",
              "key": "210301"
            },
            {
              "name": "岫岩满族自治县",
              "key": "210323"
            },
            {
              "name": "千山区",
              "key": "210311"
            },
            {
              "name": "台安县",
              "key": "210321"
            },
            {
              "name": "立山区",
              "key": "210304"
            },
            {
              "name": "铁西区",
              "key": "210303"
            },
            {
              "name": "铁东区",
              "key": "210302"
            }
          ],
          "name": "鞍山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "兴城市",
              "key": "211481"
            },
            {
              "name": "市辖区",
              "key": "211401"
            },
            {
              "name": "建昌县",
              "key": "211422"
            },
            {
              "name": "绥中县",
              "key": "211421"
            },
            {
              "name": "南票区",
              "key": "211404"
            },
            {
              "name": "龙港区",
              "key": "211403"
            },
            {
              "name": "连山区",
              "key": "211402"
            }
          ],
          "name": "葫芦岛市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "瓦房店市",
              "key": "210281"
            },
            {
              "name": "庄河市",
              "key": "210283"
            },
            {
              "name": "中山区",
              "key": "210202"
            },
            {
              "name": "金州区",
              "key": "210213"
            },
            {
              "name": "长海县",
              "key": "210224"
            },
            {
              "name": "市辖区",
              "key": "210201"
            },
            {
              "name": "旅顺口区",
              "key": "210212"
            },
            {
              "name": "甘井子区",
              "key": "210211"
            },
            {
              "name": "沙河口区",
              "key": "210204"
            },
            {
              "name": "西岗区",
              "key": "210203"
            },
            {
              "name": "普兰店区",
              "key": "210214"
            }
          ],
          "name": "大连市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "凌源市",
              "key": "211382"
            },
            {
              "name": "北票市",
              "key": "211381"
            },
            {
              "name": "双塔区",
              "key": "211302"
            },
            {
              "name": "喀喇沁左翼蒙古族自治县",
              "key": "211324"
            },
            {
              "name": "市辖区",
              "key": "211301"
            },
            {
              "name": "建平县",
              "key": "211322"
            },
            {
              "name": "朝阳县",
              "key": "211321"
            },
            {
              "name": "龙城区",
              "key": "211303"
            }
          ],
          "name": "朝阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新民市",
              "key": "210181"
            },
            {
              "name": "沈河区",
              "key": "210103"
            },
            {
              "name": "于洪区",
              "key": "210114"
            },
            {
              "name": "和平区",
              "key": "210102"
            },
            {
              "name": "沈北新区",
              "key": "210113"
            },
            {
              "name": "法库县",
              "key": "210124"
            },
            {
              "name": "市辖区",
              "key": "210101"
            },
            {
              "name": "浑南区",
              "key": "210112"
            },
            {
              "name": "康平县",
              "key": "210123"
            },
            {
              "name": "苏家屯区",
              "key": "210111"
            },
            {
              "name": "铁西区",
              "key": "210106"
            },
            {
              "name": "皇姑区",
              "key": "210105"
            },
            {
              "name": "大东区",
              "key": "210104"
            },
            {
              "name": "辽中区",
              "key": "210115"
            }
          ],
          "name": "沈阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "开原市",
              "key": "211282"
            },
            {
              "name": "调兵山市",
              "key": "211281"
            },
            {
              "name": "铁岭县",
              "key": "211221"
            },
            {
              "name": "银州区",
              "key": "211202"
            },
            {
              "name": "昌图县",
              "key": "211224"
            },
            {
              "name": "市辖区",
              "key": "211201"
            },
            {
              "name": "西丰县",
              "key": "211223"
            },
            {
              "name": "清河区",
              "key": "211204"
            }
          ],
          "name": "铁岭市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "鲅鱼圈区",
              "key": "210804"
            },
            {
              "name": "西市区",
              "key": "210803"
            },
            {
              "name": "站前区",
              "key": "210802"
            },
            {
              "name": "市辖区",
              "key": "210801"
            },
            {
              "name": "大石桥市",
              "key": "210882"
            },
            {
              "name": "盖州市",
              "key": "210881"
            },
            {
              "name": "老边区",
              "key": "210811"
            }
          ],
          "name": "营口市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "义县",
              "key": "210727"
            },
            {
              "name": "黑山县",
              "key": "210726"
            },
            {
              "name": "凌河区",
              "key": "210703"
            },
            {
              "name": "古塔区",
              "key": "210702"
            },
            {
              "name": "凌海市",
              "key": "210781"
            },
            {
              "name": "北镇市",
              "key": "210782"
            },
            {
              "name": "市辖区",
              "key": "210701"
            },
            {
              "name": "太和区",
              "key": "210711"
            }
          ],
          "name": "锦州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "振安区",
              "key": "210604"
            },
            {
              "name": "振兴区",
              "key": "210603"
            },
            {
              "name": "凤城市",
              "key": "210682"
            },
            {
              "name": "东港市",
              "key": "210681"
            },
            {
              "name": "元宝区",
              "key": "210602"
            },
            {
              "name": "宽甸满族自治县",
              "key": "210624"
            },
            {
              "name": "市辖区",
              "key": "210601"
            }
          ],
          "name": "丹东市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "南芬区",
              "key": "210505"
            },
            {
              "name": "明山区",
              "key": "210504"
            },
            {
              "name": "本溪满族自治县",
              "key": "210521"
            },
            {
              "name": "溪湖区",
              "key": "210503"
            },
            {
              "name": "平山区",
              "key": "210502"
            },
            {
              "name": "市辖区",
              "key": "210501"
            },
            {
              "name": "桓仁满族自治县",
              "key": "210522"
            }
          ],
          "name": "本溪市",
          "key": "name"
        }
      ]
    },
    {
      "name": "四川省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "乐至县",
              "key": "512022"
            },
            {
              "name": "市辖区",
              "key": "512001"
            },
            {
              "name": "安岳县",
              "key": "512021"
            },
            {
              "name": "雁江区",
              "key": "512002"
            }
          ],
          "name": "资阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "理县",
              "key": "513222"
            },
            {
              "name": "红原县",
              "key": "513233"
            },
            {
              "name": "汶川县",
              "key": "513221"
            },
            {
              "name": "若尔盖县",
              "key": "513232"
            },
            {
              "name": "阿坝县",
              "key": "513231"
            },
            {
              "name": "壤塘县",
              "key": "513230"
            },
            {
              "name": "金川县",
              "key": "513226"
            },
            {
              "name": "九寨沟县",
              "key": "513225"
            },
            {
              "name": "松潘县",
              "key": "513224"
            },
            {
              "name": "马尔康市",
              "key": "513201"
            },
            {
              "name": "茂县",
              "key": "513223"
            },
            {
              "name": "黑水县",
              "key": "513228"
            },
            {
              "name": "小金县",
              "key": "513227"
            }
          ],
          "name": "阿坝藏族羌族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "东兴区",
              "key": "511011"
            },
            {
              "name": "资中县",
              "key": "511025"
            },
            {
              "name": "市辖区",
              "key": "511001"
            },
            {
              "name": "市中区",
              "key": "511002"
            },
            {
              "name": "威远县",
              "key": "511024"
            },
            {
              "name": "隆昌县",
              "key": "511028"
            }
          ],
          "name": "内江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "崇州市",
              "key": "510184"
            },
            {
              "name": "邛崃市",
              "key": "510183"
            },
            {
              "name": "蒲江县",
              "key": "510131"
            },
            {
              "name": "简阳市",
              "key": "510185"
            },
            {
              "name": "金堂县",
              "key": "510121"
            },
            {
              "name": "新津县",
              "key": "510132"
            },
            {
              "name": "青白江区",
              "key": "510113"
            },
            {
              "name": "郫县",
              "key": "510124"
            },
            {
              "name": "市辖区",
              "key": "510101"
            },
            {
              "name": "龙泉驿区",
              "key": "510112"
            },
            {
              "name": "彭州市",
              "key": "510182"
            },
            {
              "name": "都江堰市",
              "key": "510181"
            },
            {
              "name": "锦江区",
              "key": "510104"
            },
            {
              "name": "温江区",
              "key": "510115"
            },
            {
              "name": "新都区",
              "key": "510114"
            },
            {
              "name": "金牛区",
              "key": "510106"
            },
            {
              "name": "青羊区",
              "key": "510105"
            },
            {
              "name": "双流区",
              "key": "510116"
            },
            {
              "name": "成华区",
              "key": "510108"
            },
            {
              "name": "武侯区",
              "key": "510107"
            },
            {
              "name": "大邑县",
              "key": "510129"
            }
          ],
          "name": "成都市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "营山县",
              "key": "511322"
            },
            {
              "name": "市辖区",
              "key": "511301"
            },
            {
              "name": "蓬安县",
              "key": "511323"
            },
            {
              "name": "南部县",
              "key": "511321"
            },
            {
              "name": "嘉陵区",
              "key": "511304"
            },
            {
              "name": "顺庆区",
              "key": "511302"
            },
            {
              "name": "仪陇县",
              "key": "511324"
            },
            {
              "name": "高坪区",
              "key": "511303"
            },
            {
              "name": "西充县",
              "key": "511325"
            },
            {
              "name": "阆中市",
              "key": "511381"
            }
          ],
          "name": "南充市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "仁寿县",
              "key": "511421"
            },
            {
              "name": "彭山区",
              "key": "511403"
            },
            {
              "name": "青神县",
              "key": "511425"
            },
            {
              "name": "市辖区",
              "key": "511401"
            },
            {
              "name": "洪雅县",
              "key": "511423"
            },
            {
              "name": "东坡区",
              "key": "511402"
            },
            {
              "name": "丹棱县",
              "key": "511424"
            }
          ],
          "name": "眉山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "沿滩区",
              "key": "510311"
            },
            {
              "name": "富顺县",
              "key": "510322"
            },
            {
              "name": "荣县",
              "key": "510321"
            },
            {
              "name": "自流井区",
              "key": "510302"
            },
            {
              "name": "市辖区",
              "key": "510301"
            },
            {
              "name": "大安区",
              "key": "510304"
            },
            {
              "name": "贡井区",
              "key": "510303"
            }
          ],
          "name": "自贡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "峨边彝族自治县",
              "key": "511132"
            },
            {
              "name": "市中区",
              "key": "511102"
            },
            {
              "name": "金口河区",
              "key": "511113"
            },
            {
              "name": "井研县",
              "key": "511124"
            },
            {
              "name": "沙湾区",
              "key": "511111"
            },
            {
              "name": "马边彝族自治县",
              "key": "511133"
            },
            {
              "name": "市辖区",
              "key": "511101"
            },
            {
              "name": "五通桥区",
              "key": "511112"
            },
            {
              "name": "犍为县",
              "key": "511123"
            },
            {
              "name": "沐川县",
              "key": "511129"
            },
            {
              "name": "夹江县",
              "key": "511126"
            },
            {
              "name": "峨眉山市",
              "key": "511181"
            }
          ],
          "name": "乐山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "昭觉县",
              "key": "513431"
            },
            {
              "name": "金阳县",
              "key": "513430"
            },
            {
              "name": "德昌县",
              "key": "513424"
            },
            {
              "name": "甘洛县",
              "key": "513435"
            },
            {
              "name": "西昌市",
              "key": "513401"
            },
            {
              "name": "盐源县",
              "key": "513423"
            },
            {
              "name": "越西县",
              "key": "513434"
            },
            {
              "name": "木里藏族自治县",
              "key": "513422"
            },
            {
              "name": "冕宁县",
              "key": "513433"
            },
            {
              "name": "喜德县",
              "key": "513432"
            },
            {
              "name": "普格县",
              "key": "513428"
            },
            {
              "name": "宁南县",
              "key": "513427"
            },
            {
              "name": "会东县",
              "key": "513426"
            },
            {
              "name": "雷波县",
              "key": "513437"
            },
            {
              "name": "会理县",
              "key": "513425"
            },
            {
              "name": "美姑县",
              "key": "513436"
            },
            {
              "name": "布拖县",
              "key": "513429"
            }
          ],
          "name": "凉山彝族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "石渠县",
              "key": "513332"
            },
            {
              "name": "白玉县",
              "key": "513331"
            },
            {
              "name": "德格县",
              "key": "513330"
            },
            {
              "name": "雅江县",
              "key": "513325"
            },
            {
              "name": "乡城县",
              "key": "513336"
            },
            {
              "name": "九龙县",
              "key": "513324"
            },
            {
              "name": "巴塘县",
              "key": "513335"
            },
            {
              "name": "康定市",
              "key": "513301"
            },
            {
              "name": "丹巴县",
              "key": "513323"
            },
            {
              "name": "理塘县",
              "key": "513334"
            },
            {
              "name": "泸定县",
              "key": "513322"
            },
            {
              "name": "色达县",
              "key": "513333"
            },
            {
              "name": "新龙县",
              "key": "513329"
            },
            {
              "name": "甘孜县",
              "key": "513328"
            },
            {
              "name": "炉霍县",
              "key": "513327"
            },
            {
              "name": "得荣县",
              "key": "513338"
            },
            {
              "name": "道孚县",
              "key": "513326"
            },
            {
              "name": "稻城县",
              "key": "513337"
            }
          ],
          "name": "甘孜藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "合江县",
              "key": "510522"
            },
            {
              "name": "泸县",
              "key": "510521"
            },
            {
              "name": "江阳区",
              "key": "510502"
            },
            {
              "name": "叙永县",
              "key": "510524"
            },
            {
              "name": "市辖区",
              "key": "510501"
            },
            {
              "name": "龙马潭区",
              "key": "510504"
            },
            {
              "name": "纳溪区",
              "key": "510503"
            },
            {
              "name": "古蔺县",
              "key": "510525"
            }
          ],
          "name": "泸州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "万源市",
              "key": "511781"
            },
            {
              "name": "宣汉县",
              "key": "511722"
            },
            {
              "name": "市辖区",
              "key": "511701"
            },
            {
              "name": "开江县",
              "key": "511723"
            },
            {
              "name": "通川区",
              "key": "511702"
            },
            {
              "name": "大竹县",
              "key": "511724"
            },
            {
              "name": "达川区",
              "key": "511703"
            },
            {
              "name": "渠县",
              "key": "511725"
            }
          ],
          "name": "达州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "米易县",
              "key": "510421"
            },
            {
              "name": "市辖区",
              "key": "510401"
            },
            {
              "name": "仁和区",
              "key": "510411"
            },
            {
              "name": "盐边县",
              "key": "510422"
            },
            {
              "name": "西区",
              "key": "510403"
            },
            {
              "name": "东区",
              "key": "510402"
            }
          ],
          "name": "攀枝花市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宝兴县",
              "key": "511827"
            },
            {
              "name": "荥经县",
              "key": "511822"
            },
            {
              "name": "名山区",
              "key": "511803"
            },
            {
              "name": "天全县",
              "key": "511825"
            },
            {
              "name": "芦山县",
              "key": "511826"
            },
            {
              "name": "市辖区",
              "key": "511801"
            },
            {
              "name": "汉源县",
              "key": "511823"
            },
            {
              "name": "雨城区",
              "key": "511802"
            },
            {
              "name": "石棉县",
              "key": "511824"
            }
          ],
          "name": "雅安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安州区",
              "key": "510705"
            },
            {
              "name": "平武县",
              "key": "510727"
            },
            {
              "name": "江油市",
              "key": "510781"
            },
            {
              "name": "三台县",
              "key": "510722"
            },
            {
              "name": "市辖区",
              "key": "510701"
            },
            {
              "name": "盐亭县",
              "key": "510723"
            },
            {
              "name": "游仙区",
              "key": "510704"
            },
            {
              "name": "北川羌族自治县",
              "key": "510726"
            },
            {
              "name": "涪城区",
              "key": "510703"
            },
            {
              "name": "梓潼县",
              "key": "510725"
            }
          ],
          "name": "绵阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宜宾县",
              "key": "511521"
            },
            {
              "name": "翠屏区",
              "key": "511502"
            },
            {
              "name": "长宁县",
              "key": "511524"
            },
            {
              "name": "南溪区",
              "key": "511503"
            },
            {
              "name": "高县",
              "key": "511525"
            },
            {
              "name": "市辖区",
              "key": "511501"
            },
            {
              "name": "江安县",
              "key": "511523"
            },
            {
              "name": "兴文县",
              "key": "511528"
            },
            {
              "name": "屏山县",
              "key": "511529"
            },
            {
              "name": "珙县",
              "key": "511526"
            },
            {
              "name": "筠连县",
              "key": "511527"
            }
          ],
          "name": "宜宾市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "广汉市",
              "key": "510681"
            },
            {
              "name": "绵竹市",
              "key": "510683"
            },
            {
              "name": "什邡市",
              "key": "510682"
            },
            {
              "name": "市辖区",
              "key": "510601"
            },
            {
              "name": "中江县",
              "key": "510623"
            },
            {
              "name": "旌阳区",
              "key": "510603"
            },
            {
              "name": "罗江县",
              "key": "510626"
            }
          ],
          "name": "德阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "华蓥市",
              "key": "511681"
            },
            {
              "name": "市辖区",
              "key": "511601"
            },
            {
              "name": "邻水县",
              "key": "511623"
            },
            {
              "name": "广安区",
              "key": "511602"
            },
            {
              "name": "岳池县",
              "key": "511621"
            },
            {
              "name": "武胜县",
              "key": "511622"
            },
            {
              "name": "前锋区",
              "key": "511603"
            }
          ],
          "name": "广安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "旺苍县",
              "key": "510821"
            },
            {
              "name": "利州区",
              "key": "510802"
            },
            {
              "name": "苍溪县",
              "key": "510824"
            },
            {
              "name": "昭化区",
              "key": "510811"
            },
            {
              "name": "青川县",
              "key": "510822"
            },
            {
              "name": "市辖区",
              "key": "510801"
            },
            {
              "name": "朝天区",
              "key": "510812"
            },
            {
              "name": "剑阁县",
              "key": "510823"
            }
          ],
          "name": "广元市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "通江县",
              "key": "511921"
            },
            {
              "name": "巴州区",
              "key": "511902"
            },
            {
              "name": "恩阳区",
              "key": "511903"
            },
            {
              "name": "南江县",
              "key": "511922"
            },
            {
              "name": "市辖区",
              "key": "511901"
            },
            {
              "name": "平昌县",
              "key": "511923"
            }
          ],
          "name": "巴中市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "船山区",
              "key": "510903"
            },
            {
              "name": "安居区",
              "key": "510904"
            },
            {
              "name": "市辖区",
              "key": "510901"
            },
            {
              "name": "大英县",
              "key": "510923"
            },
            {
              "name": "蓬溪县",
              "key": "510921"
            },
            {
              "name": "射洪县",
              "key": "510922"
            }
          ],
          "name": "遂宁市",
          "key": "name"
        }
      ]
    },
    {
      "name": "宁夏回族自治区",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "灵武市",
              "key": "640181"
            },
            {
              "name": "贺兰县",
              "key": "640122"
            },
            {
              "name": "永宁县",
              "key": "640121"
            },
            {
              "name": "市辖区",
              "key": "640101"
            },
            {
              "name": "兴庆区",
              "key": "640104"
            },
            {
              "name": "金凤区",
              "key": "640106"
            },
            {
              "name": "西夏区",
              "key": "640105"
            }
          ],
          "name": "银川市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "青铜峡市",
              "key": "640381"
            },
            {
              "name": "利通区",
              "key": "640302"
            },
            {
              "name": "同心县",
              "key": "640324"
            },
            {
              "name": "市辖区",
              "key": "640301"
            },
            {
              "name": "盐池县",
              "key": "640323"
            },
            {
              "name": "红寺堡区",
              "key": "640303"
            }
          ],
          "name": "吴忠市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "平罗县",
              "key": "640221"
            },
            {
              "name": "市辖区",
              "key": "640201"
            },
            {
              "name": "大武口区",
              "key": "640202"
            },
            {
              "name": "惠农区",
              "key": "640205"
            }
          ],
          "name": "石嘴山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海原县",
              "key": "640522"
            },
            {
              "name": "中宁县",
              "key": "640521"
            },
            {
              "name": "沙坡头区",
              "key": "640502"
            },
            {
              "name": "市辖区",
              "key": "640501"
            }
          ],
          "name": "中卫市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "640401"
            },
            {
              "name": "隆德县",
              "key": "640423"
            },
            {
              "name": "西吉县",
              "key": "640422"
            },
            {
              "name": "彭阳县",
              "key": "640425"
            },
            {
              "name": "原州区",
              "key": "640402"
            },
            {
              "name": "泾源县",
              "key": "640424"
            }
          ],
          "name": "固原市",
          "key": "name"
        }
      ]
    },
    {
      "name": "吉林省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "市辖区",
              "key": "220801"
            },
            {
              "name": "通榆县",
              "key": "220822"
            },
            {
              "name": "洮北区",
              "key": "220802"
            },
            {
              "name": "洮南市",
              "key": "220881"
            },
            {
              "name": "大安市",
              "key": "220882"
            },
            {
              "name": "镇赉县",
              "key": "220821"
            }
          ],
          "name": "白城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "榆树市",
              "key": "220182"
            },
            {
              "name": "德惠市",
              "key": "220183"
            },
            {
              "name": "农安县",
              "key": "220122"
            },
            {
              "name": "南关区",
              "key": "220102"
            },
            {
              "name": "九台区",
              "key": "220113"
            },
            {
              "name": "市辖区",
              "key": "220101"
            },
            {
              "name": "双阳区",
              "key": "220112"
            },
            {
              "name": "朝阳区",
              "key": "220104"
            },
            {
              "name": "宽城区",
              "key": "220103"
            },
            {
              "name": "绿园区",
              "key": "220106"
            },
            {
              "name": "二道区",
              "key": "220105"
            }
          ],
          "name": "长春市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "和龙市",
              "key": "222406"
            },
            {
              "name": "延吉市",
              "key": "222401"
            },
            {
              "name": "珲春市",
              "key": "222404"
            },
            {
              "name": "安图县",
              "key": "222426"
            },
            {
              "name": "龙井市",
              "key": "222405"
            },
            {
              "name": "图们市",
              "key": "222402"
            },
            {
              "name": "汪清县",
              "key": "222424"
            },
            {
              "name": "敦化市",
              "key": "222403"
            }
          ],
          "name": "延边朝鲜族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "双辽市",
              "key": "220382"
            },
            {
              "name": "公主岭市",
              "key": "220381"
            },
            {
              "name": "梨树县",
              "key": "220322"
            },
            {
              "name": "铁西区",
              "key": "220302"
            },
            {
              "name": "市辖区",
              "key": "220301"
            },
            {
              "name": "伊通满族自治县",
              "key": "220323"
            },
            {
              "name": "铁东区",
              "key": "220303"
            }
          ],
          "name": "四平市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "蛟河市",
              "key": "220281"
            },
            {
              "name": "舒兰市",
              "key": "220283"
            },
            {
              "name": "桦甸市",
              "key": "220282"
            },
            {
              "name": "磐石市",
              "key": "220284"
            },
            {
              "name": "永吉县",
              "key": "220221"
            },
            {
              "name": "市辖区",
              "key": "220201"
            },
            {
              "name": "丰满区",
              "key": "220211"
            },
            {
              "name": "龙潭区",
              "key": "220203"
            },
            {
              "name": "昌邑区",
              "key": "220202"
            },
            {
              "name": "船营区",
              "key": "220204"
            }
          ],
          "name": "吉林市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "二道江区",
              "key": "220503"
            },
            {
              "name": "集安市",
              "key": "220582"
            },
            {
              "name": "梅河口市",
              "key": "220581"
            },
            {
              "name": "通化县",
              "key": "220521"
            },
            {
              "name": "东昌区",
              "key": "220502"
            },
            {
              "name": "柳河县",
              "key": "220524"
            },
            {
              "name": "市辖区",
              "key": "220501"
            },
            {
              "name": "辉南县",
              "key": "220523"
            }
          ],
          "name": "通化市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "东丰县",
              "key": "220421"
            },
            {
              "name": "市辖区",
              "key": "220401"
            },
            {
              "name": "东辽县",
              "key": "220422"
            },
            {
              "name": "西安区",
              "key": "220403"
            },
            {
              "name": "龙山区",
              "key": "220402"
            }
          ],
          "name": "辽源市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宁江区",
              "key": "220702"
            },
            {
              "name": "市辖区",
              "key": "220701"
            },
            {
              "name": "乾安县",
              "key": "220723"
            },
            {
              "name": "扶余市",
              "key": "220781"
            },
            {
              "name": "长岭县",
              "key": "220722"
            },
            {
              "name": "前郭尔罗斯蒙古族自治县",
              "key": "220721"
            }
          ],
          "name": "松原市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "浑江区",
              "key": "220602"
            },
            {
              "name": "江源区",
              "key": "220605"
            },
            {
              "name": "临江市",
              "key": "220681"
            },
            {
              "name": "抚松县",
              "key": "220621"
            },
            {
              "name": "市辖区",
              "key": "220601"
            },
            {
              "name": "长白朝鲜族自治县",
              "key": "220623"
            },
            {
              "name": "靖宇县",
              "key": "220622"
            }
          ],
          "name": "白山市",
          "key": "name"
        }
      ]
    },
    {
      "name": "福建省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "云霄县",
              "key": "350622"
            },
            {
              "name": "市辖区",
              "key": "350601"
            },
            {
              "name": "漳浦县",
              "key": "350623"
            },
            {
              "name": "芗城区",
              "key": "350602"
            },
            {
              "name": "诏安县",
              "key": "350624"
            },
            {
              "name": "龙文区",
              "key": "350603"
            },
            {
              "name": "长泰县",
              "key": "350625"
            },
            {
              "name": "东山县",
              "key": "350626"
            },
            {
              "name": "南靖县",
              "key": "350627"
            },
            {
              "name": "平和县",
              "key": "350628"
            },
            {
              "name": "华安县",
              "key": "350629"
            },
            {
              "name": "龙海市",
              "key": "350681"
            }
          ],
          "name": "漳州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "顺昌县",
              "key": "350721"
            },
            {
              "name": "浦城县",
              "key": "350722"
            },
            {
              "name": "市辖区",
              "key": "350701"
            },
            {
              "name": "光泽县",
              "key": "350723"
            },
            {
              "name": "延平区",
              "key": "350702"
            },
            {
              "name": "松溪县",
              "key": "350724"
            },
            {
              "name": "建阳区",
              "key": "350703"
            },
            {
              "name": "政和县",
              "key": "350725"
            },
            {
              "name": "邵武市",
              "key": "350781"
            },
            {
              "name": "武夷山市",
              "key": "350782"
            },
            {
              "name": "建瓯市",
              "key": "350783"
            }
          ],
          "name": "南平市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "长汀县",
              "key": "350821"
            },
            {
              "name": "市辖区",
              "key": "350801"
            },
            {
              "name": "上杭县",
              "key": "350823"
            },
            {
              "name": "新罗区",
              "key": "350802"
            },
            {
              "name": "武平县",
              "key": "350824"
            },
            {
              "name": "永定区",
              "key": "350803"
            },
            {
              "name": "连城县",
              "key": "350825"
            },
            {
              "name": "漳平市",
              "key": "350881"
            }
          ],
          "name": "龙岩市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "霞浦县",
              "key": "350921"
            },
            {
              "name": "古田县",
              "key": "350922"
            },
            {
              "name": "市辖区",
              "key": "350901"
            },
            {
              "name": "屏南县",
              "key": "350923"
            },
            {
              "name": "蕉城区",
              "key": "350902"
            },
            {
              "name": "寿宁县",
              "key": "350924"
            },
            {
              "name": "周宁县",
              "key": "350925"
            },
            {
              "name": "柘荣县",
              "key": "350926"
            },
            {
              "name": "福安市",
              "key": "350981"
            },
            {
              "name": "福鼎市",
              "key": "350982"
            }
          ],
          "name": "宁德市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "马尾区",
              "key": "350105"
            },
            {
              "name": "平潭县",
              "key": "350128"
            },
            {
              "name": "闽侯县",
              "key": "350121"
            },
            {
              "name": "晋安区",
              "key": "350111"
            },
            {
              "name": "连江县",
              "key": "350122"
            },
            {
              "name": "市辖区",
              "key": "350101"
            },
            {
              "name": "罗源县",
              "key": "350123"
            },
            {
              "name": "鼓楼区",
              "key": "350102"
            },
            {
              "name": "闽清县",
              "key": "350124"
            },
            {
              "name": "台江区",
              "key": "350103"
            },
            {
              "name": "永泰县",
              "key": "350125"
            },
            {
              "name": "仓山区",
              "key": "350104"
            },
            {
              "name": "福清市",
              "key": "350181"
            },
            {
              "name": "长乐市",
              "key": "350182"
            }
          ],
          "name": "福州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海沧区",
              "key": "350205"
            },
            {
              "name": "湖里区",
              "key": "350206"
            },
            {
              "name": "集美区",
              "key": "350211"
            },
            {
              "name": "市辖区",
              "key": "350201"
            },
            {
              "name": "同安区",
              "key": "350212"
            },
            {
              "name": "翔安区",
              "key": "350213"
            },
            {
              "name": "思明区",
              "key": "350203"
            }
          ],
          "name": "厦门市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "涵江区",
              "key": "350303"
            },
            {
              "name": "荔城区",
              "key": "350304"
            },
            {
              "name": "秀屿区",
              "key": "350305"
            },
            {
              "name": "仙游县",
              "key": "350322"
            },
            {
              "name": "市辖区",
              "key": "350301"
            },
            {
              "name": "城厢区",
              "key": "350302"
            }
          ],
          "name": "莆田市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "梅列区",
              "key": "350402"
            },
            {
              "name": "宁化县",
              "key": "350424"
            },
            {
              "name": "三元区",
              "key": "350403"
            },
            {
              "name": "大田县",
              "key": "350425"
            },
            {
              "name": "尤溪县",
              "key": "350426"
            },
            {
              "name": "沙县",
              "key": "350427"
            },
            {
              "name": "将乐县",
              "key": "350428"
            },
            {
              "name": "泰宁县",
              "key": "350429"
            },
            {
              "name": "建宁县",
              "key": "350430"
            },
            {
              "name": "明溪县",
              "key": "350421"
            },
            {
              "name": "市辖区",
              "key": "350401"
            },
            {
              "name": "清流县",
              "key": "350423"
            },
            {
              "name": "永安市",
              "key": "350481"
            }
          ],
          "name": "三明市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "350501"
            },
            {
              "name": "鲤城区",
              "key": "350502"
            },
            {
              "name": "安溪县",
              "key": "350524"
            },
            {
              "name": "丰泽区",
              "key": "350503"
            },
            {
              "name": "永春县",
              "key": "350525"
            },
            {
              "name": "洛江区",
              "key": "350504"
            },
            {
              "name": "德化县",
              "key": "350526"
            },
            {
              "name": "泉港区",
              "key": "350505"
            },
            {
              "name": "金门县",
              "key": "350527"
            },
            {
              "name": "石狮市",
              "key": "350581"
            },
            {
              "name": "晋江市",
              "key": "350582"
            },
            {
              "name": "南安市",
              "key": "350583"
            },
            {
              "name": "惠安县",
              "key": "350521"
            }
          ],
          "name": "泉州市",
          "key": "name"
        }
      ]
    },
    {
      "name": "湖北省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "神农架林区",
              "key": "429021"
            },
            {
              "name": "天门市",
              "key": "429006"
            },
            {
              "name": "潜江市",
              "key": "429005"
            },
            {
              "name": "仙桃市",
              "key": "429004"
            }
          ],
          "name": "省直辖县级行政区划",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "洪山区",
              "key": "420111"
            },
            {
              "name": "硚口区",
              "key": "420104"
            },
            {
              "name": "江夏区",
              "key": "420115"
            },
            {
              "name": "江汉区",
              "key": "420103"
            },
            {
              "name": "蔡甸区",
              "key": "420114"
            },
            {
              "name": "江岸区",
              "key": "420102"
            },
            {
              "name": "汉南区",
              "key": "420113"
            },
            {
              "name": "市辖区",
              "key": "420101"
            },
            {
              "name": "东西湖区",
              "key": "420112"
            },
            {
              "name": "青山区",
              "key": "420107"
            },
            {
              "name": "武昌区",
              "key": "420106"
            },
            {
              "name": "新洲区",
              "key": "420117"
            },
            {
              "name": "汉阳区",
              "key": "420105"
            },
            {
              "name": "黄陂区",
              "key": "420116"
            }
          ],
          "name": "武汉市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "咸安区",
              "key": "421202"
            },
            {
              "name": "通山县",
              "key": "421224"
            },
            {
              "name": "市辖区",
              "key": "421201"
            },
            {
              "name": "崇阳县",
              "key": "421223"
            },
            {
              "name": "赤壁市",
              "key": "421281"
            },
            {
              "name": "通城县",
              "key": "421222"
            },
            {
              "name": "嘉鱼县",
              "key": "421221"
            }
          ],
          "name": "咸宁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "黄梅县",
              "key": "421127"
            },
            {
              "name": "蕲春县",
              "key": "421126"
            },
            {
              "name": "浠水县",
              "key": "421125"
            },
            {
              "name": "黄州区",
              "key": "421102"
            },
            {
              "name": "英山县",
              "key": "421124"
            },
            {
              "name": "麻城市",
              "key": "421181"
            },
            {
              "name": "武穴市",
              "key": "421182"
            },
            {
              "name": "市辖区",
              "key": "421101"
            },
            {
              "name": "罗田县",
              "key": "421123"
            },
            {
              "name": "红安县",
              "key": "421122"
            },
            {
              "name": "团风县",
              "key": "421121"
            }
          ],
          "name": "黄冈市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "荆州区",
              "key": "421003"
            },
            {
              "name": "石首市",
              "key": "421081"
            },
            {
              "name": "洪湖市",
              "key": "421083"
            },
            {
              "name": "沙市区",
              "key": "421002"
            },
            {
              "name": "江陵县",
              "key": "421024"
            },
            {
              "name": "市辖区",
              "key": "421001"
            },
            {
              "name": "监利县",
              "key": "421023"
            },
            {
              "name": "公安县",
              "key": "421022"
            },
            {
              "name": "松滋市",
              "key": "421087"
            }
          ],
          "name": "荆州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "枝江市",
              "key": "420583"
            },
            {
              "name": "当阳市",
              "key": "420582"
            },
            {
              "name": "宜都市",
              "key": "420581"
            },
            {
              "name": "点军区",
              "key": "420504"
            },
            {
              "name": "兴山县",
              "key": "420526"
            },
            {
              "name": "伍家岗区",
              "key": "420503"
            },
            {
              "name": "远安县",
              "key": "420525"
            },
            {
              "name": "西陵区",
              "key": "420502"
            },
            {
              "name": "市辖区",
              "key": "420501"
            },
            {
              "name": "五峰土家族自治县",
              "key": "420529"
            },
            {
              "name": "夷陵区",
              "key": "420506"
            },
            {
              "name": "长阳土家族自治县",
              "key": "420528"
            },
            {
              "name": "猇亭区",
              "key": "420505"
            },
            {
              "name": "秭归县",
              "key": "420527"
            }
          ],
          "name": "宜昌市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "建始县",
              "key": "422822"
            },
            {
              "name": "恩施市",
              "key": "422801"
            },
            {
              "name": "巴东县",
              "key": "422823"
            },
            {
              "name": "利川市",
              "key": "422802"
            },
            {
              "name": "宣恩县",
              "key": "422825"
            },
            {
              "name": "咸丰县",
              "key": "422826"
            },
            {
              "name": "来凤县",
              "key": "422827"
            },
            {
              "name": "鹤峰县",
              "key": "422828"
            }
          ],
          "name": "恩施土家族苗族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "茅箭区",
              "key": "420302"
            },
            {
              "name": "竹溪县",
              "key": "420324"
            },
            {
              "name": "市辖区",
              "key": "420301"
            },
            {
              "name": "竹山县",
              "key": "420323"
            },
            {
              "name": "郧西县",
              "key": "420322"
            },
            {
              "name": "郧阳区",
              "key": "420304"
            },
            {
              "name": "张湾区",
              "key": "420303"
            },
            {
              "name": "房县",
              "key": "420325"
            },
            {
              "name": "丹江口市",
              "key": "420381"
            }
          ],
          "name": "十堰市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "西塞山区",
              "key": "420203"
            },
            {
              "name": "黄石港区",
              "key": "420202"
            },
            {
              "name": "市辖区",
              "key": "420201"
            },
            {
              "name": "阳新县",
              "key": "420222"
            },
            {
              "name": "铁山区",
              "key": "420205"
            },
            {
              "name": "下陆区",
              "key": "420204"
            },
            {
              "name": "大冶市",
              "key": "420281"
            }
          ],
          "name": "黄石市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "曾都区",
              "key": "421303"
            },
            {
              "name": "市辖区",
              "key": "421301"
            },
            {
              "name": "广水市",
              "key": "421381"
            },
            {
              "name": "随县",
              "key": "421321"
            }
          ],
          "name": "随州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "汉川市",
              "key": "420984"
            },
            {
              "name": "安陆市",
              "key": "420982"
            },
            {
              "name": "应城市",
              "key": "420981"
            },
            {
              "name": "大悟县",
              "key": "420922"
            },
            {
              "name": "孝昌县",
              "key": "420921"
            },
            {
              "name": "孝南区",
              "key": "420902"
            },
            {
              "name": "市辖区",
              "key": "420901"
            },
            {
              "name": "云梦县",
              "key": "420923"
            }
          ],
          "name": "孝感市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "420801"
            },
            {
              "name": "沙洋县",
              "key": "420822"
            },
            {
              "name": "京山县",
              "key": "420821"
            },
            {
              "name": "掇刀区",
              "key": "420804"
            },
            {
              "name": "东宝区",
              "key": "420802"
            },
            {
              "name": "钟祥市",
              "key": "420881"
            }
          ],
          "name": "荆门市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "梁子湖区",
              "key": "420702"
            },
            {
              "name": "市辖区",
              "key": "420701"
            },
            {
              "name": "鄂城区",
              "key": "420704"
            },
            {
              "name": "华容区",
              "key": "420703"
            }
          ],
          "name": "鄂州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "宜城市",
              "key": "420684"
            },
            {
              "name": "谷城县",
              "key": "420625"
            },
            {
              "name": "襄城区",
              "key": "420602"
            },
            {
              "name": "南漳县",
              "key": "420624"
            },
            {
              "name": "市辖区",
              "key": "420601"
            },
            {
              "name": "襄州区",
              "key": "420607"
            },
            {
              "name": "樊城区",
              "key": "420606"
            },
            {
              "name": "保康县",
              "key": "420626"
            },
            {
              "name": "枣阳市",
              "key": "420683"
            },
            {
              "name": "老河口市",
              "key": "420682"
            }
          ],
          "name": "襄阳市",
          "key": "name"
        }
      ]
    },
    {
      "name": "广东省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "电白区",
              "key": "440904"
            },
            {
              "name": "茂南区",
              "key": "440902"
            },
            {
              "name": "市辖区",
              "key": "440901"
            },
            {
              "name": "信宜市",
              "key": "440983"
            },
            {
              "name": "化州市",
              "key": "440982"
            },
            {
              "name": "高州市",
              "key": "440981"
            }
          ],
          "name": "茂名市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "坡头区",
              "key": "440804"
            },
            {
              "name": "霞山区",
              "key": "440803"
            },
            {
              "name": "徐闻县",
              "key": "440825"
            },
            {
              "name": "赤坎区",
              "key": "440802"
            },
            {
              "name": "市辖区",
              "key": "440801"
            },
            {
              "name": "遂溪县",
              "key": "440823"
            },
            {
              "name": "麻章区",
              "key": "440811"
            },
            {
              "name": "吴川市",
              "key": "440883"
            },
            {
              "name": "雷州市",
              "key": "440882"
            },
            {
              "name": "廉江市",
              "key": "440881"
            }
          ],
          "name": "湛江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新会区",
              "key": "440705"
            },
            {
              "name": "江海区",
              "key": "440704"
            },
            {
              "name": "蓬江区",
              "key": "440703"
            },
            {
              "name": "市辖区",
              "key": "440701"
            },
            {
              "name": "恩平市",
              "key": "440785"
            },
            {
              "name": "鹤山市",
              "key": "440784"
            },
            {
              "name": "开平市",
              "key": "440783"
            },
            {
              "name": "台山市",
              "key": "440781"
            }
          ],
          "name": "江门市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "连南瑶族自治县",
              "key": "441826"
            },
            {
              "name": "清新区",
              "key": "441803"
            },
            {
              "name": "连山壮族瑶族自治县",
              "key": "441825"
            },
            {
              "name": "清城区",
              "key": "441802"
            },
            {
              "name": "市辖区",
              "key": "441801"
            },
            {
              "name": "阳山县",
              "key": "441823"
            },
            {
              "name": "佛冈县",
              "key": "441821"
            },
            {
              "name": "连州市",
              "key": "441882"
            },
            {
              "name": "英德市",
              "key": "441881"
            }
          ],
          "name": "清远市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "高明区",
              "key": "440608"
            },
            {
              "name": "三水区",
              "key": "440607"
            },
            {
              "name": "顺德区",
              "key": "440606"
            },
            {
              "name": "南海区",
              "key": "440605"
            },
            {
              "name": "禅城区",
              "key": "440604"
            },
            {
              "name": "市辖区",
              "key": "440601"
            }
          ],
          "name": "佛山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "阳春市",
              "key": "441781"
            },
            {
              "name": "阳东区",
              "key": "441704"
            },
            {
              "name": "江城区",
              "key": "441702"
            },
            {
              "name": "市辖区",
              "key": "441701"
            },
            {
              "name": "阳西县",
              "key": "441721"
            }
          ],
          "name": "阳江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "龙湖区",
              "key": "440507"
            },
            {
              "name": "澄海区",
              "key": "440515"
            },
            {
              "name": "潮南区",
              "key": "440514"
            },
            {
              "name": "潮阳区",
              "key": "440513"
            },
            {
              "name": "市辖区",
              "key": "440501"
            },
            {
              "name": "濠江区",
              "key": "440512"
            },
            {
              "name": "南澳县",
              "key": "440523"
            },
            {
              "name": "金平区",
              "key": "440511"
            }
          ],
          "name": "汕头市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "东源县",
              "key": "441625"
            },
            {
              "name": "源城区",
              "key": "441602"
            },
            {
              "name": "和平县",
              "key": "441624"
            },
            {
              "name": "市辖区",
              "key": "441601"
            },
            {
              "name": "连平县",
              "key": "441623"
            },
            {
              "name": "龙川县",
              "key": "441622"
            },
            {
              "name": "紫金县",
              "key": "441621"
            }
          ],
          "name": "河源市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "金湾区",
              "key": "440404"
            },
            {
              "name": "斗门区",
              "key": "440403"
            },
            {
              "name": "香洲区",
              "key": "440402"
            },
            {
              "name": "市辖区",
              "key": "440401"
            }
          ],
          "name": "珠海市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "陆丰市",
              "key": "441581"
            },
            {
              "name": "城区",
              "key": "441502"
            },
            {
              "name": "市辖区",
              "key": "441501"
            },
            {
              "name": "陆河县",
              "key": "441523"
            },
            {
              "name": "海丰县",
              "key": "441521"
            }
          ],
          "name": "汕尾市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "盐田区",
              "key": "440308"
            },
            {
              "name": "龙岗区",
              "key": "440307"
            },
            {
              "name": "宝安区",
              "key": "440306"
            },
            {
              "name": "南山区",
              "key": "440305"
            },
            {
              "name": "福田区",
              "key": "440304"
            },
            {
              "name": "罗湖区",
              "key": "440303"
            },
            {
              "name": "市辖区",
              "key": "440301"
            }
          ],
          "name": "深圳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "兴宁市",
              "key": "441481"
            },
            {
              "name": "蕉岭县",
              "key": "441427"
            },
            {
              "name": "平远县",
              "key": "441426"
            },
            {
              "name": "梅县区",
              "key": "441403"
            },
            {
              "name": "梅江区",
              "key": "441402"
            },
            {
              "name": "五华县",
              "key": "441424"
            },
            {
              "name": "市辖区",
              "key": "441401"
            },
            {
              "name": "丰顺县",
              "key": "441423"
            },
            {
              "name": "大埔县",
              "key": "441422"
            }
          ],
          "name": "梅州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "揭东区",
              "key": "445203"
            },
            {
              "name": "普宁市",
              "key": "445281"
            },
            {
              "name": "揭西县",
              "key": "445222"
            },
            {
              "name": "榕城区",
              "key": "445202"
            },
            {
              "name": "惠来县",
              "key": "445224"
            },
            {
              "name": "市辖区",
              "key": "445201"
            }
          ],
          "name": "揭阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "南雄市",
              "key": "440282"
            },
            {
              "name": "乐昌市",
              "key": "440281"
            },
            {
              "name": "翁源县",
              "key": "440229"
            },
            {
              "name": "曲江区",
              "key": "440205"
            },
            {
              "name": "浈江区",
              "key": "440204"
            },
            {
              "name": "武江区",
              "key": "440203"
            },
            {
              "name": "仁化县",
              "key": "440224"
            },
            {
              "name": "市辖区",
              "key": "440201"
            },
            {
              "name": "始兴县",
              "key": "440222"
            },
            {
              "name": "新丰县",
              "key": "440233"
            },
            {
              "name": "乳源瑶族自治县",
              "key": "440232"
            }
          ],
          "name": "韶关市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "惠阳区",
              "key": "441303"
            },
            {
              "name": "惠城区",
              "key": "441302"
            },
            {
              "name": "龙门县",
              "key": "441324"
            },
            {
              "name": "市辖区",
              "key": "441301"
            },
            {
              "name": "惠东县",
              "key": "441323"
            },
            {
              "name": "博罗县",
              "key": "441322"
            }
          ],
          "name": "惠州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "445101"
            },
            {
              "name": "饶平县",
              "key": "445122"
            },
            {
              "name": "潮安区",
              "key": "445103"
            },
            {
              "name": "湘桥区",
              "key": "445102"
            }
          ],
          "name": "潮州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "增城区",
              "key": "440118"
            },
            {
              "name": "天河区",
              "key": "440106"
            },
            {
              "name": "从化区",
              "key": "440117"
            },
            {
              "name": "海珠区",
              "key": "440105"
            },
            {
              "name": "越秀区",
              "key": "440104"
            },
            {
              "name": "南沙区",
              "key": "440115"
            },
            {
              "name": "荔湾区",
              "key": "440103"
            },
            {
              "name": "花都区",
              "key": "440114"
            },
            {
              "name": "番禺区",
              "key": "440113"
            },
            {
              "name": "市辖区",
              "key": "440101"
            },
            {
              "name": "黄埔区",
              "key": "440112"
            },
            {
              "name": "白云区",
              "key": "440111"
            }
          ],
          "name": "广州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "四会市",
              "key": "441284"
            },
            {
              "name": "高要区",
              "key": "441204"
            },
            {
              "name": "德庆县",
              "key": "441226"
            },
            {
              "name": "鼎湖区",
              "key": "441203"
            },
            {
              "name": "封开县",
              "key": "441225"
            },
            {
              "name": "端州区",
              "key": "441202"
            },
            {
              "name": "怀集县",
              "key": "441224"
            },
            {
              "name": "市辖区",
              "key": "441201"
            },
            {
              "name": "广宁县",
              "key": "441223"
            }
          ],
          "name": "肇庆市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "云安区",
              "key": "445303"
            },
            {
              "name": "云城区",
              "key": "445302"
            },
            {
              "name": "罗定市",
              "key": "445381"
            },
            {
              "name": "新兴县",
              "key": "445321"
            },
            {
              "name": "市辖区",
              "key": "445301"
            },
            {
              "name": "郁南县",
              "key": "445322"
            }
          ],
          "name": "云浮市",
          "key": "name"
        }
      ]
    },
    {
      "name": "重庆市",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "梁平县",
              "key": "500228"
            },
            {
              "name": "巫溪县",
              "key": "500238"
            },
            {
              "name": "巫山县",
              "key": "500237"
            },
            {
              "name": "奉节县",
              "key": "500236"
            },
            {
              "name": "城口县",
              "key": "500229"
            },
            {
              "name": "垫江县",
              "key": "500231"
            },
            {
              "name": "酉阳土家族苗族自治县",
              "key": "500242"
            },
            {
              "name": "丰都县",
              "key": "500230"
            },
            {
              "name": "秀山土家族苗族自治县",
              "key": "500241"
            },
            {
              "name": "石柱土家族自治县",
              "key": "500240"
            },
            {
              "name": "云阳县",
              "key": "500235"
            },
            {
              "name": "忠县",
              "key": "500233"
            },
            {
              "name": "武隆县",
              "key": "500232"
            },
            {
              "name": "彭水苗族土家族自治县",
              "key": "500243"
            }
          ],
          "name": "县",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "九龙坡区",
              "key": "500107"
            },
            {
              "name": "永川区",
              "key": "500118"
            },
            {
              "name": "沙坪坝区",
              "key": "500106"
            },
            {
              "name": "合川区",
              "key": "500117"
            },
            {
              "name": "江北区",
              "key": "500105"
            },
            {
              "name": "江津区",
              "key": "500116"
            },
            {
              "name": "大渡口区",
              "key": "500104"
            },
            {
              "name": "长寿区",
              "key": "500115"
            },
            {
              "name": "北碚区",
              "key": "500109"
            },
            {
              "name": "南岸区",
              "key": "500108"
            },
            {
              "name": "南川区",
              "key": "500119"
            },
            {
              "name": "綦江区",
              "key": "500110"
            },
            {
              "name": "开州区",
              "key": "500154"
            },
            {
              "name": "璧山区",
              "key": "500120"
            },
            {
              "name": "荣昌区",
              "key": "500153"
            },
            {
              "name": "潼南区",
              "key": "500152"
            },
            {
              "name": "铜梁区",
              "key": "500151"
            },
            {
              "name": "渝中区",
              "key": "500103"
            },
            {
              "name": "黔江区",
              "key": "500114"
            },
            {
              "name": "涪陵区",
              "key": "500102"
            },
            {
              "name": "巴南区",
              "key": "500113"
            },
            {
              "name": "万州区",
              "key": "500101"
            },
            {
              "name": "渝北区",
              "key": "500112"
            },
            {
              "name": "大足区",
              "key": "500111"
            }
          ],
          "name": "市辖区",
          "key": "name"
        }
      ]
    },
    {
      "name": "山西省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "汾阳市",
              "key": "141182"
            },
            {
              "name": "孝义市",
              "key": "141181"
            },
            {
              "name": "交口县",
              "key": "141130"
            },
            {
              "name": "交城县",
              "key": "141122"
            },
            {
              "name": "文水县",
              "key": "141121"
            },
            {
              "name": "离石区",
              "key": "141102"
            },
            {
              "name": "临县",
              "key": "141124"
            },
            {
              "name": "市辖区",
              "key": "141101"
            },
            {
              "name": "兴县",
              "key": "141123"
            },
            {
              "name": "石楼县",
              "key": "141126"
            },
            {
              "name": "柳林县",
              "key": "141125"
            },
            {
              "name": "方山县",
              "key": "141128"
            },
            {
              "name": "岚县",
              "key": "141127"
            },
            {
              "name": "中阳县",
              "key": "141129"
            }
          ],
          "name": "吕梁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "侯马市",
              "key": "141081"
            },
            {
              "name": "霍州市",
              "key": "141082"
            },
            {
              "name": "大宁县",
              "key": "141030"
            },
            {
              "name": "曲沃县",
              "key": "141021"
            },
            {
              "name": "永和县",
              "key": "141032"
            },
            {
              "name": "隰县",
              "key": "141031"
            },
            {
              "name": "市辖区",
              "key": "141001"
            },
            {
              "name": "襄汾县",
              "key": "141023"
            },
            {
              "name": "汾西县",
              "key": "141034"
            },
            {
              "name": "翼城县",
              "key": "141022"
            },
            {
              "name": "蒲县",
              "key": "141033"
            },
            {
              "name": "古县",
              "key": "141025"
            },
            {
              "name": "尧都区",
              "key": "141002"
            },
            {
              "name": "洪洞县",
              "key": "141024"
            },
            {
              "name": "浮山县",
              "key": "141027"
            },
            {
              "name": "安泽县",
              "key": "141026"
            },
            {
              "name": "乡宁县",
              "key": "141029"
            },
            {
              "name": "吉县",
              "key": "141028"
            }
          ],
          "name": "临汾市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "晋源区",
              "key": "140110"
            },
            {
              "name": "清徐县",
              "key": "140121"
            },
            {
              "name": "阳曲县",
              "key": "140122"
            },
            {
              "name": "市辖区",
              "key": "140101"
            },
            {
              "name": "娄烦县",
              "key": "140123"
            },
            {
              "name": "小店区",
              "key": "140105"
            },
            {
              "name": "迎泽区",
              "key": "140106"
            },
            {
              "name": "杏花岭区",
              "key": "140107"
            },
            {
              "name": "尖草坪区",
              "key": "140108"
            },
            {
              "name": "万柏林区",
              "key": "140109"
            },
            {
              "name": "古交市",
              "key": "140181"
            }
          ],
          "name": "太原市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "阳高县",
              "key": "140221"
            },
            {
              "name": "南郊区",
              "key": "140211"
            },
            {
              "name": "天镇县",
              "key": "140222"
            },
            {
              "name": "市辖区",
              "key": "140201"
            },
            {
              "name": "新荣区",
              "key": "140212"
            },
            {
              "name": "广灵县",
              "key": "140223"
            },
            {
              "name": "城区",
              "key": "140202"
            },
            {
              "name": "灵丘县",
              "key": "140224"
            },
            {
              "name": "矿区",
              "key": "140203"
            },
            {
              "name": "浑源县",
              "key": "140225"
            },
            {
              "name": "左云县",
              "key": "140226"
            },
            {
              "name": "大同县",
              "key": "140227"
            }
          ],
          "name": "大同市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "平定县",
              "key": "140321"
            },
            {
              "name": "郊区",
              "key": "140311"
            },
            {
              "name": "盂县",
              "key": "140322"
            },
            {
              "name": "市辖区",
              "key": "140301"
            },
            {
              "name": "城区",
              "key": "140302"
            },
            {
              "name": "矿区",
              "key": "140303"
            }
          ],
          "name": "阳泉市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "潞城市",
              "key": "140481"
            },
            {
              "name": "沁县",
              "key": "140430"
            },
            {
              "name": "沁源县",
              "key": "140431"
            },
            {
              "name": "长治县",
              "key": "140421"
            },
            {
              "name": "郊区",
              "key": "140411"
            },
            {
              "name": "市辖区",
              "key": "140401"
            },
            {
              "name": "襄垣县",
              "key": "140423"
            },
            {
              "name": "城区",
              "key": "140402"
            },
            {
              "name": "屯留县",
              "key": "140424"
            },
            {
              "name": "平顺县",
              "key": "140425"
            },
            {
              "name": "黎城县",
              "key": "140426"
            },
            {
              "name": "壶关县",
              "key": "140427"
            },
            {
              "name": "长子县",
              "key": "140428"
            },
            {
              "name": "武乡县",
              "key": "140429"
            }
          ],
          "name": "长治市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "高平市",
              "key": "140581"
            },
            {
              "name": "沁水县",
              "key": "140521"
            },
            {
              "name": "阳城县",
              "key": "140522"
            },
            {
              "name": "市辖区",
              "key": "140501"
            },
            {
              "name": "城区",
              "key": "140502"
            },
            {
              "name": "陵川县",
              "key": "140524"
            },
            {
              "name": "泽州县",
              "key": "140525"
            }
          ],
          "name": "晋城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "山阴县",
              "key": "140621"
            },
            {
              "name": "应县",
              "key": "140622"
            },
            {
              "name": "市辖区",
              "key": "140601"
            },
            {
              "name": "右玉县",
              "key": "140623"
            },
            {
              "name": "朔城区",
              "key": "140602"
            },
            {
              "name": "怀仁县",
              "key": "140624"
            },
            {
              "name": "平鲁区",
              "key": "140603"
            }
          ],
          "name": "朔州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "平遥县",
              "key": "140728"
            },
            {
              "name": "灵石县",
              "key": "140729"
            },
            {
              "name": "介休市",
              "key": "140781"
            },
            {
              "name": "榆社县",
              "key": "140721"
            },
            {
              "name": "左权县",
              "key": "140722"
            },
            {
              "name": "市辖区",
              "key": "140701"
            },
            {
              "name": "和顺县",
              "key": "140723"
            },
            {
              "name": "榆次区",
              "key": "140702"
            },
            {
              "name": "昔阳县",
              "key": "140724"
            },
            {
              "name": "寿阳县",
              "key": "140725"
            },
            {
              "name": "太谷县",
              "key": "140726"
            },
            {
              "name": "祁县",
              "key": "140727"
            }
          ],
          "name": "晋中市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "垣曲县",
              "key": "140827"
            },
            {
              "name": "夏县",
              "key": "140828"
            },
            {
              "name": "平陆县",
              "key": "140829"
            },
            {
              "name": "永济市",
              "key": "140881"
            },
            {
              "name": "河津市",
              "key": "140882"
            },
            {
              "name": "芮城县",
              "key": "140830"
            },
            {
              "name": "临猗县",
              "key": "140821"
            },
            {
              "name": "万荣县",
              "key": "140822"
            },
            {
              "name": "市辖区",
              "key": "140801"
            },
            {
              "name": "闻喜县",
              "key": "140823"
            },
            {
              "name": "盐湖区",
              "key": "140802"
            },
            {
              "name": "稷山县",
              "key": "140824"
            },
            {
              "name": "新绛县",
              "key": "140825"
            },
            {
              "name": "绛县",
              "key": "140826"
            }
          ],
          "name": "运城市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "静乐县",
              "key": "140926"
            },
            {
              "name": "神池县",
              "key": "140927"
            },
            {
              "name": "五寨县",
              "key": "140928"
            },
            {
              "name": "岢岚县",
              "key": "140929"
            },
            {
              "name": "原平市",
              "key": "140981"
            },
            {
              "name": "河曲县",
              "key": "140930"
            },
            {
              "name": "保德县",
              "key": "140931"
            },
            {
              "name": "定襄县",
              "key": "140921"
            },
            {
              "name": "偏关县",
              "key": "140932"
            },
            {
              "name": "五台县",
              "key": "140922"
            },
            {
              "name": "市辖区",
              "key": "140901"
            },
            {
              "name": "代县",
              "key": "140923"
            },
            {
              "name": "忻府区",
              "key": "140902"
            },
            {
              "name": "繁峙县",
              "key": "140924"
            },
            {
              "name": "宁武县",
              "key": "140925"
            }
          ],
          "name": "忻州市",
          "key": "name"
        }
      ]
    },
    {
      "name": "江西省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "上栗县",
              "key": "360322"
            },
            {
              "name": "市辖区",
              "key": "360301"
            },
            {
              "name": "芦溪县",
              "key": "360323"
            },
            {
              "name": "莲花县",
              "key": "360321"
            },
            {
              "name": "安源区",
              "key": "360302"
            },
            {
              "name": "湘东区",
              "key": "360313"
            }
          ],
          "name": "萍乡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "九江县",
              "key": "360421"
            },
            {
              "name": "彭泽县",
              "key": "360430"
            },
            {
              "name": "庐山市",
              "key": "360483"
            },
            {
              "name": "瑞昌市",
              "key": "360481"
            },
            {
              "name": "共青城市",
              "key": "360482"
            },
            {
              "name": "湖口县",
              "key": "360429"
            },
            {
              "name": "都昌县",
              "key": "360428"
            },
            {
              "name": "浔阳区",
              "key": "360403"
            },
            {
              "name": "永修县",
              "key": "360425"
            },
            {
              "name": "德安县",
              "key": "360426"
            },
            {
              "name": "市辖区",
              "key": "360401"
            },
            {
              "name": "武宁县",
              "key": "360423"
            },
            {
              "name": "濂溪区",
              "key": "360402"
            },
            {
              "name": "修水县",
              "key": "360424"
            }
          ],
          "name": "九江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "东湖区",
              "key": "360102"
            },
            {
              "name": "进贤县",
              "key": "360124"
            },
            {
              "name": "西湖区",
              "key": "360103"
            },
            {
              "name": "青山湖区",
              "key": "360111"
            },
            {
              "name": "市辖区",
              "key": "360101"
            },
            {
              "name": "新建区",
              "key": "360112"
            },
            {
              "name": "安义县",
              "key": "360123"
            },
            {
              "name": "南昌县",
              "key": "360121"
            },
            {
              "name": "青云谱区",
              "key": "360104"
            },
            {
              "name": "湾里区",
              "key": "360105"
            }
          ],
          "name": "南昌市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "360201"
            },
            {
              "name": "昌江区",
              "key": "360202"
            },
            {
              "name": "浮梁县",
              "key": "360222"
            },
            {
              "name": "乐平市",
              "key": "360281"
            },
            {
              "name": "珠山区",
              "key": "360203"
            }
          ],
          "name": "景德镇市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "德兴市",
              "key": "361181"
            },
            {
              "name": "弋阳县",
              "key": "361126"
            },
            {
              "name": "广丰区",
              "key": "361103"
            },
            {
              "name": "横峰县",
              "key": "361125"
            },
            {
              "name": "信州区",
              "key": "361102"
            },
            {
              "name": "铅山县",
              "key": "361124"
            },
            {
              "name": "市辖区",
              "key": "361101"
            },
            {
              "name": "玉山县",
              "key": "361123"
            },
            {
              "name": "上饶县",
              "key": "361121"
            },
            {
              "name": "婺源县",
              "key": "361130"
            },
            {
              "name": "万年县",
              "key": "361129"
            },
            {
              "name": "鄱阳县",
              "key": "361128"
            },
            {
              "name": "余干县",
              "key": "361127"
            }
          ],
          "name": "上饶市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "金溪县",
              "key": "361027"
            },
            {
              "name": "宜黄县",
              "key": "361026"
            },
            {
              "name": "乐安县",
              "key": "361025"
            },
            {
              "name": "临川区",
              "key": "361002"
            },
            {
              "name": "崇仁县",
              "key": "361024"
            },
            {
              "name": "市辖区",
              "key": "361001"
            },
            {
              "name": "南丰县",
              "key": "361023"
            },
            {
              "name": "黎川县",
              "key": "361022"
            },
            {
              "name": "南城县",
              "key": "361021"
            },
            {
              "name": "广昌县",
              "key": "361030"
            },
            {
              "name": "东乡县",
              "key": "361029"
            },
            {
              "name": "资溪县",
              "key": "361028"
            }
          ],
          "name": "抚州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "樟树市",
              "key": "360982"
            },
            {
              "name": "高安市",
              "key": "360983"
            },
            {
              "name": "丰城市",
              "key": "360981"
            },
            {
              "name": "铜鼓县",
              "key": "360926"
            },
            {
              "name": "袁州区",
              "key": "360902"
            },
            {
              "name": "宜丰县",
              "key": "360924"
            },
            {
              "name": "靖安县",
              "key": "360925"
            },
            {
              "name": "万载县",
              "key": "360922"
            },
            {
              "name": "市辖区",
              "key": "360901"
            },
            {
              "name": "上高县",
              "key": "360923"
            },
            {
              "name": "奉新县",
              "key": "360921"
            }
          ],
          "name": "宜春市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "定南县",
              "key": "360728"
            },
            {
              "name": "全南县",
              "key": "360729"
            },
            {
              "name": "宁都县",
              "key": "360730"
            },
            {
              "name": "瑞金市",
              "key": "360781"
            },
            {
              "name": "安远县",
              "key": "360726"
            },
            {
              "name": "龙南县",
              "key": "360727"
            },
            {
              "name": "章贡区",
              "key": "360702"
            },
            {
              "name": "上犹县",
              "key": "360724"
            },
            {
              "name": "石城县",
              "key": "360735"
            },
            {
              "name": "南康区",
              "key": "360703"
            },
            {
              "name": "崇义县",
              "key": "360725"
            },
            {
              "name": "信丰县",
              "key": "360722"
            },
            {
              "name": "会昌县",
              "key": "360733"
            },
            {
              "name": "市辖区",
              "key": "360701"
            },
            {
              "name": "大余县",
              "key": "360723"
            },
            {
              "name": "寻乌县",
              "key": "360734"
            },
            {
              "name": "于都县",
              "key": "360731"
            },
            {
              "name": "赣县",
              "key": "360721"
            },
            {
              "name": "兴国县",
              "key": "360732"
            }
          ],
          "name": "赣州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安福县",
              "key": "360829"
            },
            {
              "name": "遂川县",
              "key": "360827"
            },
            {
              "name": "万安县",
              "key": "360828"
            },
            {
              "name": "井冈山市",
              "key": "360881"
            },
            {
              "name": "青原区",
              "key": "360803"
            },
            {
              "name": "永丰县",
              "key": "360825"
            },
            {
              "name": "泰和县",
              "key": "360826"
            },
            {
              "name": "市辖区",
              "key": "360801"
            },
            {
              "name": "峡江县",
              "key": "360823"
            },
            {
              "name": "吉州区",
              "key": "360802"
            },
            {
              "name": "新干县",
              "key": "360824"
            },
            {
              "name": "吉安县",
              "key": "360821"
            },
            {
              "name": "吉水县",
              "key": "360822"
            },
            {
              "name": "永新县",
              "key": "360830"
            }
          ],
          "name": "吉安市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "分宜县",
              "key": "360521"
            },
            {
              "name": "渝水区",
              "key": "360502"
            },
            {
              "name": "市辖区",
              "key": "360501"
            }
          ],
          "name": "新余市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "贵溪市",
              "key": "360681"
            },
            {
              "name": "市辖区",
              "key": "360601"
            },
            {
              "name": "月湖区",
              "key": "360602"
            },
            {
              "name": "余江县",
              "key": "360622"
            }
          ],
          "name": "鹰潭市",
          "key": "name"
        }
      ]
    },
    {
      "name": "黑龙江省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "肇源县",
              "key": "230622"
            },
            {
              "name": "肇州县",
              "key": "230621"
            },
            {
              "name": "大同区",
              "key": "230606"
            },
            {
              "name": "红岗区",
              "key": "230605"
            },
            {
              "name": "让胡路区",
              "key": "230604"
            },
            {
              "name": "龙凤区",
              "key": "230603"
            },
            {
              "name": "萨尔图区",
              "key": "230602"
            },
            {
              "name": "杜尔伯特蒙古族自治县",
              "key": "230624"
            },
            {
              "name": "市辖区",
              "key": "230601"
            },
            {
              "name": "林甸县",
              "key": "230623"
            }
          ],
          "name": "大庆市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "230501"
            },
            {
              "name": "宝清县",
              "key": "230523"
            },
            {
              "name": "友谊县",
              "key": "230522"
            },
            {
              "name": "集贤县",
              "key": "230521"
            },
            {
              "name": "宝山区",
              "key": "230506"
            },
            {
              "name": "四方台区",
              "key": "230505"
            },
            {
              "name": "岭东区",
              "key": "230503"
            },
            {
              "name": "尖山区",
              "key": "230502"
            },
            {
              "name": "饶河县",
              "key": "230524"
            }
          ],
          "name": "双鸭山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "向阳区",
              "key": "230402"
            },
            {
              "name": "市辖区",
              "key": "230401"
            },
            {
              "name": "绥滨县",
              "key": "230422"
            },
            {
              "name": "萝北县",
              "key": "230421"
            },
            {
              "name": "兴山区",
              "key": "230407"
            },
            {
              "name": "东山区",
              "key": "230406"
            },
            {
              "name": "兴安区",
              "key": "230405"
            },
            {
              "name": "南山区",
              "key": "230404"
            },
            {
              "name": "工农区",
              "key": "230403"
            }
          ],
          "name": "鹤岗市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "恒山区",
              "key": "230303"
            },
            {
              "name": "鸡冠区",
              "key": "230302"
            },
            {
              "name": "市辖区",
              "key": "230301"
            },
            {
              "name": "鸡东县",
              "key": "230321"
            },
            {
              "name": "密山市",
              "key": "230382"
            },
            {
              "name": "虎林市",
              "key": "230381"
            },
            {
              "name": "麻山区",
              "key": "230307"
            },
            {
              "name": "城子河区",
              "key": "230306"
            },
            {
              "name": "梨树区",
              "key": "230305"
            },
            {
              "name": "滴道区",
              "key": "230304"
            }
          ],
          "name": "鸡西市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "讷河市",
              "key": "230281"
            },
            {
              "name": "铁锋区",
              "key": "230204"
            },
            {
              "name": "建华区",
              "key": "230203"
            },
            {
              "name": "甘南县",
              "key": "230225"
            },
            {
              "name": "龙沙区",
              "key": "230202"
            },
            {
              "name": "泰来县",
              "key": "230224"
            },
            {
              "name": "市辖区",
              "key": "230201"
            },
            {
              "name": "依安县",
              "key": "230223"
            },
            {
              "name": "龙江县",
              "key": "230221"
            },
            {
              "name": "拜泉县",
              "key": "230231"
            },
            {
              "name": "克东县",
              "key": "230230"
            },
            {
              "name": "梅里斯达斡尔族区",
              "key": "230208"
            },
            {
              "name": "碾子山区",
              "key": "230207"
            },
            {
              "name": "克山县",
              "key": "230229"
            },
            {
              "name": "富拉尔基区",
              "key": "230206"
            },
            {
              "name": "昂昂溪区",
              "key": "230205"
            },
            {
              "name": "富裕县",
              "key": "230227"
            }
          ],
          "name": "齐齐哈尔市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "五常市",
              "key": "230184"
            },
            {
              "name": "尚志市",
              "key": "230183"
            },
            {
              "name": "木兰县",
              "key": "230127"
            },
            {
              "name": "道外区",
              "key": "230104"
            },
            {
              "name": "巴彦县",
              "key": "230126"
            },
            {
              "name": "南岗区",
              "key": "230103"
            },
            {
              "name": "宾县",
              "key": "230125"
            },
            {
              "name": "道里区",
              "key": "230102"
            },
            {
              "name": "双城区",
              "key": "230113"
            },
            {
              "name": "方正县",
              "key": "230124"
            },
            {
              "name": "市辖区",
              "key": "230101"
            },
            {
              "name": "阿城区",
              "key": "230112"
            },
            {
              "name": "依兰县",
              "key": "230123"
            },
            {
              "name": "呼兰区",
              "key": "230111"
            },
            {
              "name": "香坊区",
              "key": "230110"
            },
            {
              "name": "松北区",
              "key": "230109"
            },
            {
              "name": "平房区",
              "key": "230108"
            },
            {
              "name": "延寿县",
              "key": "230129"
            },
            {
              "name": "通河县",
              "key": "230128"
            }
          ],
          "name": "哈尔滨市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "西安区",
              "key": "231005"
            },
            {
              "name": "爱民区",
              "key": "231004"
            },
            {
              "name": "阳明区",
              "key": "231003"
            },
            {
              "name": "林口县",
              "key": "231025"
            },
            {
              "name": "东安区",
              "key": "231002"
            },
            {
              "name": "市辖区",
              "key": "231001"
            },
            {
              "name": "东宁市",
              "key": "231086"
            },
            {
              "name": "穆棱市",
              "key": "231085"
            },
            {
              "name": "宁安市",
              "key": "231084"
            },
            {
              "name": "海林市",
              "key": "231083"
            },
            {
              "name": "绥芬河市",
              "key": "231081"
            }
          ],
          "name": "牡丹江市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "北安市",
              "key": "231181"
            },
            {
              "name": "五大连池市",
              "key": "231182"
            },
            {
              "name": "嫩江县",
              "key": "231121"
            },
            {
              "name": "市辖区",
              "key": "231101"
            },
            {
              "name": "逊克县",
              "key": "231123"
            },
            {
              "name": "爱辉区",
              "key": "231102"
            },
            {
              "name": "孙吴县",
              "key": "231124"
            }
          ],
          "name": "黑河市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "安达市",
              "key": "231281"
            },
            {
              "name": "肇东市",
              "key": "231282"
            },
            {
              "name": "海伦市",
              "key": "231283"
            },
            {
              "name": "望奎县",
              "key": "231221"
            },
            {
              "name": "兰西县",
              "key": "231222"
            },
            {
              "name": "市辖区",
              "key": "231201"
            },
            {
              "name": "青冈县",
              "key": "231223"
            },
            {
              "name": "北林区",
              "key": "231202"
            },
            {
              "name": "庆安县",
              "key": "231224"
            },
            {
              "name": "明水县",
              "key": "231225"
            },
            {
              "name": "绥棱县",
              "key": "231226"
            }
          ],
          "name": "绥化市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "茄子河区",
              "key": "230904"
            },
            {
              "name": "桃山区",
              "key": "230903"
            },
            {
              "name": "新兴区",
              "key": "230902"
            },
            {
              "name": "市辖区",
              "key": "230901"
            },
            {
              "name": "勃利县",
              "key": "230921"
            }
          ],
          "name": "七台河市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "抚远市",
              "key": "230883"
            },
            {
              "name": "富锦市",
              "key": "230882"
            },
            {
              "name": "同江市",
              "key": "230881"
            },
            {
              "name": "汤原县",
              "key": "230828"
            },
            {
              "name": "东风区",
              "key": "230805"
            },
            {
              "name": "前进区",
              "key": "230804"
            },
            {
              "name": "桦川县",
              "key": "230826"
            },
            {
              "name": "向阳区",
              "key": "230803"
            },
            {
              "name": "市辖区",
              "key": "230801"
            },
            {
              "name": "郊区",
              "key": "230811"
            },
            {
              "name": "桦南县",
              "key": "230822"
            }
          ],
          "name": "佳木斯市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "呼玛县",
              "key": "232721"
            },
            {
              "name": "塔河县",
              "key": "232722"
            },
            {
              "name": "漠河县",
              "key": "232723"
            }
          ],
          "name": "大兴安岭地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "金山屯区",
              "key": "230709"
            },
            {
              "name": "美溪区",
              "key": "230708"
            },
            {
              "name": "五营区",
              "key": "230710"
            },
            {
              "name": "铁力市",
              "key": "230781"
            },
            {
              "name": "新青区",
              "key": "230707"
            },
            {
              "name": "翠峦区",
              "key": "230706"
            },
            {
              "name": "西林区",
              "key": "230705"
            },
            {
              "name": "上甘岭区",
              "key": "230716"
            },
            {
              "name": "友好区",
              "key": "230704"
            },
            {
              "name": "红星区",
              "key": "230715"
            },
            {
              "name": "南岔区",
              "key": "230703"
            },
            {
              "name": "乌伊岭区",
              "key": "230714"
            },
            {
              "name": "伊春区",
              "key": "230702"
            },
            {
              "name": "带岭区",
              "key": "230713"
            },
            {
              "name": "市辖区",
              "key": "230701"
            },
            {
              "name": "汤旺河区",
              "key": "230712"
            },
            {
              "name": "乌马河区",
              "key": "230711"
            },
            {
              "name": "嘉荫县",
              "key": "230722"
            }
          ],
          "name": "伊春市",
          "key": "name"
        }
      ]
    },
    {
      "name": "青海省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "湟中县",
              "key": "630122"
            },
            {
              "name": "市辖区",
              "key": "630101"
            },
            {
              "name": "湟源县",
              "key": "630123"
            },
            {
              "name": "大通回族土族自治县",
              "key": "630121"
            },
            {
              "name": "城西区",
              "key": "630104"
            },
            {
              "name": "城北区",
              "key": "630105"
            },
            {
              "name": "城东区",
              "key": "630102"
            },
            {
              "name": "城中区",
              "key": "630103"
            }
          ],
          "name": "西宁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "民和回族土族自治县",
              "key": "630222"
            },
            {
              "name": "平安区",
              "key": "630203"
            },
            {
              "name": "循化撒拉族自治县",
              "key": "630225"
            },
            {
              "name": "互助土族自治县",
              "key": "630223"
            },
            {
              "name": "乐都区",
              "key": "630202"
            },
            {
              "name": "化隆回族自治县",
              "key": "630224"
            }
          ],
          "name": "海东市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "泽库县",
              "key": "632323"
            },
            {
              "name": "尖扎县",
              "key": "632322"
            },
            {
              "name": "同仁县",
              "key": "632321"
            },
            {
              "name": "河南蒙古族自治县",
              "key": "632324"
            }
          ],
          "name": "黄南藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "刚察县",
              "key": "632224"
            },
            {
              "name": "海晏县",
              "key": "632223"
            },
            {
              "name": "祁连县",
              "key": "632222"
            },
            {
              "name": "门源回族自治县",
              "key": "632221"
            }
          ],
          "name": "海北藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "都兰县",
              "key": "632822"
            },
            {
              "name": "乌兰县",
              "key": "632821"
            },
            {
              "name": "德令哈市",
              "key": "632802"
            },
            {
              "name": "格尔木市",
              "key": "632801"
            },
            {
              "name": "天峻县",
              "key": "632823"
            }
          ],
          "name": "海西蒙古族藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "玉树市",
              "key": "632701"
            },
            {
              "name": "称多县",
              "key": "632723"
            },
            {
              "name": "杂多县",
              "key": "632722"
            },
            {
              "name": "曲麻莱县",
              "key": "632726"
            },
            {
              "name": "囊谦县",
              "key": "632725"
            },
            {
              "name": "治多县",
              "key": "632724"
            }
          ],
          "name": "玉树藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "达日县",
              "key": "632624"
            },
            {
              "name": "甘德县",
              "key": "632623"
            },
            {
              "name": "班玛县",
              "key": "632622"
            },
            {
              "name": "玛沁县",
              "key": "632621"
            },
            {
              "name": "玛多县",
              "key": "632626"
            },
            {
              "name": "久治县",
              "key": "632625"
            }
          ],
          "name": "果洛藏族自治州",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "共和县",
              "key": "632521"
            },
            {
              "name": "贵南县",
              "key": "632525"
            },
            {
              "name": "兴海县",
              "key": "632524"
            },
            {
              "name": "贵德县",
              "key": "632523"
            },
            {
              "name": "同德县",
              "key": "632522"
            }
          ],
          "name": "海南藏族自治州",
          "key": "name"
        }
      ]
    },
    {
      "name": "河南省",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "山阳区",
              "key": "410811"
            },
            {
              "name": "博爱县",
              "key": "410822"
            },
            {
              "name": "修武县",
              "key": "410821"
            },
            {
              "name": "解放区",
              "key": "410802"
            },
            {
              "name": "市辖区",
              "key": "410801"
            },
            {
              "name": "武陟县",
              "key": "410823"
            },
            {
              "name": "孟州市",
              "key": "410883"
            },
            {
              "name": "沁阳市",
              "key": "410882"
            },
            {
              "name": "马村区",
              "key": "410804"
            },
            {
              "name": "中站区",
              "key": "410803"
            },
            {
              "name": "温县",
              "key": "410825"
            }
          ],
          "name": "焦作市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "410701"
            },
            {
              "name": "牧野区",
              "key": "410711"
            },
            {
              "name": "卫滨区",
              "key": "410703"
            },
            {
              "name": "原阳县",
              "key": "410725"
            },
            {
              "name": "红旗区",
              "key": "410702"
            },
            {
              "name": "获嘉县",
              "key": "410724"
            },
            {
              "name": "新乡县",
              "key": "410721"
            },
            {
              "name": "封丘县",
              "key": "410727"
            },
            {
              "name": "凤泉区",
              "key": "410704"
            },
            {
              "name": "延津县",
              "key": "410726"
            },
            {
              "name": "长垣县",
              "key": "410728"
            },
            {
              "name": "卫辉市",
              "key": "410781"
            },
            {
              "name": "辉县市",
              "key": "410782"
            }
          ],
          "name": "新乡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "410901"
            },
            {
              "name": "南乐县",
              "key": "410923"
            },
            {
              "name": "清丰县",
              "key": "410922"
            },
            {
              "name": "濮阳县",
              "key": "410928"
            },
            {
              "name": "华龙区",
              "key": "410902"
            },
            {
              "name": "台前县",
              "key": "410927"
            },
            {
              "name": "范县",
              "key": "410926"
            }
          ],
          "name": "濮阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "石龙区",
              "key": "410404"
            },
            {
              "name": "卫东区",
              "key": "410403"
            },
            {
              "name": "郏县",
              "key": "410425"
            },
            {
              "name": "湛河区",
              "key": "410411"
            },
            {
              "name": "叶县",
              "key": "410422"
            },
            {
              "name": "宝丰县",
              "key": "410421"
            },
            {
              "name": "新华区",
              "key": "410402"
            },
            {
              "name": "市辖区",
              "key": "410401"
            },
            {
              "name": "鲁山县",
              "key": "410423"
            },
            {
              "name": "汝州市",
              "key": "410482"
            },
            {
              "name": "舞钢市",
              "key": "410481"
            }
          ],
          "name": "平顶山市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "潢川县",
              "key": "411526"
            },
            {
              "name": "平桥区",
              "key": "411503"
            },
            {
              "name": "固始县",
              "key": "411525"
            },
            {
              "name": "息县",
              "key": "411528"
            },
            {
              "name": "淮滨县",
              "key": "411527"
            },
            {
              "name": "光山县",
              "key": "411522"
            },
            {
              "name": "罗山县",
              "key": "411521"
            },
            {
              "name": "浉河区",
              "key": "411502"
            },
            {
              "name": "商城县",
              "key": "411524"
            },
            {
              "name": "市辖区",
              "key": "411501"
            },
            {
              "name": "新县",
              "key": "411523"
            }
          ],
          "name": "信阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "涧西区",
              "key": "410305"
            },
            {
              "name": "宜阳县",
              "key": "410327"
            },
            {
              "name": "瀍河回族区",
              "key": "410304"
            },
            {
              "name": "汝阳县",
              "key": "410326"
            },
            {
              "name": "伊川县",
              "key": "410329"
            },
            {
              "name": "吉利区",
              "key": "410306"
            },
            {
              "name": "洛宁县",
              "key": "410328"
            },
            {
              "name": "市辖区",
              "key": "410301"
            },
            {
              "name": "新安县",
              "key": "410323"
            },
            {
              "name": "洛龙区",
              "key": "410311"
            },
            {
              "name": "孟津县",
              "key": "410322"
            },
            {
              "name": "西工区",
              "key": "410303"
            },
            {
              "name": "嵩县",
              "key": "410325"
            },
            {
              "name": "老城区",
              "key": "410302"
            },
            {
              "name": "栾川县",
              "key": "410324"
            },
            {
              "name": "偃师市",
              "key": "410381"
            }
          ],
          "name": "洛阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "夏邑县",
              "key": "411426"
            },
            {
              "name": "市辖区",
              "key": "411401"
            },
            {
              "name": "宁陵县",
              "key": "411423"
            },
            {
              "name": "睢县",
              "key": "411422"
            },
            {
              "name": "睢阳区",
              "key": "411403"
            },
            {
              "name": "虞城县",
              "key": "411425"
            },
            {
              "name": "梁园区",
              "key": "411402"
            },
            {
              "name": "柘城县",
              "key": "411424"
            },
            {
              "name": "民权县",
              "key": "411421"
            },
            {
              "name": "永城市",
              "key": "411481"
            }
          ],
          "name": "商丘市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "鹤山区",
              "key": "410602"
            },
            {
              "name": "市辖区",
              "key": "410601"
            },
            {
              "name": "山城区",
              "key": "410603"
            },
            {
              "name": "淇滨区",
              "key": "410611"
            },
            {
              "name": "淇县",
              "key": "410622"
            },
            {
              "name": "浚县",
              "key": "410621"
            }
          ],
          "name": "鹤壁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "驿城区",
              "key": "411702"
            },
            {
              "name": "正阳县",
              "key": "411724"
            },
            {
              "name": "市辖区",
              "key": "411701"
            },
            {
              "name": "平舆县",
              "key": "411723"
            },
            {
              "name": "泌阳县",
              "key": "411726"
            },
            {
              "name": "确山县",
              "key": "411725"
            },
            {
              "name": "上蔡县",
              "key": "411722"
            },
            {
              "name": "西平县",
              "key": "411721"
            },
            {
              "name": "遂平县",
              "key": "411728"
            },
            {
              "name": "汝南县",
              "key": "411727"
            },
            {
              "name": "新蔡县",
              "key": "411729"
            }
          ],
          "name": "驻马店市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "北关区",
              "key": "410503"
            },
            {
              "name": "文峰区",
              "key": "410502"
            },
            {
              "name": "殷都区",
              "key": "410505"
            },
            {
              "name": "内黄县",
              "key": "410527"
            },
            {
              "name": "滑县",
              "key": "410526"
            },
            {
              "name": "市辖区",
              "key": "410501"
            },
            {
              "name": "汤阴县",
              "key": "410523"
            },
            {
              "name": "安阳县",
              "key": "410522"
            },
            {
              "name": "龙安区",
              "key": "410506"
            },
            {
              "name": "林州市",
              "key": "410581"
            }
          ],
          "name": "安阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "郸城县",
              "key": "411625"
            },
            {
              "name": "川汇区",
              "key": "411602"
            },
            {
              "name": "沈丘县",
              "key": "411624"
            },
            {
              "name": "太康县",
              "key": "411627"
            },
            {
              "name": "淮阳县",
              "key": "411626"
            },
            {
              "name": "扶沟县",
              "key": "411621"
            },
            {
              "name": "市辖区",
              "key": "411601"
            },
            {
              "name": "商水县",
              "key": "411623"
            },
            {
              "name": "西华县",
              "key": "411622"
            },
            {
              "name": "鹿邑县",
              "key": "411628"
            },
            {
              "name": "项城市",
              "key": "411681"
            }
          ],
          "name": "周口市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "召陵区",
              "key": "411104"
            },
            {
              "name": "郾城区",
              "key": "411103"
            },
            {
              "name": "临颍县",
              "key": "411122"
            },
            {
              "name": "舞阳县",
              "key": "411121"
            },
            {
              "name": "源汇区",
              "key": "411102"
            },
            {
              "name": "市辖区",
              "key": "411101"
            }
          ],
          "name": "漯河市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "禹州市",
              "key": "411081"
            },
            {
              "name": "长葛市",
              "key": "411082"
            },
            {
              "name": "市辖区",
              "key": "411001"
            },
            {
              "name": "许昌县",
              "key": "411023"
            },
            {
              "name": "襄城县",
              "key": "411025"
            },
            {
              "name": "魏都区",
              "key": "411002"
            },
            {
              "name": "鄢陵县",
              "key": "411024"
            }
          ],
          "name": "许昌市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "禹王台区",
              "key": "410205"
            },
            {
              "name": "龙亭区",
              "key": "410202"
            },
            {
              "name": "市辖区",
              "key": "410201"
            },
            {
              "name": "祥符区",
              "key": "410212"
            },
            {
              "name": "尉氏县",
              "key": "410223"
            },
            {
              "name": "鼓楼区",
              "key": "410204"
            },
            {
              "name": "顺河回族区",
              "key": "410203"
            },
            {
              "name": "兰考县",
              "key": "410225"
            },
            {
              "name": "金明区",
              "key": "410211"
            },
            {
              "name": "通许县",
              "key": "410222"
            },
            {
              "name": "杞县",
              "key": "410221"
            }
          ],
          "name": "开封市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "唐河县",
              "key": "411328"
            },
            {
              "name": "社旗县",
              "key": "411327"
            },
            {
              "name": "新野县",
              "key": "411329"
            },
            {
              "name": "宛城区",
              "key": "411302"
            },
            {
              "name": "镇平县",
              "key": "411324"
            },
            {
              "name": "市辖区",
              "key": "411301"
            },
            {
              "name": "西峡县",
              "key": "411323"
            },
            {
              "name": "淅川县",
              "key": "411326"
            },
            {
              "name": "卧龙区",
              "key": "411303"
            },
            {
              "name": "内乡县",
              "key": "411325"
            },
            {
              "name": "桐柏县",
              "key": "411330"
            },
            {
              "name": "方城县",
              "key": "411322"
            },
            {
              "name": "南召县",
              "key": "411321"
            },
            {
              "name": "邓州市",
              "key": "411381"
            }
          ],
          "name": "南阳市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "上街区",
              "key": "410106"
            },
            {
              "name": "惠济区",
              "key": "410108"
            },
            {
              "name": "二七区",
              "key": "410103"
            },
            {
              "name": "中原区",
              "key": "410102"
            },
            {
              "name": "金水区",
              "key": "410105"
            },
            {
              "name": "管城回族区",
              "key": "410104"
            },
            {
              "name": "巩义市",
              "key": "410181"
            },
            {
              "name": "市辖区",
              "key": "410101"
            },
            {
              "name": "中牟县",
              "key": "410122"
            },
            {
              "name": "新密市",
              "key": "410183"
            },
            {
              "name": "荥阳市",
              "key": "410182"
            },
            {
              "name": "登封市",
              "key": "410185"
            },
            {
              "name": "新郑市",
              "key": "410184"
            }
          ],
          "name": "郑州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "义马市",
              "key": "411281"
            },
            {
              "name": "陕州区",
              "key": "411203"
            },
            {
              "name": "湖滨区",
              "key": "411202"
            },
            {
              "name": "卢氏县",
              "key": "411224"
            },
            {
              "name": "渑池县",
              "key": "411221"
            },
            {
              "name": "市辖区",
              "key": "411201"
            },
            {
              "name": "灵宝市",
              "key": "411282"
            }
          ],
          "name": "三门峡市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "济源市",
              "key": "419001"
            }
          ],
          "name": "省直辖县级行政区划",
          "key": "name"
        }
      ]
    },
    {
      "name": "内蒙古自治区",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "临河区",
              "key": "150802"
            },
            {
              "name": "乌拉特中旗",
              "key": "150824"
            },
            {
              "name": "乌拉特后旗",
              "key": "150825"
            },
            {
              "name": "磴口县",
              "key": "150822"
            },
            {
              "name": "市辖区",
              "key": "150801"
            },
            {
              "name": "乌拉特前旗",
              "key": "150823"
            },
            {
              "name": "五原县",
              "key": "150821"
            },
            {
              "name": "杭锦后旗",
              "key": "150826"
            }
          ],
          "name": "巴彦淖尔市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "集宁区",
              "key": "150902"
            },
            {
              "name": "兴和县",
              "key": "150924"
            },
            {
              "name": "市辖区",
              "key": "150901"
            },
            {
              "name": "商都县",
              "key": "150923"
            },
            {
              "name": "化德县",
              "key": "150922"
            },
            {
              "name": "卓资县",
              "key": "150921"
            },
            {
              "name": "丰镇市",
              "key": "150981"
            },
            {
              "name": "四子王旗",
              "key": "150929"
            },
            {
              "name": "察哈尔右翼后旗",
              "key": "150928"
            },
            {
              "name": "察哈尔右翼中旗",
              "key": "150927"
            },
            {
              "name": "察哈尔右翼前旗",
              "key": "150926"
            },
            {
              "name": "凉城县",
              "key": "150925"
            }
          ],
          "name": "乌兰察布市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "乌审旗",
              "key": "150626"
            },
            {
              "name": "伊金霍洛旗",
              "key": "150627"
            },
            {
              "name": "东胜区",
              "key": "150602"
            },
            {
              "name": "鄂托克旗",
              "key": "150624"
            },
            {
              "name": "康巴什区",
              "key": "150603"
            },
            {
              "name": "杭锦旗",
              "key": "150625"
            },
            {
              "name": "准格尔旗",
              "key": "150622"
            },
            {
              "name": "市辖区",
              "key": "150601"
            },
            {
              "name": "鄂托克前旗",
              "key": "150623"
            },
            {
              "name": "达拉特旗",
              "key": "150621"
            }
          ],
          "name": "鄂尔多斯市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "额济纳旗",
              "key": "152923"
            },
            {
              "name": "阿拉善右旗",
              "key": "152922"
            },
            {
              "name": "阿拉善左旗",
              "key": "152921"
            }
          ],
          "name": "阿拉善盟",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "新巴尔虎右旗",
              "key": "150727"
            },
            {
              "name": "扎赉诺尔区",
              "key": "150703"
            },
            {
              "name": "陈巴尔虎旗",
              "key": "150725"
            },
            {
              "name": "新巴尔虎左旗",
              "key": "150726"
            },
            {
              "name": "市辖区",
              "key": "150701"
            },
            {
              "name": "鄂伦春自治旗",
              "key": "150723"
            },
            {
              "name": "海拉尔区",
              "key": "150702"
            },
            {
              "name": "鄂温克族自治旗",
              "key": "150724"
            },
            {
              "name": "阿荣旗",
              "key": "150721"
            },
            {
              "name": "莫力达瓦达斡尔族自治旗",
              "key": "150722"
            },
            {
              "name": "根河市",
              "key": "150785"
            },
            {
              "name": "扎兰屯市",
              "key": "150783"
            },
            {
              "name": "额尔古纳市",
              "key": "150784"
            },
            {
              "name": "满洲里市",
              "key": "150781"
            },
            {
              "name": "牙克石市",
              "key": "150782"
            }
          ],
          "name": "呼伦贝尔市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "喀喇沁旗",
              "key": "150428"
            },
            {
              "name": "宁城县",
              "key": "150429"
            },
            {
              "name": "松山区",
              "key": "150404"
            },
            {
              "name": "翁牛特旗",
              "key": "150426"
            },
            {
              "name": "红山区",
              "key": "150402"
            },
            {
              "name": "林西县",
              "key": "150424"
            },
            {
              "name": "元宝山区",
              "key": "150403"
            },
            {
              "name": "克什克腾旗",
              "key": "150425"
            },
            {
              "name": "巴林左旗",
              "key": "150422"
            },
            {
              "name": "市辖区",
              "key": "150401"
            },
            {
              "name": "巴林右旗",
              "key": "150423"
            },
            {
              "name": "阿鲁科尔沁旗",
              "key": "150421"
            },
            {
              "name": "敖汉旗",
              "key": "150430"
            }
          ],
          "name": "赤峰市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "奈曼旗",
              "key": "150525"
            },
            {
              "name": "扎鲁特旗",
              "key": "150526"
            },
            {
              "name": "市辖区",
              "key": "150501"
            },
            {
              "name": "开鲁县",
              "key": "150523"
            },
            {
              "name": "科尔沁区",
              "key": "150502"
            },
            {
              "name": "库伦旗",
              "key": "150524"
            },
            {
              "name": "科尔沁左翼中旗",
              "key": "150521"
            },
            {
              "name": "科尔沁左翼后旗",
              "key": "150522"
            },
            {
              "name": "霍林郭勒市",
              "key": "150581"
            }
          ],
          "name": "通辽市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "白云鄂博矿区",
              "key": "150206"
            },
            {
              "name": "九原区",
              "key": "150207"
            },
            {
              "name": "青山区",
              "key": "150204"
            },
            {
              "name": "石拐区",
              "key": "150205"
            },
            {
              "name": "东河区",
              "key": "150202"
            },
            {
              "name": "昆都仑区",
              "key": "150203"
            },
            {
              "name": "固阳县",
              "key": "150222"
            },
            {
              "name": "市辖区",
              "key": "150201"
            },
            {
              "name": "达尔罕茂明安联合旗",
              "key": "150223"
            },
            {
              "name": "土默特右旗",
              "key": "150221"
            }
          ],
          "name": "包头市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "正镶白旗",
              "key": "152529"
            },
            {
              "name": "镶黄旗",
              "key": "152528"
            },
            {
              "name": "太仆寺旗",
              "key": "152527"
            },
            {
              "name": "西乌珠穆沁旗",
              "key": "152526"
            },
            {
              "name": "东乌珠穆沁旗",
              "key": "152525"
            },
            {
              "name": "锡林浩特市",
              "key": "152502"
            },
            {
              "name": "苏尼特右旗",
              "key": "152524"
            },
            {
              "name": "二连浩特市",
              "key": "152501"
            },
            {
              "name": "苏尼特左旗",
              "key": "152523"
            },
            {
              "name": "阿巴嘎旗",
              "key": "152522"
            },
            {
              "name": "多伦县",
              "key": "152531"
            },
            {
              "name": "正蓝旗",
              "key": "152530"
            }
          ],
          "name": "锡林郭勒盟",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "海南区",
              "key": "150303"
            },
            {
              "name": "乌达区",
              "key": "150304"
            },
            {
              "name": "市辖区",
              "key": "150301"
            },
            {
              "name": "海勃湾区",
              "key": "150302"
            }
          ],
          "name": "乌海市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "赛罕区",
              "key": "150105"
            },
            {
              "name": "回民区",
              "key": "150103"
            },
            {
              "name": "武川县",
              "key": "150125"
            },
            {
              "name": "玉泉区",
              "key": "150104"
            },
            {
              "name": "市辖区",
              "key": "150101"
            },
            {
              "name": "和林格尔县",
              "key": "150123"
            },
            {
              "name": "新城区",
              "key": "150102"
            },
            {
              "name": "清水河县",
              "key": "150124"
            },
            {
              "name": "土默特左旗",
              "key": "150121"
            },
            {
              "name": "托克托县",
              "key": "150122"
            }
          ],
          "name": "呼和浩特市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "阿尔山市",
              "key": "152202"
            },
            {
              "name": "突泉县",
              "key": "152224"
            },
            {
              "name": "乌兰浩特市",
              "key": "152201"
            },
            {
              "name": "扎赉特旗",
              "key": "152223"
            },
            {
              "name": "科尔沁右翼中旗",
              "key": "152222"
            },
            {
              "name": "科尔沁右翼前旗",
              "key": "152221"
            }
          ],
          "name": "兴安盟",
          "key": "name"
        }
      ]
    },
    {
      "name": "西藏自治区",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "贡嘎县",
              "key": "540522"
            },
            {
              "name": "市辖区",
              "key": "540501"
            },
            {
              "name": "桑日县",
              "key": "540523"
            },
            {
              "name": "乃东区",
              "key": "540502"
            },
            {
              "name": "琼结县",
              "key": "540524"
            },
            {
              "name": "曲松县",
              "key": "540525"
            },
            {
              "name": "错那县",
              "key": "540530"
            },
            {
              "name": "浪卡子县",
              "key": "540531"
            },
            {
              "name": "扎囊县",
              "key": "540521"
            },
            {
              "name": "措美县",
              "key": "540526"
            },
            {
              "name": "洛扎县",
              "key": "540527"
            },
            {
              "name": "加查县",
              "key": "540528"
            },
            {
              "name": "隆子县",
              "key": "540529"
            }
          ],
          "name": "山南市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "达孜县",
              "key": "540126"
            },
            {
              "name": "墨竹工卡县",
              "key": "540127"
            },
            {
              "name": "当雄县",
              "key": "540122"
            },
            {
              "name": "市辖区",
              "key": "540101"
            },
            {
              "name": "尼木县",
              "key": "540123"
            },
            {
              "name": "城关区",
              "key": "540102"
            },
            {
              "name": "曲水县",
              "key": "540124"
            },
            {
              "name": "堆龙德庆区",
              "key": "540103"
            },
            {
              "name": "林周县",
              "key": "540121"
            }
          ],
          "name": "拉萨市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "申扎县",
              "key": "542426"
            },
            {
              "name": "安多县",
              "key": "542425"
            },
            {
              "name": "班戈县",
              "key": "542428"
            },
            {
              "name": "索县",
              "key": "542427"
            },
            {
              "name": "嘉黎县",
              "key": "542422"
            },
            {
              "name": "那曲县",
              "key": "542421"
            },
            {
              "name": "聂荣县",
              "key": "542424"
            },
            {
              "name": "比如县",
              "key": "542423"
            },
            {
              "name": "双湖县",
              "key": "542431"
            },
            {
              "name": "尼玛县",
              "key": "542430"
            },
            {
              "name": "巴青县",
              "key": "542429"
            }
          ],
          "name": "那曲地区",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "拉孜县",
              "key": "540225"
            },
            {
              "name": "萨嘎县",
              "key": "540236"
            },
            {
              "name": "昂仁县",
              "key": "540226"
            },
            {
              "name": "岗巴县",
              "key": "540237"
            },
            {
              "name": "谢通门县",
              "key": "540227"
            },
            {
              "name": "白朗县",
              "key": "540228"
            },
            {
              "name": "南木林县",
              "key": "540221"
            },
            {
              "name": "仲巴县",
              "key": "540232"
            },
            {
              "name": "江孜县",
              "key": "540222"
            },
            {
              "name": "亚东县",
              "key": "540233"
            },
            {
              "name": "定日县",
              "key": "540223"
            },
            {
              "name": "吉隆县",
              "key": "540234"
            },
            {
              "name": "桑珠孜区",
              "key": "540202"
            },
            {
              "name": "萨迦县",
              "key": "540224"
            },
            {
              "name": "聂拉木县",
              "key": "540235"
            },
            {
              "name": "仁布县",
              "key": "540229"
            },
            {
              "name": "康马县",
              "key": "540230"
            },
            {
              "name": "定结县",
              "key": "540231"
            }
          ],
          "name": "日喀则市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "卡若区",
              "key": "540302"
            },
            {
              "name": "丁青县",
              "key": "540324"
            },
            {
              "name": "察雅县",
              "key": "540325"
            },
            {
              "name": "八宿县",
              "key": "540326"
            },
            {
              "name": "左贡县",
              "key": "540327"
            },
            {
              "name": "江达县",
              "key": "540321"
            },
            {
              "name": "贡觉县",
              "key": "540322"
            },
            {
              "name": "类乌齐县",
              "key": "540323"
            },
            {
              "name": "边坝县",
              "key": "540330"
            },
            {
              "name": "芒康县",
              "key": "540328"
            },
            {
              "name": "洛隆县",
              "key": "540329"
            }
          ],
          "name": "昌都市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "墨脱县",
              "key": "540423"
            },
            {
              "name": "巴宜区",
              "key": "540402"
            },
            {
              "name": "波密县",
              "key": "540424"
            },
            {
              "name": "察隅县",
              "key": "540425"
            },
            {
              "name": "朗县",
              "key": "540426"
            },
            {
              "name": "工布江达县",
              "key": "540421"
            },
            {
              "name": "米林县",
              "key": "540422"
            }
          ],
          "name": "林芝市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "革吉县",
              "key": "542525"
            },
            {
              "name": "日土县",
              "key": "542524"
            },
            {
              "name": "措勤县",
              "key": "542527"
            },
            {
              "name": "改则县",
              "key": "542526"
            },
            {
              "name": "普兰县",
              "key": "542521"
            },
            {
              "name": "噶尔县",
              "key": "542523"
            },
            {
              "name": "札达县",
              "key": "542522"
            }
          ],
          "name": "阿里地区",
          "key": "name"
        }
      ]
    },
    {
      "name": "广西壮族自治区",
      "key": "name",
      "children": [
        {
          "children": [
            {
              "name": "覃塘区",
              "key": "450804"
            },
            {
              "name": "港南区",
              "key": "450803"
            },
            {
              "name": "平南县",
              "key": "450821"
            },
            {
              "name": "港北区",
              "key": "450802"
            },
            {
              "name": "市辖区",
              "key": "450801"
            },
            {
              "name": "桂平市",
              "key": "450881"
            }
          ],
          "name": "贵港市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "市辖区",
              "key": "450701"
            },
            {
              "name": "浦北县",
              "key": "450722"
            },
            {
              "name": "钦北区",
              "key": "450703"
            },
            {
              "name": "钦南区",
              "key": "450702"
            },
            {
              "name": "灵山县",
              "key": "450721"
            }
          ],
          "name": "钦州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "福绵区",
              "key": "450903"
            },
            {
              "name": "玉州区",
              "key": "450902"
            },
            {
              "name": "兴业县",
              "key": "450924"
            },
            {
              "name": "容县",
              "key": "450921"
            },
            {
              "name": "市辖区",
              "key": "450901"
            },
            {
              "name": "博白县",
              "key": "450923"
            },
            {
              "name": "陆川县",
              "key": "450922"
            },
            {
              "name": "北流市",
              "key": "450981"
            }
          ],
          "name": "玉林市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "岑溪市",
              "key": "450481"
            },
            {
              "name": "万秀区",
              "key": "450403"
            },
            {
              "name": "龙圩区",
              "key": "450406"
            },
            {
              "name": "长洲区",
              "key": "450405"
            },
            {
              "name": "藤县",
              "key": "450422"
            },
            {
              "name": "苍梧县",
              "key": "450421"
            },
            {
              "name": "市辖区",
              "key": "450401"
            },
            {
              "name": "蒙山县",
              "key": "450423"
            }
          ],
          "name": "梧州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "七星区",
              "key": "450305"
            },
            {
              "name": "灌阳县",
              "key": "450327"
            },
            {
              "name": "象山区",
              "key": "450304"
            },
            {
              "name": "永福县",
              "key": "450326"
            },
            {
              "name": "资源县",
              "key": "450329"
            },
            {
              "name": "龙胜各族自治县",
              "key": "450328"
            },
            {
              "name": "市辖区",
              "key": "450301"
            },
            {
              "name": "临桂区",
              "key": "450312"
            },
            {
              "name": "灵川县",
              "key": "450323"
            },
            {
              "name": "雁山区",
              "key": "450311"
            },
            {
              "name": "叠彩区",
              "key": "450303"
            },
            {
              "name": "兴安县",
              "key": "450325"
            },
            {
              "name": "秀峰区",
              "key": "450302"
            },
            {
              "name": "全州县",
              "key": "450324"
            },
            {
              "name": "平乐县",
              "key": "450330"
            },
            {
              "name": "阳朔县",
              "key": "450321"
            },
            {
              "name": "恭城瑶族自治县",
              "key": "450332"
            },
            {
              "name": "荔浦县",
              "key": "450331"
            }
          ],
          "name": "桂林市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "凭祥市",
              "key": "451481"
            },
            {
              "name": "市辖区",
              "key": "451401"
            },
            {
              "name": "龙州县",
              "key": "451423"
            },
            {
              "name": "宁明县",
              "key": "451422"
            },
            {
              "name": "天等县",
              "key": "451425"
            },
            {
              "name": "江州区",
              "key": "451402"
            },
            {
              "name": "大新县",
              "key": "451424"
            },
            {
              "name": "扶绥县",
              "key": "451421"
            }
          ],
          "name": "崇左市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "港口区",
              "key": "450602"
            },
            {
              "name": "市辖区",
              "key": "450601"
            },
            {
              "name": "防城区",
              "key": "450603"
            },
            {
              "name": "上思县",
              "key": "450621"
            },
            {
              "name": "东兴市",
              "key": "450681"
            }
          ],
          "name": "防城港市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "银海区",
              "key": "450503"
            },
            {
              "name": "海城区",
              "key": "450502"
            },
            {
              "name": "合浦县",
              "key": "450521"
            },
            {
              "name": "市辖区",
              "key": "450501"
            },
            {
              "name": "铁山港区",
              "key": "450512"
            }
          ],
          "name": "北海市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "平桂区",
              "key": "451103"
            },
            {
              "name": "钟山县",
              "key": "451122"
            },
            {
              "name": "昭平县",
              "key": "451121"
            },
            {
              "name": "八步区",
              "key": "451102"
            },
            {
              "name": "市辖区",
              "key": "451101"
            },
            {
              "name": "富川瑶族自治县",
              "key": "451123"
            }
          ],
          "name": "贺州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "西林县",
              "key": "451030"
            },
            {
              "name": "田阳县",
              "key": "451021"
            },
            {
              "name": "隆林各族自治县",
              "key": "451031"
            },
            {
              "name": "靖西市",
              "key": "451081"
            },
            {
              "name": "凌云县",
              "key": "451027"
            },
            {
              "name": "那坡县",
              "key": "451026"
            },
            {
              "name": "田林县",
              "key": "451029"
            },
            {
              "name": "乐业县",
              "key": "451028"
            },
            {
              "name": "市辖区",
              "key": "451001"
            },
            {
              "name": "平果县",
              "key": "451023"
            },
            {
              "name": "田东县",
              "key": "451022"
            },
            {
              "name": "右江区",
              "key": "451002"
            },
            {
              "name": "德保县",
              "key": "451024"
            }
          ],
          "name": "百色市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "柳江区",
              "key": "450206"
            },
            {
              "name": "柳北区",
              "key": "450205"
            },
            {
              "name": "城中区",
              "key": "450202"
            },
            {
              "name": "融安县",
              "key": "450224"
            },
            {
              "name": "市辖区",
              "key": "450201"
            },
            {
              "name": "鹿寨县",
              "key": "450223"
            },
            {
              "name": "柳南区",
              "key": "450204"
            },
            {
              "name": "三江侗族自治县",
              "key": "450226"
            },
            {
              "name": "鱼峰区",
              "key": "450203"
            },
            {
              "name": "融水苗族自治县",
              "key": "450225"
            },
            {
              "name": "柳城县",
              "key": "450222"
            }
          ],
          "name": "柳州市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "合山市",
              "key": "451381"
            },
            {
              "name": "兴宾区",
              "key": "451302"
            },
            {
              "name": "金秀瑶族自治县",
              "key": "451324"
            },
            {
              "name": "市辖区",
              "key": "451301"
            },
            {
              "name": "武宣县",
              "key": "451323"
            },
            {
              "name": "象州县",
              "key": "451322"
            },
            {
              "name": "忻城县",
              "key": "451321"
            }
          ],
          "name": "来宾市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "西乡塘区",
              "key": "450107"
            },
            {
              "name": "邕宁区",
              "key": "450109"
            },
            {
              "name": "良庆区",
              "key": "450108"
            },
            {
              "name": "青秀区",
              "key": "450103"
            },
            {
              "name": "上林县",
              "key": "450125"
            },
            {
              "name": "兴宁区",
              "key": "450102"
            },
            {
              "name": "马山县",
              "key": "450124"
            },
            {
              "name": "江南区",
              "key": "450105"
            },
            {
              "name": "横县",
              "key": "450127"
            },
            {
              "name": "宾阳县",
              "key": "450126"
            },
            {
              "name": "武鸣区",
              "key": "450110"
            },
            {
              "name": "市辖区",
              "key": "450101"
            },
            {
              "name": "隆安县",
              "key": "450123"
            }
          ],
          "name": "南宁市",
          "key": "name"
        },
        {
          "children": [
            {
              "name": "大化瑶族自治县",
              "key": "451229"
            },
            {
              "name": "都安瑶族自治县",
              "key": "451228"
            },
            {
              "name": "宜州市",
              "key": "451281"
            },
            {
              "name": "罗城仫佬族自治县",
              "key": "451225"
            },
            {
              "name": "金城江区",
              "key": "451202"
            },
            {
              "name": "东兰县",
              "key": "451224"
            },
            {
              "name": "巴马瑶族自治县",
              "key": "451227"
            },
            {
              "name": "环江毛南族自治县",
              "key": "451226"
            },
            {
              "name": "南丹县",
              "key": "451221"
            },
            {
              "name": "市辖区",
              "key": "451201"
            },
            {
              "name": "凤山县",
              "key": "451223"
            },
            {
              "name": "天峨县",
              "key": "451222"
            }
          ],
          "name": "河池市",
          "key": "name"
        }
      ]
    }
  ]
}